{"id":"c1","number":1865,"headline":{"en":"MRI Reconstruction Algorithms","da":"MRI Rekonstruktionsalgoritmer"},"content":{"en":"MRI Reconstruction Algorithms: Researchers are exploring various algorithms to improve the reconstruction of magnetic resonance imaging (MRI) from undersampled data. These algorithms include convolutional sparse coding in the gradient domain, generative adversarial networks with cyclic loss, deep de-aliasing generative adversarial networks, deep cascade of convolutional neural networks, adaptive tight frame in the gradient domain, deep generative adversarial neural networks, multi-scale dilated residual convolution network, deep frequency-division network, efficient and light-weight MR reconstruction network, deep convolutional neural network architecture for CS-MRI, dual domain dense network, deep Gaussian denoisers, deartifacting module, transformer-based deep learning model, high-throughput fast iterative shrinkage thresholding network, and gradient-enhanced fusion network. These algorithms aim to enhance the quality and efficiency of MRI reconstruction, leading to improved medical imaging.","da":"MRI Rekonstruktionsalgoritmer: Forskere undersøger forskellige algoritmer for at forbedre rekonstruktionen af magnetisk resonansafbildning (MRI) fra undersamplede data. Disse algoritmer inkluderer konvolutionel sparsom kodning i gradientdomænet, generative adversariale netværk med cyklisk tab, dyb de-aliasing generative adversariale netværk, dyb kaskade af konvolutionelle neurale netværk, adaptiv stram ramme i gradientdomænet, dyb generativt adversarialt neuralt netværk, multi-skala dilateret residual konvolutionelt netværk, dybt frekvensdelingsnetværk, effektivt og letvægts MR-rekonstruktionsnetværk, dyb konvolutionel neuralt netværksarkitektur for CS-MRI, dobbeltdomænes tæt netværk, dybe Gaussiske støjdæmpere, deartefakteringsmodul, transformer-baseret dyb læringsmodel, høj-gennemstrømning hurtig iterative krympetærskel netværk, og gradient-forstærket fusionsnetværk. Disse algoritmer sigter mod at forbedre kvaliteten og effektiviteten af MRI-rekonstruktion, hvilket fører til forbedret medicinsk billeddannelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}