{"id":"c1054","number":226,"headline":{"en":"Spherical Robot Control","da":"Sfærisk robotkontrol"},"content":{"en":"Spherical Robot Control: Researchers have been exploring various motion planning and control problems for spherical mobile robots. They have developed algorithms that can reconfigure and stabilize the robots, plan their paths using simple geometrical notions, design and analyze robots that fall outside existing algorithms, control robots with modified propulsion mechanisms, achieve position and pose convergence, control path following on inclined planes, plan motion using dynamic formulation and iterative steering algorithms, achieve point-to-point motion control on inclined planes, control the motion of combined type robots, control robots propelled by omniwheel platforms, achieve optimal motion planning and control using Dynamic Programming, develop adaptive tracking control for pendulum-driven robots, model and control electromagnetic direct driven motion generators, achieve nonlinear optimal control using H-infinity approaches, model and control robots in simulators, develop software and hardware frameworks for exploration in harsh environments, and control real robots with internal pendulum mechanisms.","da":"Sfærisk robotkontrol: Forskere har udforsket forskellige bevægelsesplanlægning og kontrolproblemer for sfæriske mobile robotter. De har udviklet algoritmer, der kan rekonfigurere og stabilisere robotterne, planlægge deres ruter ved hjælp af simple geometriske begreber, designe og analysere robotter der falder udenfor eksisterende algoritmer, kontrollere robotter med modificerede fremdriftsmekanismer, opnå position- og holdningskonvergens, kontrollere stifølgning på skråninger, planlægge bevægelse ved brug af dynamisk formulering og iterative styringsalgoritmer, opnå punkt-til-punkt bevægelseskontrol på skråninger, kontrollere bevægelsen af kombinerede typer robotter, kontrollere robotter drevet af omniwheel-platforme, opnå optimal bevægelsesplanlægning og kontrol ved brug af dynamisk programmering, udvikle adaptiv sporingskontrol for pendul-drevne robotter, modellere og kontrollere elektromagnetiske direkte drevne bevægelsesgeneratorer, opnå ikke-lineær optimal kontrol ved brug af H-infinity metoder, modellere og kontrollere robotter i simulatorer, udvikle software- og hardware-rammer for udforskning i barske miljøer, og kontrollere virkelige robotter med interne pendulmekanismer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}