{"id":"c1104","number":2779,"headline":{"en":"Digital Challenges","da":"Digitale udfordringer"},"content":{"en":"Digital Challenges: Digital social research is facing a crisis when confronted with algorithms and ubiquitous digital data, which raises questions about the role of qualitative research in this context. The introduction of digital technologies suggests a loss of human authority over the future pathway of these technologies, potentially leading to inequality. Algorithmic decision-making and the responsible use of digital data are subjects of transdisciplinary theory and practice processes, with unintended side effects of the digital transition needing to be addressed. Inequalities in online labor markets and negative effects of algorithmic decision-making for vulnerable population groups are also key concerns. The development of digital sociology as a field of study highlights the crucial shifts brought by digitally mediated life, while ethical challenges associated with digital transformation include exposure of private life, changes in communication culture, and concentration of corporate power. The impacts of Covid-19 on digitized societies have accelerated the adoption of digital solutions, creating opportunities and risks that require policy responses. Social sciences contribute to measuring societal impacts and assessing ethical issues in the digital age, while digital rationality creates complex vulnerabilities to society and nature. Digital failure challenges existing systems and reveals the flaws and political abuse of data, and a feminist conceptual lens can address inequities and false equivalences in digital health. Digital social research explores new topics, digital biases, and methodological challenges in acquiring and analyzing digital data. The relationship between digital transformation, digital transition, and economic policy is crucial, as failure in economic policy is linked to failure in political economy in this context. Governments often fail to enact new digital technologies in an efficient, appropriate, or fair way due to techno-rational and socio-political failures and solutions at different levels.","da":"Digitale udfordringer: Digital social forskning står over for en krise, når den konfronteres med algoritmer og allestedsnærværende digitale data, hvilket rejser spørgsmål om kvalitativ forsknings rolle i denne sammenhæng. Indførelsen af digitale teknologier antyder et tab af menneskelig autoritet over disse teknologiers fremtidige vej, hvilket potentielt kan føre til ulighed. Algoritmisk beslutningstagning og ansvarlig brug af digitale data er emner for tværfaglige teorier og praksisprocesser, med utilsigtede bivirkninger af den digitale overgang, som skal adresseres. Uligheder på online arbejdsmarkeder og negative effekter af algoritmisk beslutningstagning for sårbare befolkningsgrupper er også væsentlige bekymringer. Udviklingen af digital sociologi som et fagområde fremhæver de afgørende skift, der bringes af et digitalt medieret liv, mens etiske udfordringer forbundet med digital transformation inkluderer eksponering af privatliv, ændringer i kommunikationskultur og koncentration af virksomheds magt. Covid-19's indvirkninger på digitaliserede samfund har accelereret vedtagelsen af digitale løsninger, hvilket skaber muligheder og risici, der kræver politiske reaktioner. Samfundsvidenskaberne bidrager til at måle samfundsmæssige påvirkninger og vurdere etiske spørgsmål i den digitale tidsalder, mens digital rationalitet skaber komplekse sårbarheder for samfund og natur. Digital svigt udfordrer eksisterende systemer og afslører fejl og politisk misbrug af data, og en feministisk konceptuel linse kan adressere uligheder og falske ækvivalenser inden for digital sundhed. Digital social forskning udforsker nye emner, digitale skævheder og metodologiske udfordringer ved indsamling og analyse af digitale data. Forholdet mellem digital transformation, digital overgang og økonomisk politik er afgørende, da svigt i økonomisk politik er knyttet til svigt i politisk økonomi i denne sammenhæng. Regeringer undlader ofte at gennemføre nye digitale teknologier på en effektiv, passende eller retfærdig måde på grund af tekno-rationelle og socio-politiske fejl og løsninger på forskellige niveauer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}