{"id":"c1105","number":2722,"headline":{"en":"Evolutionary Neural Networks","da":"Evolutionære Neurale Netværk"},"content":{"en":"Evolutionary Neural Networks: Combining artificial neural networks (ANNs) and evolutionary algorithms (EAs) can lead to significantly better intelligent systems. Evolutionary approaches can be used to design ANNs by evolving both architectures and connection weights. Evolutionary algorithms can overcome the limitations of traditional neural network methods and improve their efficiency. Genetic operators have a significant influence on the precision and network size in classification problems. Combining evolution and learning techniques can lead to better results and reach global optima in neural network training. Evolution strategies can compete with gradient-based search in certain cases as an alternative to neural network training. Genetic algorithms and conjugate gradient optimization can be combined to optimize neural networks and generate a hybrid neural network architecture. Evolutionary algorithms, especially macro-mutation based Lamarckian approach, show enhanced performance compared to conventional training methods for neural networks. Most combinations of evolutionary algorithms and neural networks perform equally well and are not more accurate than hand-designed neural networks trained with backpropagation. Hybrid Evolutionary Computation/Artificial Neural Networks (EC/ANN) algorithms achieve competitive results compared to heuristic model selection and other Data Mining algorithms for classification and regression. Different evolutionary techniques can generate high-performance networks but may lead to occasional instances of poor performance. Genetic Programming (GP) can be used to automatically develop ANNs with simplified architectures and achieve good results. Evolutionary algorithms for Multi-Layer Perceptron (MLP) learning provide a global approach to connection weight training in ANNs. Neural networks with general neuron models can be evolved using GP, leading to promising results in classification problems. Genetic algorithms can determine the optimal number of hidden layers and good values of weights for neural networks. Evolution Strategies, Particle Swarm Optimization, and Genetic Algorithms can optimize neural network parameters and performance in a multi-objective memetic and hybrid methodology. A hybrid evolutionary artificial neural network (HEANN) can simultaneously evolve network topology and weights, balancing global search and local search to fine-tune network complexity and preserve generalization capability. The concurrent evolution of the whole classifier in neural network generation, using the evolutionary embedded method, performs well in terms of classification accuracy and compactness of solutions.","da":"Evolutionære Neurale Netværk: Kombinationen af kunstige neurale netværk (ANN'er) og evolutionære algoritmer (EA'er) kan føre til betydeligt bedre intelligente systemer. Evolutionære tilgange kan bruges til at designe ANN'er ved at udvikle både arkitekturer og forbindelsesvægte. Evolutionære algoritmer kan overvinde begrænsningerne ved traditionelle neurale netværksmetoder og forbedre deres effektivitet. Genetiske operatører har en betydelig indflydelse på præcision og netværksstørrelse i klassifikationsproblemer. Kombinationen af evolution og læringsteknikker kan føre til bedre resultater og nå globale optima i træning af neurale netværk. Evolutionære strategier kan konkurrere med gradientbaseret søgning i visse tilfælde som et alternativ til træning af neurale netværk. Genetiske algoritmer og konjugerede gradientoptimering kan kombineres for at optimere neurale netværk og skabe en hybrid neural netværksarkitektur. Evolutionære algoritmer, især makromutationsbaseret Lamarcksk tilgang, viser forbedret ydeevne sammenlignet med konventionelle træningsmetoder for neurale netværk. De fleste kombinationer af evolutionære algoritmer og neurale netværk fungerer lige så godt og er ikke mere præcise end hånddesignede neurale netværk trænet med backpropagation. Hybrid Evolutionær Computation/Kunstige Neurale Netværk (EC/ANN) algoritmer opnår konkurrencedygtige resultater sammenlignet med heuristisk modelvalg og andre Data Mining algoritmer til klassifikation og regression. Forskellige evolutionære teknikker kan generere højtydende netværk, men kan lejlighedsvis føre til instances af dårlig ydeevne. Genetisk Programmering (GP) kan bruges til automatisk at udvikle ANN'er med forenklede arkitekturer og opnå gode resultater. Evolutionære algoritmer til Multi-Layer Perceptron (MLP) læring giver en global tilgang til træning af forbindelsesvægte i ANN'er. Neurale netværk med generelle neuronmodeller kan udvikles ved hjælp af GP, hvilket fører til lovende resultater i klassifikationsproblemer. Genetiske algoritmer kan afgøre det optimale antal skjulte lag og gode værdier af vægte for neurale netværk. Evolution Strategier, Particle Swarm Optimization og Genetiske Algoritmer kan optimere neurale netværksparametre og -ydeevne i en multiobjektiv memetisk og hybrid metode. Et hybrid evolutionært kunstigt neuralt netværk (HEANN) kan samtidig udvikle netværkstopologi og vægte, balancere global søgning og lokal søgning for at finjustere netværkets kompleksitet og bevare generaliseringsevnen. Den samtidige evolution af hele klassifikatoren i genereringen af neurale netværk, ved hjælp af den evolutionære indlejrede metode, præsterer godt med hensyn til klassifikationsnøjagtighed og kompaktheden af løsninger."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}