{"id":"c1149","number":3022,"headline":{"en":"Default Reasoning Algorithms","da":"Standardalgoritmer til formodningsbaseret ræsonnering"},"content":{"en":"Default Reasoning Algorithms: Algorithms play a crucial role in various aspects of default reasoning, a type of logical reasoning that deals with assumptions and exceptions. These algorithms extend theories with sets of assumptions, generate preferred models, incorporate contexts, apply stratification to simplify computations, and derive new propositions through reasoning by cases. They also help in operationalizing plausible conjectures, interpreting defaults as restrictions on proofs, finding extensions for default theories, and characterizing reasoning tasks and complexity. Additionally, algorithms are used to define cumulative variants of default logic, develop new algorithms for reasoning tasks, and infer default properties based on preferences. Ultimately, algorithms provide the agency to make default reasoning more efficient and effective in decision-making.","da":"Standardalgoritmer til formodningsbaseret ræsonnering: Algoritmer spiller en afgørende rolle i forskellige aspekter af formodningsbaseret ræsonnering, en type logisk tænkning, der håndterer antagelser og undtagelser. Disse algoritmer udvider teorier med sæt af antagelser, genererer foretrukne modeller, inkorporerer kontekster, anvender stratifikation til at forenkle beregninger og udleder nye propositioner ved at ræsonnere på forskellige måder. De hjælper også med at operationalisere plausible formodninger, fortolke standardantagelser som begrænsninger af beviser, finde udvidelser til formodningsteorier og karakterisere ræsonneringsopgaver og kompleksitet. Derudover bruges algoritmer til at definere kumulative varianter af standardlogik, udvikle nye algoritmer til ræsonneringsopgaver og udlede standardegenskaber baseret på præferencer. I sidste ende giver algoritmer mulighed for at gøre formodningsbaseret ræsonnering mere effektiv og virkningsfuld i beslutningstagning."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}