{"id":"c1162","number":1981,"headline":{"en":"Deep learning in histopathology","da":"Dyblæring i histopatologi"},"content":{"en":"Deep learning in histopathology: Researchers are exploring how deep learning algorithms can be used to analyze digital pathology images, improve the accuracy and efficiency of histopathological diagnosis, detect invasive breast cancer, discriminate between different types of cancer, and prevent overfitting in convolutional neural networks. They are also investigating how pre-analytical variables affect the accuracy of deep learning in histopathology, how Bayesian deep learning can improve histopathological image classification, and how automatic classification algorithms can assist in breast cancer histology analysis. Additionally, they are studying how deep learning can aid in the histopathological diagnosis of gastric cancer, improve histopathological image analysis for prostate cancer, and assess histopathological images for breast cancer grading. Open-source software is being developed to aid in histological image pre-processing and augmentation. Overall, deep learning algorithms are being used to enhance the analysis and classification of histopathological images, leading to more accurate and efficient diagnoses.","da":"Dyblæring i histopatologi: Forskere undersøger, hvordan dyblæringsalgoritmer kan bruges til at analysere digitale patologi-billeder, forbedre nøjagtigheden og effektiviteten af histopatologisk diagnose, opdage invasiv brystkræft, skelne mellem forskellige typer kræft og forhindre overtilpasning i konvolutionsneuronale netværk. De undersøger også, hvordan præ-analytiske variabler påvirker nøjagtigheden af dyblæring i histopatologi, hvordan Bayesian dyblæring kan forbedre klassificeringen af histopatologiske billeder, og hvordan automatiske klassificeringsalgoritmer kan hjælpe med histologianalyse af brystkræft. Derudover studerer de, hvordan dyblæring kan hjælpe med histopatologisk diagnose af mavekræft, forbedre analysen af histopatologiske billeder for prostatakræft og vurdere histopatologiske billeder til gradering af brystkræft. Open source-software udvikles for at hjælpe med forbehandling og augmentering af histologiske billeder. Alt i alt bruges dyblæringsalgoritmer til at forbedre analysen og klassificeringen af histopatologiske billeder, hvilket fører til mere præcise og effektive diagnoser."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}