{"id":"c1289","number":3094,"headline":{"en":"Crowdsourcing optimization","da":"Crowdsourcing-optimering"},"content":{"en":"Crowdsourcing optimization: Researchers have been exploring various ways to improve the efficiency and productivity of crowdsourcing tasks. They have developed algorithms that can identify and select qualified workers, optimize task assignments, improve collective productivity, utilize worker reputation information, allocate specialized tasks, personalize task composition, improve task accuracy and reduce latency, share risks and rewards, ensure quality-aware task assignment, optimize microtask assignment, shift to a post-Taylorism crowdsourcing model, achieve stable task assignment, perform online task scheduling, consider social relationships in task assignment, perform accurate inference of crowdsourcing properties, form crowdsourcing teams, and build decision support systems for crowd workers. These algorithms aim to make crowdsourcing more effective and beneficial for both workers and requesters.","da":"Crowdsourcing-optimering: Forskere har udforsket forskellige måder at forbedre effektiviteten og produktiviteten af crowdsourcing-opgaver på. De har udviklet algoritmer, der kan identificere og udvælge kvalificerede arbejdere, optimere opgavefordelingen, forbedre kollektiv produktivitet, udnytte information om arbejderes omdømme, tildele specialopgaver, personalisere opgavesammensætning, forbedre opgavens nøjagtighed og reducere latency, dele risici og belønninger, sikre kvalitet i opgavefordelingen, optimere mikroopgavefordeling, skifte til en post-Taylorism crowdsourcing-model, opnå stabil opgavefordeling, udføre online opgaveplanlægning, tage hensyn til sociale relationer i opgavefordelingen, udføre præcis inferens af crowdsourcing-egenskaber, danne crowdsourcing-hold og opbygge beslutningsstøttesystemer for crowdarbejdere. Disse algoritmer har til formål at gøre crowdsourcing mere effektivt og gavnligt for både arbejdere og opgavestillere."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}