{"id":"c1335","number":2572,"headline":{"en":"Survival analysis algorithms","da":"Overlevelsesanalyse-algoritmer"},"content":{"en":"Survival analysis algorithms: Scientists have developed various algorithms to address research questions in the field of survival analysis. These algorithms include the binomial maximum likelihood algorithm, methods that impose restrictions on the tail of the baseline distribution, a unifying class of cure rate models, a rank-based semiparametric estimation method, a majorize-minimize algorithm and proportional hazards frailty model, random effects in logistic regression and PH regression components, Bayesian data analysis using a novel Bayes method, a new semiparametric estimation method based on a smooth estimating equation, nonparametric maximum likelihood estimators and EM algorithms, expectation maximization algorithm for exact likelihood inference, estimating approach using score equations from full likelihood, maximum-likelihood estimation based on the EM algorithm, EM algorithm facilitated by gamma-Poisson data augmentation, maximum likelihood estimation using single-index model for mixing probabilities, objective priors including Jeffreys prior, reference priors, and matching probability priors, estimation methods for scenarios with and without measurement error, pseudo-maximum likelihood estimation based on sieve method and EM algorithm, two-step computational procedure involving Expectation-Maximization algorithm, modified score function based on Firth correction, and Firth-type penalized likelihood estimation with Jeffreys invariant prior. These algorithms aim to improve the estimation and analysis of survival data, taking into account factors such as cure rates, covariate effects, heteroscedasticity, measurement error, and sparse data.","da":"Overlevelsesanalyse-algoritmer: Forskere har udviklet forskellige algoritmer til at besvare forskningsspørgsmål inden for overlevelsesanalyse. Disse algoritmer inkluderer den binomiale maksimal sandsynlighedsalgoritme, metoder der pålægger restriktioner på udhalet af basisfordelingen, en samlende klasse af helbredelsesrater-modeller, en rang-baseret semiparametrisk estimeringsmetode, en majorize-minimize algoritme og proportionale farer skrøbelighedsmodel, tilfældige effekter i logistisk regression og PH regressionskomponenter, Bayesiansk dataanalyse ved brug af en ny Bayes-metode, en ny semiparametrisk estimeringsmetode baseret på en glat estimeringsligning, ikke-parametriske maksimal sandsynlighedsestimater og EM-algoritmer, forventningsmaksimeringsalgoritme for nøjagtig sandsynlighedsinferens, estimeringsmetode ved brug af scoreligninger fra fuld sandsynlighed, maksimal-sandsynlighedsestimering baseret på EM-algoritmen, EM-algoritmen underbygget af gamma-Poisson dataforstærkning, maksimal sandsynlighedsestimering ved brug af en-enkelt indeksmodel for blandings sandsynligheder, objektive priors inklusive Jeffreys prior, reference priors og matching probability priors, estimeringsmetoder til scenarier med og uden målefejl, pseudo-maksimal sandsynlighedsestimering baseret på sigtemetoden og EM-algoritmen, to-trins beregningsprocedure involverende Forventnings-Maksimeringsalgoritmen, modificeret scorefunktion baseret på Firth-korrektion og Firth-type straffet sandsynlighedsestimering med Jeffreys invarians prior. Disse algoritmer har til formål at forbedre estimering og analyse af overlevelsesdata, idet de tager hensyn til faktorer som helbredelsesrater, kovariat effekter, heteroskedasticitet, målefejl og sparsomme data."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}