{"id":"c1336","number":237,"headline":{"en":"Autonomous vehicle algorithms","da":"Algoritmer til autonome køretøjer"},"content":{"en":"Autonomous vehicle algorithms: Algorithms play a crucial role in enhancing the capabilities of autonomous robotic vehicles. They contribute to improving safety, performing difficult tasks, and reducing costs. For example, in the DARPA Grand Challenge, algorithms were instrumental in the success of autonomous robots like Stanley and CajunBot, which utilized state-of-the-art AI technologies for obstacle detection, path planning, and computation distribution. These algorithms enable the robots to navigate in unknown environments, achieve high-speed navigation in desert terrains, and efficiently follow designated paths while avoiding obstacles. Additionally, algorithms are used in autonomous vehicles for urban environments, where they incorporate sensing, planning, navigation, and actuation systems. Overall, algorithms are essential for the safe and efficient navigation of autonomous robots in various challenging scenarios.","da":"Algoritmer til autonome køretøjer: Algoritmer spiller en afgørende rolle i at forbedre kapaciteterne hos autonome robotkøretøjer. De bidrager til øget sikkerhed, udfører vanskelige opgaver og reducerer omkostninger. For eksempel var algoritmer afgørende for succesen af autonome robotter som Stanley og CajunBot i DARPA Grand Challenge, som benyttede avancerede AI-teknologier til forhindringsdetektering, ruteplanlægning og beregningsfordeling. Disse algoritmer gør det muligt for robotterne at navigere i ukendte miljøer, opnå højhastighedsnavigation i ørkenterræner og effektivt følge bestemte ruter, mens de undgår forhindringer. Derudover anvendes algoritmer i autonome køretøjer i bymiljøer, hvor de integrerer sensor-, planlægnings-, navigations- og aktueringssystemer. Overordnet set er algoritmer essentielle for sikker og effektiv navigation af autonome robotter i forskellige udfordrende scenarier."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}