{"id":"c1408","number":1423,"headline":{"en":"Hearing aid algorithms","da":"Høreapparat-algoritmer"},"content":{"en":"Hearing aid algorithms: Digital noise reduction algorithms in hearing aids are being studied to determine if they improve speech understanding in noisy environments. Expansion algorithms in hearing aids are also being investigated to see if they can suppress internal noise. Researchers are examining the effects of different configurations of environmental noise reduction algorithms and how different signal enhancement algorithms perform in hearing instruments. Additionally, the impact of various algorithms, such as noise reduction, nonlinear processing, and linear filtering, on perceived speech quality is being explored. The effects of these algorithms on speech perception in children with hearing loss are also being studied. Other research questions include the influence of gain-induced speech distortion algorithms on speech intelligibility, the effects of combining directional microphone and single-channel noise reduction algorithms on cochlear implant performance, and the perceptual effects of single-microphone noise reduction algorithms in hearing aids. Wide dynamic range compression algorithms, signal pre-processing strategies, a novel hearing aid frequency lowering technique, and cue-weighting strategies in high-frequency sensorineural hearing loss are also being investigated. The influence of instantaneous compression algorithms on speech recognition in noise with temporal dips, the effects of different noise reduction strategies on perceived sound quality in cochlear implant listeners, and how speech and noise levels affect the quality perceived by cochlear implant and normal hearing listeners are also being studied. Finally, researchers are examining how combinations of hearing aid signal processing algorithms influence listener preferences.","da":"Høreapparat-algoritmer: Digitale støjreduceringsalgoritmer i høreapparater bliver undersøgt for at afgøre, om de forbedrer taleopfattelsen i støjende miljøer. Ekspansionsalgoritmer i høreapparater bliver også undersøgt for at se, om de kan undertrykke intern støj. Forskere undersøger virkningerne af forskellige konfigurationer af miljøstøjreduceringsalgoritmer og hvordan forskellige signalforbedringsalgoritmer fungerer i høreapparater. Derudover undersøges påvirkningen af forskellige algoritmer, såsom støjreduktion, ikke-lineær behandling og lineær filtrering, på den opfattede talekvalitet. Virkningerne af disse algoritmer på taleopfattelsen hos børn med høretab bliver også studeret. Andre forskningsspørgsmål inkluderer indflydelsen af forstærkningsinduceret taleforvrængningsalgoritmer på taleintelligibilitet, virkningerne af at kombinere retningsbestemte mikrofon- og enkeltkanals-støjreduceringsalgoritmer på ydeevnen af cochlear-implantater, og de perceptuelle effekter af enkeltmikrofon-støjreduceringsalgoritmer i høreapparater. Bredt dynamikområde kompressionsalgoritmer, signalforbehandlingsstrategier, en ny høreapparat-frekvenssænkningsteknik og cue-vægtning strategier ved højfrekvent sensorineuralt høretab bliver også undersøgt. Indflydelsen af øjeblikkelig kompressionsalgoritmer på taleforståelse i støj med tidsmæssige dyk, virkningerne af forskellige støjreduceringsstrategier på opfattet lydkvalitet hos cochlear-implantatbrugere, og hvordan tale- og støjniveauer påvirker den opfattede kvalitet hos cochlear-implantat og normalthørende lyttere bliver også studeret. Endelig undersøger forskere, hvordan kombinationer af høreapparatsignalbehandlingsalgoritmer påvirker lytterpræferencer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}