{"id":"c1496","number":3947,"headline":{"en":"Nonlinear Stability Analysis","da":"Ikke-lineær stabilitetsanalyse"},"content":{"en":"Nonlinear Stability Analysis: Researchers are using algorithms to address various questions in the field of stability analysis of nonlinear systems. These algorithms are being used to derive new criteria for absolute stability, verify the robust stability of polynomials with parameter dependency, analyze the robust stability of polynomials with coefficient perturbations, determine the robust stability of linear systems with uncertain parameters, and compute lower bounds on the robust stability margin for uncertain systems. Additionally, algorithms are being used to obtain upper bounds on coefficient perturbation for stability properties of perturbed polynomials, analyze the stability of general nonlinear systems, derive necessary and sufficient conditions for the stability of linear parameter-dependent systems, provide absolute stability criteria for finite-dimensional and delay systems, propose sufficient conditions for checking the robust stability of polynomial matrices, utilize positive polynomials for robust stabilization with fixed-order controllers, solve the problem of absolute stability for third-order systems numerically, check the global asymptotic stability of nonlinear polynomial systems with parameters, provide LMI stability conditions for uncertain rational nonlinear systems, unify the deterministic and probabilistic D-stability analysis of uncertain polynomial matrices, and perform robust estimations of the Region of Attraction using invariant sets.","da":"Ikke-lineær stabilitetsanalyse: Forskere anvender algoritmer til at adressere forskellige spørgsmål inden for området for stabilitetsanalyse af ikke-lineære systemer. Disse algoritmer bruges til at udlede nye kriterier for absolut stabilitet, verificere den robuste stabilitet af polynomier med parameteraffhængighed, analysere den robuste stabilitet af polynomier med koefficientforstyrrelser, bestemme den robuste stabilitet af lineære systemer med usikre parametre og beregne nedre grænser for den robuste stabilitetsmargen for usikre systemer. Derudover anvendes algoritmer til at opnå øvre grænser for koefficientforstyrrelser for stabilitetsegenskaber af forstyrrede polynomier, analysere stabiliteten af generelle ikke-lineære systemer, udlede nødvendige og tilstrækkelige betingelser for stabiliteten af lineære parameteraffhængige systemer, give kriterier for absolut stabilitet for endimensionale og forsinkelsessystemer, foreslå tilstrækkelige betingelser for at kontrollere den robuste stabilitet af polynomialmatricer, anvende positive polynomier til robust stabilisering med fast ordens regulatorer, løse problemet med absolut stabilitet for tredjeringens systemer numerisk, kontrollere den globale asymptotiske stabilitet af ikke-lineære polynomialsystemer med parametre, give LMI-stabilitetsbetingelser for usikre rationelle ikke-lineære systemer, forene den deterministiske og probabilistiske D-stabilitetsanalyse af usikre polynomialmatricer og udføre robuste estimater af tiltrædelsesområdet ved hjælp af invariante sæt."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}