{"id":"c1632","number":1321,"headline":{"en":"3D Video Algorithms","da":"3D Video Algoritmer"},"content":{"en":"3D Video Algorithms: Researchers are exploring how algorithms can be used to achieve real-time 3D shape reconstruction and high fidelity visualization for 3D video. They are also investigating the use of algorithms to synthesize nonphotorealistic animations from real video sequences, develop automated tools for texturing raw video, and achieve interactive editing of 3D video footage. Additionally, algorithms are being used to manipulate the body shape and proportions of human actors in video footage, convert conventional videos into stereoscopic videos, and create painterly animation and stylized animated line drawings from video sequences. These algorithms are enabling researchers to control motion blur in synthetic long time exposures, create seamless animated loops from a single image, augment human motion in videos using an art-directed framework, insert hand-drawn animations into videos with scene-aware canvases, and impart subtle motion to objects in still images to create looping videos.","da":"3D Video Algoritmer: Forskere undersøger, hvordan algoritmer kan anvendes til at opnå realtids 3D-form rekonstruktion og høj troværdighedsvisualisering til 3D-video. De undersøger også brugen af algoritmer til at syntetisere ikke-fotorealistiske animationer fra ægte videosekvenser, udvikle automatiserede værktøjer til teksturering af rå video og opnå interaktiv redigering af 3D-videomateriale. Desuden bruges algoritmer til at manipulere kroppens form og proportioner af menneskelige skuespillere i videomateriale, konvertere konventionelle videoer til stereoskopiske videoer og skabe maleriske animationer og stiliserede animerede stregtegninger fra videosekvenser. Disse algoritmer gør det muligt for forskere at kontrollere bevægelsesslør i syntetiske lange eksponeringer, skabe sømløse animerede loops fra et enkelt billede, forøge menneskelig bevægelse i videoer med en kunstrettet ramme, indsætte håndtegnede animationer i videoer med scene-bevidste lærreder og tilføre subtile bevægelser til objekter i stillbilleder for at skabe loopende videoer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}