{"id":"c1700","number":762,"headline":{"en":"Infrastructure Evaluation","da":"Infrastruktur Evaluering"},"content":{"en":"Infrastructure Evaluation: Researchers have been exploring the use of ground-penetrating radar (GPR) and algorithms to address various challenges in infrastructure evaluation. They have developed novel algorithms and systems to detect delamination in concrete pavements and bridge decks, track and map cracks in bridges, detect rebar in highway pavements and bridge decks, monitor asphalt pavement compaction, evaluate robotic bridge decks, identify pavement layer properties, monitor real-time compaction of asphalt overlays, detect pipes and leaks in water distribution networks, evaluate concrete bridge decks, detect cracks in roads, reduce background and clutter in pipe detection, determine the characteristics of wood and concrete structures, identify underground pipelines, and detect reinforcement corrosion in concrete structures. These advancements in GPR technology and algorithms have the potential to improve the efficiency and accuracy of infrastructure evaluation and maintenance.","da":"Infrastruktur Evaluering: Forskere har udforsket brugen af jordradar (GPR) og algoritmer til at løse forskellige udfordringer inden for infrastrukturevaluering. De har udviklet nye algoritmer og systemer til at detektere delaminering i betonbelægninger og brodæk, spore og kortlægge revner i broer, detektere armeringsstænger i motorvejsbelægninger og brodæk, overvåge asfaltbelægningskomprimering, evaluere robotiske brodæk, identificere egenskaber ved belægningslag, overvåge realtidskomprimering af asfaltbelægninger, detektere rør og lækager i vanddistributionsnetværk, evaluere betonbrodæk, detektere revner i veje, reducere baggrundsstøj og forstyrrelser i rørdetektering, bestemme karakteristika af træ- og betonstrukturer, identificere underjordiske rørledninger og detektere korrosion af armering i betonkonstruktioner. Disse fremskridt inden for GPR-teknologi og algoritmer har potentiale til at forbedre effektiviteten og nøjagtigheden af infrastrukturevaluering og vedligeholdelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}