{"id":"c1765","number":1564,"headline":{"en":"Face sketch synthesis","da":"Ansigtsskitse-syntese"},"content":{"en":"Face sketch synthesis: Researchers have explored various algorithms to improve the synthesis of face sketches. These algorithms include E-HMM and SE, similarity between image patches and prior knowledge, multiple representations and Markov networks, 2DDCM-based face-specific Markov network, ridge regressors, representation learning framework, deep learning-based architecture, cascaded image synthesis and sparse representation-based greedy search, active appearance model (AAM), deep neural representation, graph-regularized joint dictionary and residual learning, local and nonlocal similarity regularization, traditional and deep learning-based models, feature learning generative adversarial network (FL-GAN), perception-adaptive network (PANet), and regularized broad learning system (RBLS). These algorithms aim to generate high-quality and personalized face sketches for various applications, including law enforcement.","da":"Ansigtsskitse-syntese: Forskere har undersøgt forskellige algoritmer for at forbedre syntesen af ansigtsskitser. Disse algoritmer inkluderer E-HMM og SE, lighed mellem billedlapper og forudgående viden, multiple repræsentationer og Markov-netværk, 2DDCM-baseret ansigtsspecifikt Markov-netværk, ridge-regressorer, repræsentationslæringsramme, dyb læringsbaseret arkitektur, kaskaderet billedsyntese og spars repræsentations-baseret grådig søgning, aktivt udseendemodel (AAM), dybt neurale repræsentation, graf-reguleret fælles ordbog og residual læring, lokal og ikke-lokal lighedsregulering, traditionelle og dyb læringsbaserede modeller, funktion læring generativt adversarial netværk (FL-GAN), perceptions-tilpasset netværk (PANet), og reguleret bred læringssystem (RBLS). Disse algoritmer sigter mod at generere høj-kvalitets og personlige ansigtsskitser til forskellige anvendelser, herunder retshåndhævelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}