{"id":"c1809","number":1973,"headline":{"en":"AI-assisted medical imaging","da":"AI-assisteret medicinsk billedbehandling"},"content":{"en":"AI-assisted medical imaging: Computer algorithms that assist in the detection of abnormalities in medical imaging, such as CT colonography, have been found to play a complementary role to human interpretation. They can act as a \"first reader\" or a second reader, improving the detection of polyps and increasing sensitivity. These algorithms have shown high accuracy in detecting clinically significant polyps and can substantially decrease reading times for radiologists, while enabling accurate detection of adenomas. However, the quality of reporting for studies using these algorithms varies greatly, and their performance can be influenced by factors such as the patient population and the specific CAD system used. Overall, computer-aided detection algorithms have the potential to improve the sensitivity and performance of CT colonography in detecting colorectal lesions.","da":"AI-assisteret medicinsk billedbehandling: Computeralgoritmer, der assisterer ved påvisning af abnormiteter i medicinsk billedbehandling, såsom CT-kolonografi, har vist sig at spille en komplementær rolle til menneskelig fortolkning. De kan fungere som en \"første læser\" eller en anden læser, hvilket forbedrer påvisningen af polypper og øger sensitiviteten. Disse algoritmer har vist høj nøjagtighed i påvisning af klinisk betydningsfulde polypper og kan i væsentlig grad mindske radiologers læsetid, samtidig med at de muliggør præcis påvisning af adenomer. Dog varierer kvaliteten af rapporteringen for studier, der anvender disse algoritmer, betydeligt, og deres ydeevne kan påvirkes af faktorer som patientpopulationen og det specifikke CAD-system, der anvendes. Overordnet set har computer-assisterede detektionsalgoritmer potentiale til at forbedre sensitiviteten og ydeevnen af CT-kolonografi i påvisning af kolorektale læsioner."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}