{"id":"c1822","number":3048,"headline":{"en":"Algorithmic Evolution","da":"Algoritmisk Evolution"},"content":{"en":"Algorithmic Evolution: Researchers have explored various questions related to the use of algorithms in grammatical evolution. They have investigated the impact of bidirectional representation, coevolution of grammar and genetic code, adoption of a more flexible mapping process, and the use of Christiansen grammar evolution. Additionally, they have compared genetic programming with genetic algorithms and evolutionary strategies, examined the contributions of grammar formalisms to genetic programming, and explored alternative algorithms for solving grammatical optimization problems. Other studies have focused on the use of neutral mutation operators, automatic string expression generation, hybrid algorithms, and structured grammatical evolution. The researchers have also discussed the implementation of grammatical evolution in R, compared different initialization routines, and addressed criticisms of the approach. Finally, they have examined the relationship between genotype to phenotype mapping in evolutionary algorithms and the salient features of natural systems, as well as the assumptions and philosophical foundations for effective evolutionary search.","da":"Algoritmisk Evolution: Forskere har udforsket forskellige spørgsmål relateret til brugen af algoritmer i grammatisk evolution. De har undersøgt virkningen af bidirektionel repræsentation, samevolution af grammatik og genetisk kode, adoption af en mere fleksibel mappingsproces og brugen af Christiansens grammatiske evolution. Derudover har de sammenlignet genetisk programmering med genetiske algoritmer og evolutionære strategier, undersøgt bidragene fra grammatiske formaliseringsformer til genetisk programmering og udforsket alternative algoritmer til løsning af grammatiske optimeringsproblemer. Andre studier har fokuseret på brugen af neutrale mutationsoperatører, automatisk strenggenerering, hybride algoritmer og struktureret grammatisk evolution. Forskerne har også diskuteret implementeringen af grammatisk evolution i R, sammenlignet forskellige initialiseringsrutiner og adresseret kritik af tilgangen. Endelig har de undersøgt forholdet mellem genotype og fænotype mapping i evolutionære algoritmer og de væsentlige træk ved naturlige systemer, samt antagelserne og de filosofiske grundlag for effektiv evolutionær søgning."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}