{"id":"c1850","number":1090,"headline":{"en":"Enhanced ship detection","da":"Forbedret skibsdetektion"},"content":{"en":"Enhanced ship detection: Deep learning algorithms have been used to enhance the feature extraction ability for ship detection from SAR images, resulting in improved detection performance. Additionally, algorithms with squeeze and excitation mechanisms have shown better detection performance than traditional methods. Other techniques such as anchor-free convolutional networks, two-way convolution, multiscale feature mapping, multi-feature fusion, non-local channel attention mechanisms, and improved FCOS methods have also been employed to improve ship detection accuracy, speed, and performance in complex backgrounds. Lightweight algorithms, such as Faster R-CNN, YOLO, pyramid vision transformers, and convolutional and transformer fusion networks, have been developed to achieve efficient and accurate ship detection in SAR images. These advancements in algorithmic approaches have significantly improved the efficiency and accuracy of ship detection in SAR images.","da":"Forbedret skibsdetektion: Dybe læringsalgoritmer er blevet anvendt til at forbedre evnen til at udtrække træk ved skibsdetektion fra SAR-billeder, hvilket resulterer i forbedret detektionsydelse. Desuden har algoritmer med squeeze- og exciteringsmekanismer vist bedre detektionsydelse end traditionelle metoder. Andre teknikker såsom ankerfri konvolutionsnetværk, to-vejs konvolution, multiskala funktionskortlægning, multifunktionsfusion, ikke-lokal kanalopmærksomhedsmekanismer og forbedrede FCOS-metoder er også blevet anvendt for at forbedre skibsdetektionens nøjagtighed, hastighed og ydeevne i komplekse baggrunde. Letvægtsalgoritmer, såsom Faster R-CNN, YOLO, pyramidvisiontransformere og konvolutions- og transformerfusionsnetværk, er blevet udviklet for at opnå effektiv og præcis skibsdetektion i SAR-billeder. Disse fremskridt inden for algoritmiske tilgange har betydeligt forbedret effektiviteten og nøjagtigheden af skibsdetektion i SAR-billeder."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}