{"id":"c1939","number":3824,"headline":{"en":"Vehicle Positioning Algorithms","da":"Køretøjspositioneringsalgoritmer"},"content":{"en":"Vehicle Positioning Algorithms: Researchers are investigating various algorithms to improve the accuracy of vehicle positioning in road safety applications and urban environments. These algorithms include DSRC infrastructure, Advanced Shared Pseudorange (ASP) method, weighted least squares double difference (WLS-DD) technique, new tight integration CP method, cooperative positioning algorithm, cooperative map matching and dynamic base station DGPS concept, blending GNSS and V2V communication, DSRC Doppler/IMU/GNSS tightly-coupled CP method, implicit cooperative positioning algorithm, Cooperative Neighboring Vehicle Positioning System (CNVPS), CoVaLID method, V2X enhanced low-cost GNSS cooperative positioning, hybrid cooperative positioning algorithm, cooperative localization method based on V2I communication and distance information, and fusion of GNSS and relative range information. These algorithms aim to enhance the accuracy and reliability of vehicle positioning in different scenarios, such as low GPS coverage environments and VANETs.","da":"Køretøjspositioneringsalgoritmer: Forskere undersøger forskellige algoritmer for at forbedre nøjagtigheden af køretøjspositionering i trafiksikkerhedsapplikationer og bymiljøer. Disse algoritmer inkluderer DSRC-infrastruktur, Advanced Shared Pseudorange (ASP) metode, vægtet mindst kvadraters dobbeltforskel (WLS-DD) teknik, ny tæt integration CP metode, samarbejdende positioneringsalgoritme, samarbejdende kortmatching og dynamisk basestation DGPS-koncepter, blanding af GNSS og V2V kommunikation, DSRC Doppler/IMU/GNSS tæt integreret CP metode, implicit samarbejdende positioneringsalgoritme, Cooperative Neighboring Vehicle Positioning System (CNVPS), CoVaLID metode, V2X forbedret lavpris GNSS samarbejdende positionering, hybrid samarbejdende positioneringsalgoritme, samarbejdende lokaliseringsmetode baseret på V2I kommunikation og afstandsinformation, og fusion af GNSS og relative rækkeviddeinformation. Disse algoritmer sigter mod at forbedre nøjagtigheden og pålideligheden af køretøjspositionering i forskellige scenarier, såsom miljøer med lav GPS-dækning og VANETs."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}