{"id":"c1975","number":1648,"headline":{"en":"Joint biomechanics","da":"Fælles biomekanik"},"content":{"en":"Joint biomechanics: Scientists are using algorithms to enhance the computational efficiency of 3D models of joints, address technical aspects of ligament modeling, determine internal loads along the tibia during walking, analyze the effects of knee-joint movements on ligament tension and deformation, drive core analysis modules for joint modeling, study the mechanics of the knee joint with new ligament/bone insertion site constraint models, develop a more realistic model of the knee to study injuries and therapies, and develop and validate detailed 3D anatomical models of joints. Algorithms are also being compared for modeling contact problems in cartilage, used to develop subject-specific knee kinematic models, analyze contact geometry and deformation in biomechanics applications, simulate alterations in cartilage density, evaluate surgical treatments for osteoarthritis, quantify dynamic contact mechanics on the tibial plateau, evaluate total knee replacement stability, predict patellofemoral joint kinematics and contact, and develop a forward solution mathematical model of the knee joint for implant evaluation.","da":"Fælles biomekanik: Forskere bruger algoritmer til at forbedre den beregningsmæssige effektivitet af 3D-modeller af led, adressere tekniske aspekter af ligamentmodeller, bestemme interne belastninger langs tibia under gang, analysere virkningerne af knæledsbevægelser på ligamentspænding og deformation, drivkerneanalysemoduler til ledmodellering, undersøge mekanikken i knæleddet med nye ligament/benindsættelsestedsbegrænsningsmodeller, udvikle en mere realistisk model af knæet for at studere skader og terapier, samt udvikle og validere detaljerede 3D-anatomiske modeller af led. Algoritmer sammenlignes også for modellering af kontaktproblemer i brusk, bruges til at udvikle emnespecifikke knækinematiske modeller, analysere kontaktgeometri og deformation i biomekaniske anvendelser, simulere ændringer i bruskdensitet, evaluere kirurgiske behandlinger for slidgigt, kvantificere dynamisk kontaktmekanik på tibia plateau, evaluere stabiliteten af total knæerstatning, forudsige patellofemorale leddkinematik og kontakt samt udvikle en fremadrettet løsning matematisk model af knæleddet til evaluerings af implantater."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}