{"id":"c2","number":2823,"headline":{"en":"Community detection","da":"Fællesskabsdetektion"},"content":{"en":"Community detection: Researchers have been exploring ways to improve the label propagation algorithm for detecting community structure in networks. They have proposed various algorithms such as Weighted coherent neighborhood propinquity, entropic-CNP, Consensus weight and mixing value, Node influence based label propagation algorithm (NIBLPA), Centrality-based label propagation algorithm (CenLP), Dominant label propagation algorithm (DLPA), Constrained label propagation algorithm, Semi-synchronous label propagation algorithm with constraints, New update rules for label propagation, Stepping community detection algorithm, Efficient community detection algorithm (WILPAS), Improved label propagation algorithm based on node intimacy (LPA-INTIM), Link influence-based label propagation algorithm (LP-LPA), Weighted label propagation based on Local Edge Betweenness, Graph-based label propagation algorithm (GLPA), Constrained label propagation algorithm with nodes exemption (SSCLPA), and Random walk and label propagation algorithm. These algorithms aim to enhance the stability, accuracy, and efficiency of the label propagation algorithm for community detection in networks.","da":"Fællesskabsdetektion: Forskere har undersøgt måder at forbedre labelpropagationsalgoritmen til at detektere fællesskabsstruktur i netværk. De har foreslået forskellige algoritmer såsom Vægtet sammenhængende naboskabsnærhed, entropisk-CNP, Konsensusvægt og blandeværdi, Nodeindflydelsesbaseret labelpropagationsalgoritme (NIBLPA), Centralitetsbaseret labelpropagationsalgoritme (CenLP), Dominerende labelpropagationsalgoritme (DLPA), Begrænset labelpropagationsalgoritme, Semisynkron labelpropagationsalgoritme med begrænsninger, Nye opdateringsregler for labelpropagation, Trinvis fællesskabsdetektionsalgoritme, Effektiv fællesskabsdetektionsalgoritme (WILPAS), Forbedret labelpropagationsalgoritme baseret på nodeintimitet (LPA-INTIM), Linkindflydelsesbaseret labelpropagationsalgoritme (LP-LPA), Vægtet labelpropagation baseret på lokal kantmellemhed, Grafbaseret labelpropagationsalgoritme (GLPA), Begrænset labelpropagationsalgoritme med nodefritagelse (SSCLPA) og Tilfældig gang og labelpropagationsalgoritme. Disse algoritmer sigter mod at forbedre stabiliteten, nøjagtigheden og effektiviteten af labelpropagationsalgoritmen for fællesskabsdetektion i netværk."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}