{"id":"c2004","number":1058,"headline":{"en":"Imaging Algorithm Advancements","da":"Fremskridt i billeddannelsesalgoritmer"},"content":{"en":"Imaging Algorithm Advancements: Researchers are exploring how algorithms can improve the imaging capability of electron beam x-ray tomography for two-phase pipe flows, the measurement of multiphase flow dynamics using X-ray computed tomography, and the visualization of bubbles moving through a fluidized bed. They are also investigating how algorithms can address limited-angle artifacts and the lack of volumetric structure information in electron beam x-ray CT, accurately measure the phase concentration in axisymmetric two-phase flows, and accurately measure two-phase pipe flow using a low-energy γ-ray computed tomography system with sparse projections. Additionally, algorithms are being developed to improve the extraction of quantitative data from ultrafast X-ray tomographed gas-liquid flows, incorporate a priori information about the porous medium into X-ray tomography reconstruction algorithms for fluid flows in porous media, and improve time-resolved X-ray tomography in bubbling fluidized beds. These algorithms aim to enhance the accuracy, speed, and efficiency of scientific imaging techniques.","da":"Fremskridt i billeddannelsesalgoritmer: Forskere udforsker, hvordan algoritmer kan forbedre billeddannelsesevnen af elektronstråle-røntgentomografi for tofaset rørstrømning, målingen af flerfaset strømningdynamik ved brug af røntgen-computertomografi og visualisering af bobler, der bevæger sig gennem en fluidiseret seng. De undersøger også, hvordan algoritmer kan håndtere begrænsede vinkelartefakter og manglen på volumetrisk strukturoplysninger i elektronstråle-røntgen-CT, nøjagtigt måle fasekoncentrationen i akse-symmetriske tofaset strømninger og nøjagtigt måle tofaset rørstrømning ved hjælp af et lavenergi gamma-ray computertomografisystem med sparsomme projektioner. Desuden bliver algoritmer udviklet til at forbedre udtrækningen af kvantitative data fra ultrahurtigt røntgen-tomograferede gas-væske strømninger, inkorporere a priori information om det porøse medie i røntgen-tomografirekonstruktionsalgoritmer for fluidstrømninger i porøse medier, og forbedre tidsopløst røntgentomografi i boblende fluidiserede senge. Disse algoritmer sigter mod at forbedre nøjagtigheden, hastigheden og effektiviteten af videnskabelige billedteknikker."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}