{"id":"c2107","number":1773,"headline":{"en":"Algorithmic Advancements","da":"Algoritmiske fremskridt"},"content":{"en":"Algorithmic Advancements: Scientists are using algorithms to tackle a wide range of questions in chemistry and molecular biology. These algorithms can determine topological equivalence in molecular graphs, represent molecular geometry and topology, construct novel structural descriptors, achieve topological equivalence and ordering in molecular graphs, provide direction in the passage from molecular indices to molecular connectivity terms, select reaction products with desired properties, perform similarity searching in large combinatorial chemistry spaces, compute topological indices for virtual screening of combinatorial libraries, canonize molecules using extended valence sequences, cluster molecules using maximum common edge substructure algorithm, find the lowest energy conformation of molecules, determine large molecules through the reassembly of optimized fragments, assign bond orders and formal charges automatically, construct and modify molecular graphs, generate conformers for inorganic and organic molecules, construct a complete set of homodesmic reactions, and develop an automated method for graph-based chemical space exploration and transition state finding. These algorithms are revolutionizing the field of chemistry and helping scientists make important discoveries.","da":"Algoritmiske fremskridt: Forskere bruger algoritmer til at tackle en bred vifte af spørgsmål inden for kemi og molekylær biologi. Disse algoritmer kan bestemme topologisk ækvivalens i molekylære grafer, repræsentere molekylær geometri og topologi, konstruere nye strukturelle deskriptorer, opnå topologisk ækvivalens og rækkefølge i molekylære grafer, give retning i overgangen fra molekylære indekser til molekylær konnektivitet, vælge reaktionsprodukter med ønskede egenskaber, udføre lignende søgninger i store kombinatoriske kemirum, beregne topologiske indekser til virtuel screening af kombinatoriske biblioteker, kanonisere molekyler ved hjælp af udvidede valenssekvenser, klustre molekyler ved hjælp af maksimum fælles kant understruktur algoritme, finde den laveste energikonformation af molekyler, bestemme store molekyler gennem genmontage af optimerede fragmenter, tildele bindinger og formelle ladninger automatisk, konstruere og modificere molekylære grafer, generere konformere for uorganiske og organiske molekyler, konstruere et komplet sæt af homodesmiske reaktioner og udvikle en automatiseret metode til grafbaseret kemisk rumeforskning og overgangstilstandsbestemmelse. Disse algoritmer revolutionerer kemiens felt og hjælper forskere med at gøre vigtige opdagelser."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}