{"id":"c2106","number":514,"headline":{"en":"Shaking table optimization","da":"Optimering af rystebord"},"content":{"en":"Shaking table optimization: Researchers have developed various algorithms to improve the performance of electro-hydraulic shaking tables. These algorithms aim to reduce harmonic distortion, improve control accuracy, eliminate phase delay and amplitude attenuation, cancel acceleration harmonics, estimate harmonics in real-time, and achieve resonant suppression. The algorithms used include LMS adaptive algorithm, adaptive inverse control, inverse frequency response function equalization technique, Kalman filter, normalized least-mean-square adaptive algorithm, unscented Kalman filter, extended Kalman filter, particle swarm optimization algorithm, nonlinear adaptive algorithm, water cycle algorithm, multifrequency adaptive notch filter, and multi-innovation stochastic gradient algorithm. These algorithms play a crucial role in enhancing the capabilities of shaking tables for various applications in engineering and research.","da":"Optimering af rystebord: Forskere har udviklet forskellige algoritmer for at forbedre ydeevnen af elektro-hydrauliske rysteborde. Disse algoritmer sigter mod at reducere harmonisk forvrængning, forbedre kontrolnøjagtighed, eliminere faseforsinkelse og amplitudeudtynding, annullere accelerationsharmoniske, estimere harmoniske i realtid og opnå resonansundertrykkelse. De anvendte algoritmer inkluderer LMS adaptiv algoritme, adaptiv invers kontrol, invers frekvensresponsfunktion ligestillingsteknik, Kalman-filter, normaliseret mindst-kvadraters adaptiv algoritme, uscentet Kalman-filter, udvidet Kalman-filter, partikel sværmoptimeringsalgoritme, ikke-lineær adaptiv algoritme, vandcyklusalgoritme, multifrequency adaptiv notch-filter og multi-innovations stokastisk gradientalgoritme. Disse algoritmer spiller en afgørende rolle i at forbedre kapabiliteterne af rysteborde til forskellige anvendelser inden for ingeniørarbejde og forskning."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}