{"id":"c2124","number":2925,"headline":{"en":"News algorithms","da":"Nyhedsalgoritmer"},"content":{"en":"News algorithms: Search engines shape news consumption and news repertoire balance by leading to more diverse and balanced news consumption. Algorithms and platforms play a role in contemporary news selection processes, extending gatekeeping theory. The 2016 Trending Topics controversy impacted Facebook's role in the news ecosystem, emphasizing personalized news and minimizing editorial control. News recommendation engines contribute to filter bubbles and fragmented news audiences by showing a high degree of homogeneity and concentration. People exhibit a general skepticism towards all forms of news selection, including algorithms, when navigating news on social media. Algorithms and automation have diverse applications in journalism but also present challenges. Social media algorithms influence user behavior and can lead to changes in diversity and slant of news sources, shaping diversification and partisan shifts in news consumption. Journalists negotiate the influence of social media algorithms against traditional journalistic values, influencing editorial decision making in news organizations. Algorithmically generated news sources have different effects on political behavior and polarization compared to non-algorithmic sources. Strategic amplification can be used to counter misinformation and polarizing rhetoric in the media ecosystem, requiring responsible and accountable news content and algorithmic systems. Algorithmic curation mechanisms on online platforms can both expand and contract exposure diversity depending on long-term reliance. Google News shows little evidence of news personalization and exhibits high homogeneity in search results, suggesting limited search personalization and news diversity. Journalists have adapted their strategies for sharing news content on social media platforms, incorporating social media logics and algorithms. Users' own choices, rather than algorithmic curation, drive exposure to partisan or unreliable news on Google Search. Preference for journalist gatekeeping fosters trust in traditional and social media news, rather than algorithmic news selection. Algorithmic recommendation systems homogenize exposure to information across platforms, affecting exposure to diverse information. News recommender systems impact journalistic distribution and news consumption.","da":"Nyhedsalgoritmer: Søgemaskiner former nyhedsforbrug og nyhedsrepertoirebalance ved at føre til mere mangfoldigt og afbalanceret nyhedsforbrug. Algoritmer og platforme spiller en rolle i nutidens nyhedsudvælgelsesprocesser og udvider portvagtsteorien. Kontroversen om Trending Topics i 2016 påvirkede Facebooks rolle i nyhedsøkosystemet ved at understrege personlige nyheder og minimere redaktionel kontrol. Nyhedsanbefalingsmotorer bidrager til filterbobler og fragmenterede nyhedspublikum ved at vise en høj grad af homogenitet og koncentration. Folk udviser generel skepsis over for alle former for nyhedsudvælgelse, inklusive algoritmer, når de navigerer nyheder på sociale medier. Algoritmer og automatisering har forskellige anvendelser i journalistik, men præsenterer også udfordringer. Sociale mediers algoritmer påvirker brugeradfærd og kan føre til ændringer i mangfoldighed og skævhed af nyhedskilder, hvilket former diversificering og partiske skift i nyhedsforbrug. Journalister forhandler indflydelsen fra sociale mediers algoritmer mod traditionelle journalistiske værdier, hvilket påvirker redaktionelle beslutninger i nyhedsorganisationer. Algoritmisk genererede nyhedskilder har forskellige effekter på politisk adfærd og polarisering sammenlignet med ikke-algoritmiske kilder. Strategisk forstærkning kan bruges til at modvirke misinformation og polariserende retorik i medieøkosystemet, hvilket kræver ansvarligt og ansvarsgørende nyhedsindhold og algoritmiske systemer. Algoritmisk kuratering på online platforme kan både udvide og begrænse eksponeringsmangfoldigheden afhængig af langsigtet afhængighed. Google News viser lidt bevis for nyhedspersonalisering og udviser høj homogenitet i søgeresultater, hvilket tyder på begrænset søgepersonalisering og nyhedsmangfoldighed. Journalister har tilpasset deres strategier for at dele nyhedsindhold på sociale medieplatforme ved at inkorporere logikkerne fra sociale medier og algoritmer. Brugernes egne valg, snarere end algoritmisk kuratering, driver eksponeringen for partiske eller upålidelige nyheder på Google Search. Præference for journalisters portvagt fremmer tillid til traditionelle og sociale medienyheder, snarere end algoritmisk nyhedsudvælgelse. Algoritmiske anbefalingssystemer homogeniserer eksponeringen for information på tværs af platforme, hvilket påvirker eksponeringen for mangfoldig information. Nyhedsanbefalersystemer påvirker journalistisk distribution og nyhedsforbrug."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}