{"id":"c2122","number":2039,"headline":{"en":"Digital Pathology","da":"Digital patologi"},"content":{"en":"Digital Pathology: Computer-assisted diagnosis (CAD) algorithms are being used to complement the expertise of pathologists in detecting, diagnosing, and predicting the prognosis of diseases in digitized histopathology. These algorithms aid in the detection and classification of carcinoma in histopathology, assisting histopathologists and clinicians in cancer diagnosis and research. Additionally, algorithms are used to analyze cellular heterogeneity in breast tumors, differentiate normal from neoplastic features, and perform nuclei detection, segmentation, and classification in digital histopathology. Digital image analysis in pathology provides increased capacity and precision, but pathologists have the responsibility to validate and ensure accuracy. Overall, these algorithms and software tools contribute to the advancement of digital pathology, enabling automated analysis, precise prognostic information, and guiding treatment decisions.","da":"Digital patologi: Computerassisterede diagnose (CAD) algoritmer bruges til at supplere patologers ekspertise i at opdage, diagnosticere og forudsige prognosen af sygdomme i digitaliseret histopatologi. Disse algoritmer hjælper med at opdage og klassificere karcinom i histopatologi og bistår histopatologer og klinikere i kræftdiagnostik og forskning. Desuden anvendes algoritmer til at analysere cellulær heterogenitet i brysttumorer, differentiere normale fra neoplastiske træk samt udføre kerne-detektion, segmentering og klassificering i digital histopatologi. Digital billedanalyse i patologi giver øget kapacitet og præcision, men patologer har ansvaret for at validere og sikre nøjagtighed. Samlet set bidrager disse algoritmer og softwareværktøjer til fremskridtet inden for digital patologi, muliggør automatiseret analyse, præcis prognostisk information og vejleder behandlingsbeslutninger."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}