{"id":"c2129","number":2903,"headline":{"en":"Automated essay scoring","da":"Automatiseret essayscoring"},"content":{"en":"Automated essay scoring: Researchers have been investigating how algorithms can be used to automatically score student essays, predict essay quality ratings, construct readability models, improve automated essay scoring, analyze Chinese-language texts, predict text readability judgments, rank Russian academic texts, quantify textual comprehension difficulty, assess text difficulty, measure text complexity for Russian learners of English, predict children's reading comprehension, score junior and senior high essays, compare text complexity in English and Russian, construct a text complexity grading model for English textbooks, analyze syntactic complexity in reading materials, predict text complexity in Chinese elementary school textbooks, and predict learner performance in a multi-text writing task. These studies employ various algorithms such as pattern-matching, latent semantic analysis, machine learning, support vector machines, and natural language processing to achieve their goals.","da":"Automatiseret essayscoring: Forskere har undersøgt, hvordan algoritmer kan bruges til automatisk at vurdere elevessays, forudsige kvaliteten af essays, konstruere læsbarhedsmodeller, forbedre automatiseret essayscoring, analysere kinesisk-sprogede tekster, forudsige læsbarhedsbedømmelser, rangere russiske akademiske tekster, kvantificere tekstforståelsesvanskeligheder, vurdere tekstsværhedsgrad, måle tekstkompleksitet for russiske lærere af engelsk, forudsige børns læseforståelse, score essays for junior- og seniorelever, sammenligne tekstkompleksitet på engelsk og russisk, konstruere en tekstkompleksitetsgradueringsmodel for engelske lærebøger, analysere syntaktisk kompleksitet i læsematerialer, forudsige tekstkompleksitet i kinesiske grundskolelærebøger og forudsige læreres præstationer i en flertekst-skriveopgave. Disse studier anvender forskellige algoritmer såsom mønstergenkendelse, latent semantisk analyse, maskinlæring, supportvektormaskiner og naturlig sprogbehandling for at nå deres mål."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}