{"id":"c2276","number":2868,"headline":{"en":"Social media surveillance","da":"Overvågning af sociale medier"},"content":{"en":"Social media surveillance: Researchers are using GIS, machine learning, and data mining techniques to analyze Twitter data and improve surveillance of influenza outbreaks. Unsupervised learning algorithms are being used to classify geo-tagged Tweets in London and understand the nature of content posted on Twitter. Sentiment analysis algorithms are helping identify the factors related to sustainable care of the environment and public health that most concern Twitter users. These studies show how algorithms can assist in guiding resource allocation decisions during natural disasters, analyzing political landscapes, improving situational awareness, and assisting authorities in pandemic-related policy decisions. They also highlight the potential of algorithms in mining and filtering information from social media, improving disaster relief efficiency, estimating damages, and understanding public perception.","da":"Overvågning af sociale medier: Forskere bruger GIS, maskinlæring og data mining-teknikker til at analysere Twitter-data og forbedre overvågningen af influenzaudbrud. Uovervågede læringsalgoritmer bliver brugt til at klassificere geo-tagged Tweets i London og forstå indholdets karakter på Twitter. Sentiment-analysealgoritmer hjælper med at identificere de faktorer relateret til bæredygtig pleje af miljøet og folkesundheden, som bekymrer Twitter-brugere mest. Disse undersøgelser viser, hvordan algoritmer kan hjælpe med at styre ressourceallokeringsbeslutninger under naturkatastrofer, analysere politiske landskaber, forbedre situationsbevidsthed og assistere myndigheder i pandemirelaterede politiske beslutninger. De fremhæver også algoritmers potentiale i at udvinde og filtrere information fra sociale medier, forbedre effektiviteten af katastrofehjælp, estimere skader og forstå offentlighedens opfattelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}