{"id":"c2387","number":1099,"headline":{"en":"UAV-based monitoring","da":"UAV-baseret overvågning"},"content":{"en":"UAV-based monitoring: Scientists are exploring the use of unmanned aerial vehicles (UAVs) and algorithms to monitor and analyze various natural phenomena. These include monitoring the dynamics of Himalayan glacier tongues, capturing micro-topography of Antarctic moss beds, mapping surface features on debris-covered glaciers, creating 3D terrain models of mine lakes, reconstructing buried Medieval landscapes, monitoring topographic changes in tidal inlets, characterizing sedimentary outcrops, detecting geomorphic changes, tracking variations in alpine glaciers, monitoring rock glaciers, assessing flood risks in coastal channels, analyzing geological hazards, observing lava dome emplacement, and monitoring glacier variations. The algorithms used in conjunction with UAVs include structure for motion, structure from motion, object-based image analysis, Agisoft software, photogrammetry, and multi-temporal UAV images.","da":"UAV-baseret overvågning: Forskere udforsker brugen af ubemandede luftfartøjer (UAV'er) og algoritmer til at overvåge og analysere forskellige naturlige fænomener. Disse inkluderer overvågning af dynamikken i Himalayiske gletscher-tunger, optagelse af mikro-topografi af antarktiske mos-senge, kortlægning af overfladeegenskaber på affaldsdækkede gletsjere, oprettelse af 3D-terrænmodeller af mine-søer, rekonstruktion af begravede middelalderlandskaber, overvågning af topografiske ændringer i tidevandskanaler, karakterisering af sedimentære udgravninger, detektering af geomorfologiske ændringer, sporing af variationer i alpine gletsjere, overvågning af klippe-gletsjere, vurdering af oversvømmelsesrisici i kystkanaler, analyse af geologiske risici, observation af lavakuppel-placering og overvågning af gletscher-variationer. De algoritmer, der anvendes sammen med UAV'er, inkluderer struktur for bevægelse, struktur fra bevægelse, objektbaseret billedanalyse, Agisoft-software, fotogrammetri og multi-temporale UAV-billeder."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}