{"id":"c2425","number":1054,"headline":{"en":"Powder densification analysis","da":"Pulverdensificeringsanalyse"},"content":{"en":"Powder densification analysis: Scientists have developed algorithms that accurately predict the densification of powders under hydrostatic loading and the elasticity and fracture behavior of compressed pharmaceutical powders. These algorithms analyze the mechanics of pharmaceutical agglomerates and characterize the densification behavior of tableting materials. They also examine the compression properties of paracetamol and determine the best mathematical models to describe the tensile strength-relative density profiles of binary tablets. Additionally, algorithms are used to characterize the rheological and mechanical properties of pharmaceutical formulations and evaluate the compressibility of pharmaceutical powders. These advancements in algorithmic analysis provide valuable insights into the behavior and properties of pharmaceutical materials, aiding in the development of more effective and efficient drug formulations.","da":"Pulverdensificeringsanalyse: Forskere har udviklet algoritmer, der nøjagtigt forudsiger tætningen af pulver under hydrostatisk belastning samt elasticiteten og brudadfærden af komprimerede farmaceutiske pulvere. Disse algoritmer analyserer mekanikken i farmaceutiske agglomerater og karakteriserer densificeringsadfærden af tabletteringsmaterialer. De undersøger også kompressionsegenskaberne af paracetamol og bestemmer de bedste matematiske modeller til at beskrive trækstyrke-relative tætheder for binære tabletter. Desuden bruges algoritmer til at karakterisere rheologiske og mekaniske egenskaber af farmaceutiske formuleringer og evaluere komprimerbarheden af farmaceutiske pulvere. Disse fremskridt inden for algoritmisk analyse giver værdifuld indsigt i adfærden og egenskaberne af farmaceutiske materialer, hvilket hjælper med udviklingen af mere effektive og effektive lægemiddelformuleringer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}