{"id":"c2478","number":4021,"headline":{"en":"Automated 3D Modeling","da":"Automatiseret 3D-modellering"},"content":{"en":"Automated 3D Modeling: Machine learning algorithms, specifically the GAN model, can generate 3D models from architectural plans and sections. Generative adversarial networks can be used for automated structural design of shear wall residential buildings, facilitate the smart rendering of urban master plans, and accelerate environmental performance-driven urban design. Artificial intelligence-aided computation systems can support plural urban design. Deep learning algorithms, agent-based modeling, and graph algorithms can automate architectural layout generation. Conditional Generative Adversarial Network models can automate interior space planning. Generative modeling algorithms, 3D generative adversarial networks, dual Transformer models, and graph neural networks can generate various architectural forms, spatial configurations, and structural topologies. Generative methods, such as evolutionary optimization and deep generative models, are currently trending in generative urban design.","da":"Automatiseret 3D-modellering: Maskinlæringsalgoritmer, specifikt GAN-modellen, kan generere 3D-modeller fra arkitektoniske planer og sektioner. Generative adversarial networks kan bruges til automatiseret strukturel design af skærmvæg boligbygninger, facilitere smart rendering af byplaner, og accelerere miljøpræstationsdrevet bydesign. Kunstig intelligens-støttede beregningssystemer kan understøtte pluralistisk bydesign. Dybe læringsalgoritmer, agentbaseret modellering og grafalgoritmer kan automatisere generering af arkitektoniske layout. Conditional Generative Adversarial Network-modeller kan automatisere planlægning af indvendige rum. Generative modelleringsalgoritmer, 3D generative adversarial networks, dual Transformer-modeller og graf-neurale netværk kan generere forskellige arkitektoniske former, rumlige konfigurationer og strukturelle topologier. Generative metoder, såsom evolutionær optimering og dybe generative modeller, er i øjeblikket trendsættende inden for generativt bydesign."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}