{"id":"c2548","number":2411,"headline":{"en":"Cardiac Output Measurement","da":"Måling af hjerteudgang"},"content":{"en":"Cardiac Output Measurement: Scientists have been investigating various algorithms and devices to accurately measure cardiac output in patients. These algorithms include noninvasive hemodynamic analyzers, thoracic electrical bioimpedance, electrical velocimetry, arterial pulse contour-based devices, novel algorithms based on arterial pressure waveform, NICO monitors with updated software, Arterial Pressure Cardiac Output algorithms, Vigileo™ monitors, continuous cardiac output monitors, third-generation FloTrac/Vigileo software, 3.02 software version of the FloTrac/Vigileo system, Mostcare monitors, CNAP systems, pulse contour analysis, bioreactance, pulmonary artery catheters, pulse wave transit time method, Retia Argos and Edwards Vigileo-FloTrac devices, and oscillometry-based estimation of cardiac output. These studies aim to determine the accuracy and reliability of these algorithms in measuring cardiac output, especially in patients undergoing cardiac surgery or with conditions like septic shock or cardiogenic shock.","da":"Måling af hjerteudgang: Forskere har undersøgt forskellige algoritmer og enheder til præcist at måle hjerteudgang hos patienter. Disse algoritmer inkluderer non-invasive hæmodynamiske analysatorer, thorakal elektrisk bioimpedans, elektrisk velocimetri, arterielle puls-konturbaserede enheder, nye algoritmer baseret på arterielt trykbølgeform, NICO-monitorer med opdateret software, Arterial Pressure Cardiac Output-algoritmer, Vigileo™-monitorer, kontinuerlige hjerteudgangsmonitorer, tredje generations FloTrac/Vigileo software, 3.02 softwareversionen af FloTrac/Vigileo-systemet, Mostcare-monitorer, CNAP-systemer, pulskonturanalyse, bioreaktans, pulmonal arteriekateter, pulsbølgetransittidsmetoden, Retia Argos og Edwards Vigileo-FloTrac-enheder, samt oscillometribaseret estimering af hjerteudgang. Disse studier sigter mod at bestemme nøjagtigheden og pålideligheden af disse algoritmer til måling af hjerteudgang, især hos patienter, der gennemgår hjertekirurgi eller har tilstande som septisk shock eller kardiogent shock."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}