{"id":"c2554","number":1288,"headline":{"en":"Image Inpainting","da":"Billedgenopfyldning"},"content":{"en":"Image Inpainting: Researchers have explored various algorithms for image inpainting, which is the process of filling in missing or damaged parts of an image. These algorithms include copy-and-paste texture synthesis, geometric PDEs, coherence among neighboring pixels, patch sparsity, variation of variances, linear weighted filling-in, hierarchical level set, texture mapping, energy minimization, Bezier curves, hybrid inpainting algorithms, patch scale optimization, perceptual-fidelity aware mean squared error, adaptive patch size and sequencing of priority terms, nonlocal texture matching, nonlinear filtering, the Criminisi algorithm, structure and texture information using quadtree, multilevel image pyramids, and a combination of diffusion and enhanced exemplar methods. These algorithms attribute agency to the algorithms themselves, as they perform the inpainting process based on specific techniques and approaches.","da":"Billedgenopfyldning: Forskere har undersøgt forskellige algoritmer for billedgenopfyldning, som er processen med at udfylde manglende eller beskadigede dele af et billede. Disse algoritmer inkluderer kopiering og indsættelse af tekstursyntese, geometriske PDE'er, sammenhæng blandt nabopixels, patches sparsity, variation af varians, lineær vægtet udfyldning, hierarkisk niveauindstilling, teksturkortlægning, energiminimering, Bezierkurver, hybride genopfyldningsalgoritmer, patch skala-optimering, perceptuel-tro skønnet middelkvadreret fejl, adaptiv patch-størrelse og sekvensering af prioritetstermer, ikke-lokal teksturmatching, ikke-lineær filtrering, Criminisi-algoritmen, struktur- og teksturinformation ved brug af quadtree, flerlagede billedpyramider og en kombination af diffusion og forbedrede eksemplarmetoder. Disse algoritmer tilskriver agentur til algoritmerne selv, da de udfører genopfyldningsprocessen baseret på specifikke teknikker og tilgange."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}