{"id":"c2552","number":466,"headline":{"en":"Signal classification","da":"Signalklassificering"},"content":{"en":"Signal classification: Researchers have been exploring the use of various algorithms to improve the classification and recognition of partial discharge signals, which can help identify faults in electrical systems. These algorithms include adaptive optimal radially Gaussian kernel time-frequency representation, two-dimensional nonnegative matrix factorization, support vector machine, fuzzy support vector machine, artificial neural networks, Fisher discriminant analysis, two-directional modified fuzzy-weighted two-dimensional linear discriminant analysis, S transform, affinity propagation clustering, two-dimensional principal component analysis, non-dominated sorting genetic algorithm II, two-step logistic regression, optimized feature extraction of cumulative energy function, singular value decomposition, statistical analysis, linear prediction analysis, isolation forest algorithm, generalized discriminant component analysis driven support vector machine, laplacian score, correlation coefficient algorithms, and machine learning-based diagnostics scheme. These algorithms aim to improve the accuracy and efficiency of identifying and classifying different types of partial discharges in electrical systems.","da":"Signalklassificering: Forskere har undersøgt brugen af forskellige algoritmer for at forbedre klassificeringen og genkendelsen af deludladningssignaler, hvilket kan hjælpe med at identificere fejl i elsystemer. Disse algoritmer inkluderer adaptiv optimal radialt Gaussisk kerne tids-frekvens repræsentation, to-dimensionel ikke-negativ matrixfaktorisering, supportvektormaskine, fuzzy supportvektormaskine, kunstige neurale netværk, Fisher diskriminant analyse, todirektional modificeret fuzzy-vægtet to-dimensionel lineær diskriminant analyse, S-transform, affinitetsforplantningsklyngedannelse, to-dimensionel hovedkomponentanalyse, ikke-domineret sorteringsgenetisk algoritme II, to-trins logistisk regression, optimeret funktionsudtrækning af kumulativ energifunktion, singulærværdinedbrydning, statistisk analyse, lineær forudsigelsesanalyse, isolationsskovsalgoritme, generaliseret diskriminantkomponentanalyse drevet supportvektormaskine, laplaci-score, korrelationskoefficientalgoritmer og maskinlæringsbaseret diagnostisk skema. Disse algoritmer har til formål at forbedre nøjagtigheden og effektiviteten af identifikation og klassificering af forskellige typer af deludladninger i elsystemer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}