{"id":"c2585","number":2325,"headline":{"en":"Cystic Fibrosis Screening","da":"Cystisk Fibrose Screening"},"content":{"en":"Cystic Fibrosis Screening: Multiple-mutation DNA testing can improve newborn screening for cystic fibrosis by increasing sensitivity and identifying carriers more accurately. Knowledge of mutations in affected patients can lead to better advice and negative test results. However, the newborn screening algorithm in New York has a high false-positive rate and leads to many unnecessary confirmatory tests. Alberta's newborn screening program successfully identifies and treats newborns with cystic fibrosis. The utility of a very high IRT/No mutation referral category in cystic fibrosis newborn screening is that it identifies cases that would have been missed with other screening methods. CFTR gene analysis is an effective strategy for newborn screening for cystic fibrosis in France. Integrating clinical information with CFTR genotype and functional explorations allows for personalized and effective treatment of CF, CFTR-related disorder, and CFTR-related metabolic syndrome. Next-generation sequencing technology shows promise in improving cystic fibrosis screening with high sensitivity and better specificity. Guidelines provide recommendations for the management and follow-up of infants with unclear cystic fibrosis diagnosis. A screening algorithm that includes a second-tier panel followed by third-tier sequencing improves cystic fibrosis detection compared to a second-tier approach alone. Newborn screening in North Macedonia successfully identifies newborns with cystic fibrosis and provides a basis for improving the screening algorithm. Centralized tracking processes can improve the performance of the cystic fibrosis newborn screening program in France. The three-tier screening algorithm in British Columbia effectively identifies cystic fibrosis cases and reduces the burden of sweat testing. The French newborn screening program for cystic fibrosis meets European guideline standards and provides an effective strategy. Genetic testing plays a crucial role in the diagnosis of cystic fibrosis and CFTR-related disorders.","da":"Cystisk Fibrose Screening: DNA-testning af flere mutationer kan forbedre nyfødtscreening for cystisk fibrose ved at øge sensitiviteten og mere præcist identificere bærere. Viden om mutationer hos berørte patienter kan føre til bedre rådgivning og negative testresultater. Dog har nyfødtscreeningsalgoritmen i New York en høj falsk-positiv rate, hvilket leder til mange unødvendige bekræftende test. Albertas nyfødtscreeningsprogram identificerer og behandler med succes nyfødte med cystisk fibrose. Nytten af en meget høj IRT/ingen mutationshenvisningskategori ved cystisk fibrose nyfødtscreening er, at den identificerer tilfælde, der ville være blevet overset med andre screeningsmetoder. CFTR-genanalyse er en effektiv strategi til nyfødtscreening for cystisk fibrose i Frankrig. Integration af kliniske oplysninger med CFTR-genotype og funktionelle udforskninger tillader en personlig og effektiv behandling af CF, CFTR-relateret lidelse og CFTR-relateret metabolisk syndrom. Next-generation sequencing-teknologi viser løfte om forbedret cystisk fibrosescreening med høj sensitivitet og bedre specificitet. Retningslinjer giver anbefalinger for håndtering og opfølgning af spædbørn med uklar cystisk fibrosediagnose. En screeningsalgoritme, der inkluderer et andet-trinspanel efterfulgt af tredje-trinsequencering, forbedrer cystisk fibrosesektion sammenlignet med en anden-trins tilgang alene. Nyfødtscreening i Nordmakedonien identificerer med succes nyfødte med cystisk fibrose og skaber grundlag for forbedring af screeningsalgoritmen. Centraliserede sporingsprocesser kan forbedre ydeevnen af nyfødtscreeningsprogrammet for cystisk fibrose i Frankrig. Den tre-trins screeningsalgoritme i British Columbia identificerer effektivt tilfælde af cystisk fibrose og reducerer byrden af svedtest. Det franske nyfødtscreeningsprogram for cystisk fibrose opfylder europæiske retningslinjestandarder og leverer en effektiv strategi. Gentestning spiller en afgørende rolle i diagnosen af cystisk fibrose og CFTR-relaterede lidelser."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}