{"id":"c2639","number":2380,"headline":{"en":"AI in Orthopaedic Surgery","da":"AI i ortopædkirurgi"},"content":{"en":"AI in Orthopaedic Surgery: Artificial intelligence (AI) is playing an increasingly important role in orthopaedic surgery. It improves patient care by aiding in diagnosis, management, research, and systems analysis. AI and machine learning (ML) advancements are being used for clinical diagnosis, predicting post-operative outcomes, and complications in orthopaedic surgery. AI-based computational algorithms can also predict injury risk, interpret advanced imaging, evaluate patient-reported outcomes, and enhance telehealth. AI has extensive potential clinical applications in the surgical setting and is gradually changing surgery through advanced technological development in imaging, navigation, and robotic intervention. It can personalize risk prediction, detect implant specifics, and monitor patient movement and recovery in orthopaedic surgery. However, data quality is crucial for the success of machine learning applications. AI has the potential to augment surgeons by providing decision support, assessing technical skills, and performing tasks in surgery. German surgeons are positively disposed toward AI applications, but there is a deficit in knowledge and implementation in their professional environment. AI is also being investigated to optimize clinical efficiency in various subfields of plastic and reconstructive surgery. While AI has the potential to reduce cognitive load and support human performance in surgery, accurate and reliable systems require surgeon involvement. AI is used for diagnostics, predictive models, rehabilitation monitoring, and surgical training in orthopaedic surgery. However, the state-of-the-art of AI-enabled decision support in surgery is limited by small sample sizes, lack of external validation, and inadequate reporting. Sudanese orthopaedic surgeons are aware of AI applications but have doubts about safety and are interested in utilizing AI in various aspects of surgery. Orthopaedic patients are generally comfortable with AI joining the care team, but their knowledge and experience with AI impact their perspectives. Trauma and emergency surgeons have varying opinions on AI-based tools, with some believing in their potential and others expressing mistrust. Surgeons should consider ethical considerations such as patient safety, autonomy, confidentiality, informed consent, and surgical training in AI-assisted robotic surgery when adopting emerging innovations in AI and robotics.","da":"AI i ortopædkirurgi: Kunstig intelligens (AI) spiller en stadig vigtigere rolle inden for ortopædkirurgi. Den forbedrer patientpleje ved at hjælpe med diagnose, behandling, forskning og systemanalyse. Fremskridt inden for AI og maskinlæring (ML) bruges til kliniske diagnoser, forudsigelse af postoperative resultater og komplikationer i ortopædkirurgi. AI-baserede computeralgoritmer kan også forudsige skaderisiko, tolke avanceret billeddannelse, evaluere patientrapporterede resultater og forbedre telemedicin. AI har omfattende potentielle kliniske anvendelser i det kirurgiske miljø og ændrer gradvist kirurgi gennem avanceret teknologisk udvikling inden for billeddannelse, navigation og robotintervention. Den kan tilpasse risikoforudsigelse, opdage implantatspecifikationer og overvåge patientens bevægelse og helbredelse i ortopædkirurgi. Dog er datakvalitet afgørende for succesfulde maskinlæringsapplikationer. AI har potentiale til at styrke kirurger ved at yde beslutningsstøtte, vurdere tekniske færdigheder og udføre opgaver i operationen. Tyske kirurger er positivt indstillede over for AI-applikationer, men der er mangel på viden og implementering i deres professionelle miljø. AI undersøges også for at optimere klinisk effektivitet inden for forskellige underområder af plastisk og rekonstruktiv kirurgi. Mens AI har potentiale til at reducere kognitiv belastning og understøtte menneskelig præstation i kirurgi, kræver nøjagtige og pålidelige systemer kirurgens involvering. AI bruges til diagnostik, prædiktive modeller, rehabiliteringsovervågning og kirurgisk træning i ortopædkirurgi. Dog er state-of-the-art af AI-drevet beslutningsstøtte i kirurgi begrænset af små stikprøvestørrelser, mangel på ekstern validering og utilstrækkelig rapportering. Sudanesisk ortopædkirurger er klar over AI-applikationer, men har tvivl om sikkerheden og er interesserede i at anvende AI i forskellige aspekter af kirurgi. Ortopædiske patienter er generelt trygge ved, at AI bliver en del af plejeholdet, men deres viden og erfaring med AI påvirker deres opfattelser. Traume- og akutkirurger har varierende holdninger til AI-baserede værktøjer, hvor nogle tror på deres potentiale, mens andre udtrykker mistillid. Kirurger bør overveje etiske overvejelser som patientsikkerhed, autonomi, fortrolighed, informeret samtykke og kirurgisk træning i AI-assisteret robotkirurgi, når de adopterer nye innovationer inden for AI og robotteknologi."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}