{"id":"c2654","number":2551,"headline":{"en":"Suicide risk prediction","da":"Selvmordsrisiko forudsigelse"},"content":{"en":"Suicide risk prediction: Machine learning algorithms are being used to predict suicide attempts in individuals with schizophrenia, as well as to advance suicide prediction in general. These algorithms offer a promising method for incorporating clinical features and accurately detecting suicide risk. They can also be used to identify individuals at risk for suicide attempts among adolescents and in Native American communities. Machine learning approaches have the potential to improve the prediction of future suicidal behavior, support early identification of individuals at risk, and classify suicidal thoughts and behaviors. These algorithms can also identify risk factors for suicidal ideation and attempt in specific populations, such as the Korean population and Brazilians with common mental disorders. Overall, machine learning models show good prediction performance in identifying suicide risk and can be a valuable tool in suicide prevention.","da":"Selvmordsrisiko forudsigelse: Maskinlæringsalgoritmer bliver brugt til at forudsige selvmordsforsøg hos individer med skizofreni, samt til at fremme selvmordsforudsigelse generelt. Disse algoritmer tilbyder en lovende metode til at indarbejde kliniske træk og nøjagtigt at opdage selvmordsrisiko. De kan også bruges til at identificere enkeltpersoner i risikozonen for selvmordsforsøg blandt unge og i indfødte amerikanske samfund. Maskinlæringsmetoder har potentiale til at forbedre forudsigelsen af fremtidig selvmordsadfærd, støtte tidlig identifikation af risikopersoner, og klassificere selvmordstanker og -adfærd. Disse algoritmer kan også identificere risikofaktorer for selvmordstanker og -forsøg i specifikke befolkninger, såsom den koreanske befolkning og brasilianere med almindelige mentale lidelser. Samlet set viser maskinlæringsmodeller god forudsigelsespræstation i at identificere selvmordsrisiko og kan være et værdifuldt værktøj i selvmordsforebyggelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}