{"id":"c2656","number":1487,"headline":{"en":"Epidemic network modeling","da":"Epidemiske netværksmodeller"},"content":{"en":"Epidemic network modeling: Algorithms are being used to answer various research questions related to the spread of infectious diseases. These algorithms simulate and evaluate the structural properties of contact networks, model disease dynamics, untangle epidemic spread and transmission network dynamics, analyze the impact of household structure and network clustering on disease spread, and investigate the effects of different network patterns on epidemic behavior. They are also used to detect network clustering in epidemic transmission trees, study the impact of network topological structure on disease dynamics, and explore the influence of higher-order network structure and differential susceptibility on epidemic spread. Additionally, algorithms are employed to account for large initial conditions and changing network structure in epidemic spread, examine the effect of strong spatial embedding of social networks on epidemic dynamics, and develop simple epidemic network models for highly heterogeneous populations. These algorithms are also used to model the spread of specific diseases like Covid-19 on inhomogeneous random social networks and evaluate the effectiveness of random walks in modeling epidemics on networks.","da":"Epidemiske netværksmodeller: Algoritmer bruges til at besvare forskellige forskningsspørgsmål relateret til spredning af infektionssygdomme. Disse algoritmer simulerer og evaluerer de strukturelle egenskaber af kontakt-netværk, modellerer sygdomsdynamik, afklarer epidemisk spredning og transmissionsnetværksdynamik, analyserer virkningen af husstandsstruktur og netværksklustering på sygdomsspredning samt undersøger effekterne af forskellige netværksmønstre på epidemisk adfærd. De bruges også til at opdage netværksklustering i epidemiske transmissions-træer, studere virkningen af netværkets topologiske struktur på sygdomsdynamik og udforske indflydelsen af højere-ordens netværksstruktur og differentiel modtagelighed på epidemisk spredning. Derudover anvendes algoritmer til at tage hensyn til store initialbetingelser og skiftende netværksstruktur i epidemisk spredning, undersøge effekten af stærk rumlig indlejring af sociale netværk på epidemisk dynamik og udvikle simple epidemiske netværksmodeller for meget heterogene populationer. Disse algoritmer bruges også til at modellere spredningen af specifikke sygdomme som Covid-19 på inhomogene tilfældige sociale netværk og evaluere effektiviteten af tilfældige vandringer i modellering af epidemier på netværk."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}