{"id":"c2689","number":1438,"headline":{"en":"Medical text mining","da":"Medicinsk tekstanalyse"},"content":{"en":"Medical text mining: Researchers have been exploring the use of various algorithms to extract valuable information from medical documents. These algorithms include text mining, automated systems, hybrid systems, linguistic natural language processing techniques, cascade of machine learners, rule-based systems, machine learning systems, cascaded methods, graphical user interface-driven approaches, machine learning-based approaches, machine-learned solutions, feature engineering combined with machine learning and rule-based methods, and semi-supervised extraction systems. These algorithms aim to accurately predict disease status, classify obesity and comorbidities, extract medication information, identify medication information, extract and classify clinical data, reduce the need for custom software and rules development, perform clinical information extraction tasks, identify medical concepts and classify assertions, extract structured information, map phrases to pre-defined concepts, and extract prescription information from medical documents.","da":"Medicinsk tekstanalyse: Forskere har undersøgt anvendelsen af forskellige algoritmer til at udtrække værdifuld information fra medicinske dokumenter. Disse algoritmer inkluderer tekstanalyse, automatiserede systemer, hybride systemer, sproglige naturlige sprogbehandlingsteknikker, kaskader af maskinlærere, regelbaserede systemer, maskinlæringssystemer, kaskadede metoder, grafiske brugergrænsefladedrevne tilgange, maskinlæringsbaserede tilgange, maskinlærte løsninger, feature engineering kombineret med maskinlæring og regelbaserede metoder, samt semi-overvågede ekstraktionssystemer. Disse algoritmer sigter mod præcist at forudsige sygdomsstatus, klassificere fedme og komorbiditeter, udtrække medicininformation, identificere medicininformation, udtrække og klassificere kliniske data, reducere behovet for specialudviklet software og reglers udvikling, udføre klinisk informationsudvinding, identificere medicinske begreber og klassificere påstande, udtrække struktureret information, kortlægge sætninger til foruddefinerede begreber, og udtrække receptinformation fra medicinske dokumenter."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}