{"id":"c2724","number":2918,"headline":{"en":"Emerging Technologies in Education","da":"Fremtidige teknologier i uddannelse"},"content":{"en":"Emerging Technologies in Education: Emerging learning technologies such as adaptive learning technologies, artificial intelligence, and virtual reality can be used to enhance learning in higher education. Humanities education needs to be prioritized in the context of Industry 4.0, and policies should be framed in the context of human-technology convergence. Medical education should be transformed by embedding students in the work environment, adopting academic healthcare systems, and integrating research and innovation into the learning experience. The Fourth Industrial Revolution (4IR) is impacting education through smart communication systems, artificial intelligence, robotics, and virtual reality, and curriculum development needs to keep pace with technological advances. Micro-teaching is being evaluated in the digital era to determine its relevance and the competencies needed by prospective teachers. Engineering students need to develop soft skills in addition to technical knowledge to meet the demands of Industry 4.0. Institutions of higher education can build curricula that prepare students for Industry 4.0 by incorporating artificial intelligence and interactive design. Technologies such as virtual and augmented reality, 3D printing, drones, and robots are transforming engineering education. Interdisciplinarity is emerging in engineering fields and influencing management practice. The ethical dimensions of emerging technologies, such as big data and artificial intelligence, need to be considered in engineering education. Engineering education should adapt to the changes brought by Industry 5.0 by focusing on skill-oriented, project-based learning and practical concepts. The curriculum in Nigerian higher education can be made more responsive to the 4IR through the use of an itinerant curriculum. Learning curve modelling has applications in Industry 4.0, particularly in relation to technologies such as big data and IoT. Engineering education needs a paradigm shift to focus on skill development, sustainability, resilience, and human-centric design in the era of Industry 5.0. Heutagogy, a self-determined learning approach, can be implemented in universities. Factors such as technological optimism and ease of use influence the acceptance of Industry 4.0 technologies by students from rural areas. Healthcare professionals and students can be trained in digital health in the context of Industry 5.0 by incorporating enabling technologies. Learning is facilitated in an era of uncertainty in Singapore through the enhancement of adaptive capacity, lifelong learning, and a paradigm of inspiration and readiness for paradigm shifts.","da":"Fremtidige teknologier i uddannelse: Fremvoksende læringsteknologier som adaptive læringsteknologier, kunstig intelligens og virtual reality kan bruges til at forbedre læring på højere uddannelsesniveau. Humanistisk uddannelse skal prioriteres i konteksten af Industri 4.0, og politikker bør udformes i konteksten af menneske-teknologi-konjunktion. Medicinsk uddannelse bør transformeres ved at integrere studerende i arbejdsmiljøet, vedtage akademiske sundhedssystemer og integrere forskning og innovation i læringsoplevelsen. Den fjerde industrielle revolution (4IR) påvirker uddannelse gennem intelligente kommunikationssystemer, kunstig intelligens, robotteknologi og virtual reality, og pensumudvikling skal følge med de teknologiske fremskridt. Micro-teaching vurderes i den digitale æra for at fastslå dets relevans og de kompetencer, som kommende lærere har brug for. Ingeniørstuderende skal udvikle bløde færdigheder udover teknisk viden for at imødekomme kravene fra Industri 4.0. Institutioner for højere uddannelse kan opbygge pensum, der forbereder studerende til Industri 4.0 ved at inkorporere kunstig intelligens og interaktivt design. Teknologier som virtual og augmented reality, 3D-print, droner og robotter transformerer ingeniøruddannelse. Interdisciplinaritet opstår i ingeniørfelter og påvirker ledelsespraksis. De etiske dimensioner af fremtidige teknologier, som big data og kunstig intelligens, skal overvejes i ingeniøruddannelsen. Ingeniøruddannelse skal tilpasses de ændringer, som Industri 5.0 medfører, ved at fokusere på færdighedsorienteret, projektbaseret læring og praktiske koncepter. Pensum i nigeriansk højere uddannelse kan gøres mere responsivt over for 4IR gennem brugen af et omrejsende pensum. Learning curve-modellering har anvendelser i Industri 4.0, især i relation til teknologier som big data og IoT. Ingeniøruddannelse har brug for et paradigmeskifte for at fokusere på færdighedsudvikling, bæredygtighed, modstandsdygtighed og menneskecentreret design i æraen af Industri 5.0. Heutagogi, en selvbestemt læringstilgang, kan implementeres på universiteter. Faktorer som teknologisk optimisme og brugervenlighed påvirker studerendes accept af Industri 4.0 teknologier fra landdistrikter. Sundhedspersonale og studerende kan trænes i digital sundhed i konteksten af Industri 5.0 ved at inkorporere muliggørende teknologier. Læring fremmes i en æra med usikkerhed i Singapore gennem forbedring af tilpasningsevne, livslang læring og et paradigme af inspiration og parathed til paradigmeskifter."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}