{"id":"c2750","number":2963,"headline":{"en":"AI in Tourism","da":"AI i turisme"},"content":{"en":"AI in Tourism: Recent research has explored various aspects of the role of algorithms in tourism and hospitality. Machine learning algorithms are used to analyze gaps and inconsistencies in the literature on smart tourism development and management. Artificial intelligence applications are examined in the context of shaping tourist decision-making. Technologies such as virtual reality and artificial intelligence are expected to play a significant role in the promotion and marketing of the tourism sector in Spain after the COVID-19 pandemic. Big data and artificial intelligence technology are integrated to optimize the performance of e-ecotourism destinations. The impact of new technologies, such as artificial intelligence and the internet of things, on sustainable tourism is explored. Artificial intelligence algorithms are applied to collect data from stakeholders to identify common and divergent aspects regarding the sustainable competitiveness of tourism in a specific region. Cutting-edge technologies contribute to sustainable ecotourism through natural science and technological innovation. Social network analysis is used to identify sustainable tourism business networks based on cognitive and geographical proximity. Systematic reviews and bibliometric analyses are conducted to examine the current state of research on artificial intelligence in tourism and hospitality, as well as to identify emerging areas and research trends in the intersection of marketing, tourism, and big data. Artificial intelligence algorithms are used to evaluate the impact of the sharing economy, specifically Airbnb, on urban destinations. Intelligent automation is explored as a means to manage smart tourist destinations and contribute to sustainable tourism. The development of anthropomorphism in hospitality and tourism is examined through bibliometric analysis and content analysis. The combination of big data and local knowledge, along with artificial intelligence approaches, is used to quantify the value of nature for tourism and support sustainable resource management. The impact of perceived smart tourism technologies on tourists' well-being in marine tourism is investigated, with memorable tourism experiences playing a mediating role. Finally, a comprehensive analysis is conducted to explore the current state of artificial intelligence in hospitality and tourism and propose future research avenues.","da":"AI i turisme: Nylig forskning har udforsket forskellige aspekter af algoritmers rolle i turisme og gæstfrihed. Maskinlæringsalgoritmer bruges til at analysere huller og uoverensstemmelser i litteraturen om smart turismeudvikling og -styring. Anvendelsen af kunstig intelligens undersøges i forbindelse med at forme turistens beslutningstagning. Teknologier som virtual reality og kunstig intelligens forventes at spille en væsentlig rolle i fremme og markedsføring af turismesektoren i Spanien efter COVID-19-pandemien. Big data og kunstig intelligens-teknologi integreres for at optimere ydeevnen af e-økoturisme destinationer. Indvirkningen af nye teknologier, såsom kunstig intelligens og tingenes internet, på bæredygtig turisme udforskes. Algoritmer for kunstig intelligens anvendes til at indsamle data fra interessenter for at identificere fælles og divergerende aspekter vedrørende den bæredygtige konkurrenceevne i turismen i en bestemt region. Banebrydende teknologier bidrager til bæredygtig økoturisme gennem naturvidenskab og teknologisk innovation. Analyse af sociale netværk bruges til at identificere bæredygtige turistvirksomhedsnetværk baseret på kognitiv og geografisk nærhed. Systematiske anmeldelser og bibliometriske analyser udføres for at undersøge den nuværende tilstand af forskning om kunstig intelligens i turisme og gæstfrihed samt for at identificere nye områder og forskningstendenser i skæringspunktet mellem markedsføring, turisme og big data. Algoritmer for kunstig intelligens bruges til at evaluere indvirkningen af deleøkonomien, specifikt Airbnb, på urbane destinationer. Intelligent automatisering udforskes som et middel til at styre smarte turistdestinationer og bidrage til bæredygtig turisme. Udviklingen af antropomorfisme i gæstfrihed og turisme undersøges gennem bibliometriske analyser og indholdsanalyser. Kombinationen af big data og lokal viden, sammen med kunstig intelligens-tilgange, bruges til at kvantificere værdien af natur for turisme og støtte bæredygtig ressourcestyring. Indvirkningen af opfattede smarte turismeteknologier på turisters velvære i marine turisme undersøges, hvor mindeværdige turismeoplevelser spiller en medieringsrolle. Endelig udføres en omfattende analyse for at udforske den nuværende status for kunstig intelligens inden for gæstfrihed og turisme og foreslå fremtidige forskningsveje."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}