{"id":"c2765","number":2378,"headline":{"en":"CKD Algorithm Accuracy","da":"CKD-algoritmens nøjagtighed"},"content":{"en":"CKD Algorithm Accuracy: Algorithms are being used to accurately identify patients with chronic kidney disease (CKD) and define chronic dialysis in patients with end-stage renal disease (ESRD) using Medicare claims data and outpatient administrative data. However, administrative data alone may not be sufficient for CKD surveillance compared to estimated glomerular filtration rate (eGFR). Algorithms using combined hospital encounter and physician claims codes can detect CKD in Ontario, Canada. Retrospectively calculated eGFR can differ slightly from automated values in electronic health record data. Algorithms are also being used to identify and study CKD and at-risk patients through a multicenter registry that utilizes electronic health records. Adding related codes can improve the performance of diagnosis code-based algorithms for CKD. However, administrative data algorithms have low sensitivity for identifying CKD in children. An algorithm based on administrative data can estimate the prevalence of CKD in the Lazio region of Italy. Claims-based algorithms using ICD codes can accurately identify patients with moderate to severe CKD. An algorithm based on administrative data has high specificity and adequate performance for diagnosing CKD. Algorithms can accurately identify CKD in a French national health insurance claims database and can also accurately identify patients with CKD and related chronic diseases using electronic health record data. Claims-based prediction models can accurately determine clinical phenotypes of CKD using laboratory results.","da":"CKD-algoritmens nøjagtighed: Algoritmer anvendes til nøjagtigt at identificere patienter med kronisk nyresygdom (CKD) og definere kronisk dialyse hos patienter med end-stage nyresygdom (ESRD) ved hjælp af Medicare-kravsdata og ambulante administrative data. Dog kan administrative data alene ikke være tilstrækkelige til CKD-overvågning sammenlignet med estimeret glomerulær filtreringsrate (eGFR). Algoritmer, der bruger kombinerede hospitalsbesøg og lægekravskoder, kan opdage CKD i Ontario, Canada. Retrospektivt beregnet eGFR kan afvige en smule fra automatiserede værdier i elektroniske sundhedsdata. Algoritmer anvendes også til at identificere og studere CKD og risikopatienter gennem et multicenterregister, der udnytter elektroniske sundhedsjournaler. Tilføjelse af relaterede koder kan forbedre præstationen af diagnosekode-baserede algoritmer for CKD. Dog har administrative dataalgoritmer lav følsomhed for at identificere CKD hos børn. En algoritme baseret på administrative data kan estimere prævalensen af CKD i Lazio-regionen i Italien. Krav-baserede algoritmer, der bruger ICD-koder, kan nøjagtigt identificere patienter med moderat til svær CKD. En algoritme baseret på administrative data har høj specificitet og tilstrækkelig præstation til at diagnosticere CKD. Algoritmer kan nøjagtigt identificere CKD i en fransk national sundhedsforsikringsdatabase og kan også nøjagtigt identificere patienter med CKD og relaterede kroniske sygdomme ved hjælp af elektroniske sundhedsdata. Krav-baserede forudsigelsesmodeller kan nøjagtigt bestemme kliniske fænotyper af CKD ved hjælp af laboratorieresultater."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}