{"id":"c2768","number":2748,"headline":{"en":"Optimizing fuzzy classification","da":"Optimering af fuzzy klassifikation"},"content":{"en":"Optimizing fuzzy classification: Researchers have been exploring various ways to improve the performance of fuzzy rule-based classification systems. They have used algorithms such as genetic algorithms, composite criteria, intelligent genetic algorithms, fuzzy numeric inference strategy, interval-valued fuzzy sets, hierarchical fuzzy rule-based systems, fuzzy association rule mining framework, two-stage genetic search, axiomatic fuzzy set theory, support vector machines, genetic postprocessing, fast iterative rule-based linguistic classifier, ensemble methodology, genetic algorithm-based search method, fuzzy feature selection approach, FCA-based method, harmonic search methods, mixed integer programming model, genetic-algorithm-based fuzzy inference system, multiobjective evolutionary computation, and the EasIeR technique to optimize and design these systems. These algorithms help in reducing complexity, improving accuracy, and handling high-dimensional data.","da":"Optimering af fuzzy klassifikation: Forskere har undersøgt forskellige måder at forbedre ydeevnen af fuzzy regelbaserede klassifikationssystemer. De har anvendt algoritmer såsom genetiske algoritmer, kompositkriterier, intelligente genetiske algoritmer, fuzzy numerisk inferensstrategi, intervalværdi fuzzy sæt, hierarkiske fuzzy regelbaserede systemer, fuzzy associeringsregelmining rammeværk, to-trins genetisk søgning, aksiomatisk fuzzy sætteori, support vector machines, genetisk postprocessering, hurtig iterativ regelbaseret sproglig klassifikator, ensemblemetodologi, genetisk algoritme-baseret søgemetode, fuzzy feature selection tilgang, FCA-baseret metode, harmonisk søgemetoder, blandet heltalsplanlægningsmodel, genetisk-algoritme-baseret fuzzy inferenssystem, multiobjektiv evolutionær beregning og EasIeR-teknikken til at optimere og designe disse systemer. Disse algoritmer hjælper med at reducere kompleksitet, forbedre nøjagtighed og håndtere høj-dimensionale data."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}