{"id":"c2808","number":3849,"headline":{"en":"Course Timetabling Optimization","da":"Kursusplanlægning Optimering"},"content":{"en":"Course Timetabling Optimization: Various research groups have developed algorithms to improve the performance of university course timetabling. These algorithms include the Stochastic Optimisation Timetabling Tool (SOTT) with Genetic Algorithms (GA) and Simulated Annealing (SA), a knowledge-based genetic algorithm, a genetic algorithm metaheuristic, a hybrid genetic algorithm and tabu search approach, genetic algorithms with guided and local search strategies, a time-dependent metaheuristic algorithm, the threshold accepting metaheuristic, a hybrid metaheuristic algorithm combining electromagnetic-like mechanism and great deluge algorithm, metaheuristic algorithms including evolutionary computation, Cellular algorithms, and Swarm Intelligence, a population based Local Search (PB-LS) heuristic, a bi-criteria hybrid Genetic Algorithm with robustness objective, a hybrid local search algorithm, and a hybrid method based on genetic algorithms. These algorithms aim to optimize the course timetabling process by incorporating various optimization methodologies and techniques.","da":"Kursusplanlægning Optimering: Forskellige forskergrupper har udviklet algoritmer til at forbedre ydeevnen af universitetets kursusplanlægning. Disse algoritmer inkluderer det stokastiske optimeringsplanlægningsværktøj (SOTT) med genetiske algoritmer (GA) og simuleret annealing (SA), en vidensbaseret genetisk algoritme, en genetisk algoritme metaheuristik, en hybrid genetisk algoritme og tabu søge tilgang, genetiske algoritmer med guidede og lokale søgestrategier, en tidsafhængig metaheuristisk algoritme, den tærskel accepterende metaheuristik, en hybrid metaheuristisk algoritme der kombinerer elektromagnetisk-lignende mekanisme og stor oversvømmelses algoritme, metaheuristiske algoritmer inklusive evolutionær beregning, cellulære algoritmer, og sværmintelligens, en befolkningsbaseret lokal søgning (PB-LS) heuristik, en bi-kriterie hybrid genetisk algoritme med robusthedsmål, en hybrid lokal søgealgoritme og en hybrid metode baseret på genetiske algoritmer. Disse algoritmer sigter mod at optimere kursusplanlægningsprocessen ved at indarbejde forskellige optimeringsmetodologier og teknikker."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}