{"id":"c2811","number":3072,"headline":{"en":"Team Optimization","da":"Teamoptimering"},"content":{"en":"Team Optimization: Researchers have been exploring various algorithms to optimize team formation in different contexts. These algorithms, such as Genetic Algorithms, Simulated Annealing, BCPruning, SSPruning, Constraint Programming, Local Search heuristic, and Variable Neighbourhood Search metaheuristic, are used to address research questions like how to optimize team composition, solve the team formation problem with a leader efficiently, consider multiple projects and fractions of people's dedication, incorporate social structure, and form teams with Span of Control constraints in social networks. Other research questions include how to form teams considering personnel work hours and project workload, eliminate redundancies for maximum profit under a limited budget, form grouped teams with efficient collaboration in social networks, optimize team performance using test scores, create high-performing teams through self-selection, form sociotechnical teams based on mutual affinity and skill requirements, improve expert team formation using state space reduction algorithms, optimize team formation on social networks using branch-and-bound algorithms, use set partitioning based goal programming models for team formation, form diverse and connected teams based on social networks, and solve the team orienteering problem with nonidentical agents and balanced score. These algorithms and techniques are being explored through experiments, systematic literature reviews, and mathematical formulations to improve team formation and collaboration.","da":"Teamoptimering: Forskere har undersøgt forskellige algoritmer for at optimere teamsammensætning i forskellige sammenhænge. Disse algoritmer, såsom genetiske algoritmer, simuleret annealing, BCPruning, SSPruning, constraint programming, lokal søgeheuristik og variable neighborhood search metahueristik, bruges til at adressere forskningsspørgsmål som hvordan man optimerer teamsammensætning, løser teamdannelsesproblemet med en leder effektivt, overvejer flere projekter og folks dedikationsfraktioner, indarbejder social struktur, og danner teams med span-of-control restriktioner i sociale netværk. Andre forskningsspørgsmål inkluderer, hvordan man danner teams, når man tager højde for personalets arbejdstimer og projektets arbejdsbyrde, eliminerer redundans for maksimum profit under et begrænset budget, former grupperede teams med effektivt samarbejde i sociale netværk, optimerer teampræstation ved hjælp af test scores, skaber højtydende teams gennem selvselektion, danner sociotekniske teams baseret på gensidig affinitet og kompetencekrav, forbedrer ekspertteamdannelse ved hjælp af tilstandsrumreduktionsalgoritmer, optimerer teamdannelse på sociale netværk ved hjælp af branch-and-bound algoritmer, bruger sætopdelingsbaserede målsætningsmodeller til teamdannelse, danner mangfoldige og sammenkoblede teams baseret på sociale netværk, og løser den orienterende teamudfordring med ikke-identiske agenter og afbalanceret score. Disse algoritmer og teknikker undersøges gennem eksperimenter, systematiske litteraturgennemgange og matematiske formuleringer for at forbedre teamdannelse og samarbejde."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}