{"id":"c2840","number":756,"headline":{"en":"Microstructural Trends","da":"Mikrostrukturelle Tendenser"},"content":{"en":"Microstructural Trends: Scientists are using image representations and machine learning techniques to explore microstructural trends in ultrahigh carbon steel. They are also using a two-stage machine learning approach with a Convolutional Neural Network (CNN) to characterize microstructural features in titanium alloys. Data-driven models such as ridge regression, XGBoost, and a custom 3D CNN are being used to predict mechanical properties of additively manufactured metals. Unsupervised machine learning techniques, like Convolutional Neural Networks (CNN) and superpixel algorithm, are being explored for microstructure segmentation without labeled images. Deep learning methods, such as Electron backscattered diffraction (EBSD)-trained deep learning (DL) method, are being used for microstructure classification and quantification in complex steel microstructures. Various CNN models including ResNet, VGG, DenseNet, Inception, and MobileNet are being tested for microstructure classification. A U-Net convolutional neural network is being used for microstructure segmentation in pearlitic-ferritic steel. Data mining methods are being employed for microstructural image segmentation in low-carbon steel. Deep learning algorithms are being used to estimate the prior austenite structure in martensitic steel. The performance of CNN-based steel classification is being studied under different imaging conditions. Machine learning techniques, including classical methods and convolutional neural networks (CNN), are being compared for classifying heat treatments in low-carbon steels. A deep learning algorithm with a Convolutional Neural Network (CNN) UNET machine learning architecture is being trained for phase segmentation of steel microstructures. Machine learning is being used to enhance data augmentation and predict impact toughness in cast austenitic steel. Finally, deep learning is being explored to detect martensite bands in dual-phase steels using a Faster Region-Based-Convolutional Neural Network (Faster R-CNN).","da":"Mikrostrukturelle Tendenser: Forskere bruger billedrepræsentationer og maskinlæringsteknikker til at udforske mikrostrukturelle tendenser i ultrahøjkarbonstål. De anvender også en to-trins maskinlæringstilgang med et Konvolutionelt Neuralt Netværk (CNN) til at karakterisere mikrostrukturelle egenskaber i titaniumlegeringer. Datadrevne modeller såsom ridge regression, XGBoost og en specialudviklet 3D CNN bliver brugt til at forudsige mekaniske egenskaber af additivt fremstillede metaller. Uovervågede maskinlæringsteknikker, som Konvolutionelle Neurale Netværk (CNN) og superpixel-algoritmen, bliver undersøgt til mikrostruktursegmentering uden mærkede billeder. Deep learning-metoder, såsom Electron backscattered diffraction (EBSD)-trænede deep learning (DL)-metoder, bliver brugt til mikrostrukturklassifikation og -kvantificering i komplekse stålmikrostrukturer. Forskellige CNN-modeller, herunder ResNet, VGG, DenseNet, Inception og MobileNet, bliver testet til mikrostrukturklassifikation. Et U-Net konvolutionelt neuralt netværk bliver brugt til mikrostruktursegmentering i perlitisk-ferritisk stål. Data mining-metoder bliver brugt til mikrostrukturbilledsegmentering i lavkarbonstål. Deep learning-algoritmer bliver brugt til at estimere den tidligere austenitstruktur i martensitisk stål. Ydeevnen af CNN-baseret ståklassifikation bliver studeret under forskellige billeddannelsesforhold. Maskinlæringsteknikker, inklusive klassiske metoder og konvolutionelle neurale netværk (CNN), bliver sammenlignet for at klassificere varmebehandlinger i lavkarbonstål. En deep learning-algoritme med en Kunvolutionel Neuralt Netværk (CNN) UNET maskinlæringsarkitektur bliver trænet til fasesegmentering af stålmikrostrukturer. Maskinlæring bliver brugt til at forbedre dataforøgelse og forudsige slagsejhed i støbt austenitisk stål. Endelig bliver deep learning undersøgt til at opdage martensitbånd i dobbeltfase-stål ved hjælp af et Faster Region-Based-Convolutional Neural Network (Faster R-CNN)."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}