{"id":"c2888","number":3877,"headline":{"en":"Map Matching","da":"Korttilpasning"},"content":{"en":"Map Matching: Algorithms play a crucial role in addressing various challenges related to GPS data and road networks. They are used to robustly associate GPS trajectories with the road network, enhance map-matching of low frequency GPS data, consider uncertainty in GPS-recorded positions during map matching, improve accuracy through information fusion, generate a more robust road network map from vehicle tracking data, automatically produce road networks from raw GPS trajectory data, match low-sampling-rate GPS trajectories to a road network, consider human factors in map-matching algorithms, improve efficiency and accuracy of map matching, adapt map-matching algorithms for fixed sensor data, match low-frequency GPS trajectories to a road network using a time-expanded graph, perform offline map matching using shortest paths, use turning points for map matching in urban areas, review recent advancements in map-matching algorithms, improve map matching for high-frequency and large-scale GPS data, and accelerate map-matching of GPS trajectories while maintaining high accuracy.","da":"Korttilpasning: Algoritmer spiller en afgørende rolle i at tackle forskellige udfordringer relateret til GPS-data og vejnet. De bruges til robust at associere GPS-trajektorier med vejnettet, forbedre korttilpasning af lavfrekvent GPS-data, tage højde for usikkerhed i GPS-registrerede positioner under korttilpasning, forbedre nøjagtigheden gennem informationsfusion, generere et mere robust vejnetkort fra køretøjssporingsdata, automatisk producere vejnet fra rå GPS-trajektoriedata, matche lavfrekvente GPS-trajektorier til et vejnet, tage højde for menneskelige faktorer i korttilpasningsalgoritmer, forbedre effektiviteten og nøjagtigheden af korttilpasning, tilpasse korttilpasningsalgoritmer til faste sensordata, matche lavfrekvente GPS-trajektorier til et vejnet ved hjælp af en tidsudvidet graf, udføre offline korttilpasning ved hjælp af korteste ruter, bruge drejepunkter til korttilpasning i byområder, gennemgå nylige fremskridt inden for korttilpasningsalgoritmer, forbedre korttilpasning for højfrekvent og storskala GPS-data, og accelerere korttilpasning af GPS-trajektorier mens høj nøjagtighed opretholdes."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}