{"id":"c2890","number":1317,"headline":{"en":"Pedestrian detection advancements","da":"Fremskridt inden for fodgængerregistrering"},"content":{"en":"Pedestrian detection advancements: Researchers are exploring how algorithms can improve the accuracy and efficiency of pedestrian detection. Deep learning algorithms, hierarchical convolutional features, ensemble of boosted decision models, and region-based convolutional neural network (R-CNN) approaches are among the proposed solutions. Other approaches include self-adaptive scale pedestrian detection, deep residual network (DRN), two-stream UDN, optimized Mask R-CNN, thermal imaging and convolutional neural networks, multi-scale pedestrian detection algorithm, deep dilated feature extraction, YOLOv2 model improvements, deep model based on parts, efficient pedestrian detection network, YOLOv5s-FCC model, multi-level feature fusion, PF_YOLOv4 algorithm, and Three ResNet Blocks. These algorithms aim to enhance the accuracy, speed, and performance of pedestrian detection in various scenarios, such as nighttime, traffic environments, and small object detection.","da":"Fremskridt inden for fodgængerregistrering: Forskere undersøger, hvordan algoritmer kan forbedre nøjagtigheden og effektiviteten af fodgængerregistrering. Deep learning-algoritmer, hierarkiske konvolutionelle funktioner, ensemble af boostede beslutningsmodeller og regionbaserede konvolutionelle neurale netværk (R-CNN) tilgange er blandt de foreslåede løsninger. Andre tilgange inkluderer selvtilpassende skala fodgængerregistrering, deep residual network (DRN), tostrøms UDN, optimeret Mask R-CNN, termisk billeddannelse og konvolutionelle neurale netværk, multi-skala fodgængerregistreringsalgoritme, dyb dilateret funktionsudvinding, forbedringer af YOLOv2-modellen, deep model baseret på dele, effektiv fodgængerregistreringsnetværk, YOLOv5s-FCC-model, multi-niveau funktionssammensmeltning, PF_YOLOv4-algoritme og Three ResNet Blocks. Disse algoritmer sigter mod at forbedre nøjagtigheden, hastigheden og præstationen af fodgængerregistrering i forskellige scenarier, såsom om natten, i trafikomgivelser og til små objektregistreringer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}