{"id":"c2921","number":2293,"headline":{"en":"Prenatal screening algorithms","da":"Prænatal screeningalgoritmer"},"content":{"en":"Prenatal screening algorithms: Algorithms can enhance the screening process for identifying pregnancies with trisomy 13 or 18 by combining fetal nuchal translucency thickness, maternal serum free β-hCG, and PAPP-A. They can also reduce the need for advanced ultrasound scanning in trisomy 21 screening by enabling well-trained sonographers to perform the scanning. Algorithms are highly effective in screening for trisomy 21, and they can improve risk assessment for fetal aneuploidies by reducing false positive rates. Additionally, algorithms can be used to screen for triploidy in the first trimester and provide effective screening for trisomy 18 and trisomies 21, 18, and 13. They can also improve the performance of first-trimester screening for trisomy 21 by assessing the fetal nasal bone. Overall, algorithms play a crucial role in improving the accuracy and effectiveness of screening for various genetic conditions during the first trimester of pregnancy.","da":"Prænatal screeningalgoritmer: Algoritmer kan forbedre screeningsprocessen for at identificere graviditeter med trisomi 13 eller 18 ved at kombinere fostrets nakkefoldstykkelse, moderens serum fri β-hCG og PAPP-A. De kan også reducere behovet for avanceret ultralydsscanning i trisomi 21 screening ved at gøre det muligt for veluddannede sonografer at udføre scanningen. Algoritmer er yderst effektive i screeningen for trisomi 21 og kan forbedre risikovurderingen for føtal aneuploidi ved at reducere antallet af falske positive resultater. Derudover kan algoritmer bruges til at screene for triploidi i første trimester og give effektiv screening for trisomi 18 samt trisomierne 21, 18 og 13. De kan også forbedre præstationen af første trimester screening for trisomi 21 ved at vurdere fostrets næseben. Samlet set spiller algoritmer en afgørende rolle i at forbedre nøjagtigheden og effektiviteten af screening for forskellige genetiske tilstande i løbet af første trimester af graviditeten."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}