{"id":"c2981","number":2980,"headline":{"en":"Social media algorithms","da":"Sociale mediealgoritmer"},"content":{"en":"Social media algorithms: Researchers are exploring how algorithms can be improved to manage social media content by combining spatial knowledge with text features, using the GeoFolk model-based framework. They are also investigating whether online behavior can be used as a proxy for studying urban mobility, employing the Location Archetype Keyword Extraction (LAKE) algorithm. Other studies are using algorithms to identify and track major events using geo-social networks, construct networks of interest from geospatial data on Twitter, and extract and understand urban areas of interest from geotagged photos. These algorithms include network construction algorithms, DBSCAN clustering algorithms, and algorithms for mining text and identifying urban areas of interest. The research aims to visualize spatiotemporal social network analysis, explore the geographic and temporal characteristics of events using social network messages, infer social strength from spatiotemporal data, and detect areas of interest within urban regions using socially-generated knowledge. Algorithms such as density-based DBSCAN, entropy-based models, and geo-clustering algorithms are being used for these purposes. Additionally, algorithms like Geo-Self-Organizing Maps (GeoSOMs) and contiguity-constrained hierarchical clustering are being employed to identify regions of social interaction and predict points of interest based on multiple dimensions of social media data. Researchers are also developing systems like Hadath for extracting events of interest from crowdsourced data and displaying them on digital maps. They are using the AUDESOME method to discover user mobility patterns from social media posts, hierarchical clustering and k-means clustering algorithms to analyze urban spatial patterns and functional zones using social media data, and machine learning and natural language processing techniques to mine social networks and detect traffic incidents. Finally, unsupervised algorithms for clustering and classification are being used to identify urban functions through social mining of geo-referenced data.","da":"Sociale mediealgoritmer: Forskere undersøger, hvordan algoritmer kan forbedres til at håndtere social media-indhold ved at kombinere rumlig viden med tekstfunktioner ved hjælp af GeoFolk-modellen. De undersøger også, om onlineadfærd kan bruges som en proxy til at studere urban mobilitet ved at anvende Location Archetype Keyword Extraction (LAKE) algoritmen. Andre studier bruger algoritmer til at identificere og spore vigtige begivenheder via geo-sociale netværk, konstruere interesse-netværk fra geospatiale data på Twitter og udtrække og forstå urbanområder af interesse fra geografisk taggede fotos. Disse algoritmer inkluderer netværkskonstruktionsalgoritmer, DBSCAN klyngealgoritmer og algoritmer til at udvinde tekst og identificere urbanområder af interesse. Forskningen sigter mod at visualisere spatio-temporal social netværksanalyse, udforske geografiske og tidsmæssige karakteristika af begivenheder ved hjælp af social netværksmeddelelser, udlede social styrke fra spatio-temporal data og opdage interesseområder inden for urbane regioner ved hjælp af socialt genereret viden. Algoritmer såsom densitetsbaserede DBSCAN, entropibaserede modeller og geo-klusteringsalgoritmer anvendes til disse formål. Derudover anvendes algoritmer som Geo-Self-Organizing Maps (GeoSOMs) og sammenhængsbegrænset hierarkisk clustering til at identificere områder med social interaktion og forudsige interessepunkter baseret på flere dimensioner af social media data. Forskere udvikler også systemer som Hadath til at udtrække interessebegivenheder fra crowdsourced data og vise dem på digitale kort. De bruger AUDESOME-metoden til at opdage brugermobilitetsmønstre fra sociale mediaindlæg, hierarkisk clustering og k-means clustering algoritmer til at analysere urbane rumlige mønstre og funktionelle zoner ved hjælp af social media data, samt maskinlæring og naturlig sprogbehandlingsteknikker til at udvinde sociale netværk og opdage trafikulykker. Endelig anvendes usuperviserede algoritmer til clustering og klassificering til at identificere urbane funktioner gennem social mining af geo-refererede data."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}