{"id":"c3024","number":2087,"headline":{"en":"Prostate Cancer Advances","da":"Fremskridt i Prostatakræft"},"content":{"en":"Prostate Cancer Advances: Researchers are exploring new and effective treatment approaches for patients with adverse histopathologic findings following radical prostatectomy. Traditional cancer treatment development algorithms may not be suitable for these new strategies. In the UK, efforts are being made to optimize the care of patients with advanced prostate cancer by establishing standardized treatment approaches that can be incorporated into treatment algorithms. Treatment options for localized prostate cancer include active surveillance, radical prostatectomy, and radiation therapy. New developments in medical treatment for castration-resistant prostate cancer require the identification of treatment strategies and markers that can help determine which patients will respond to specific drugs. Recent studies have not yet provided evidence for a therapeutic algorithm for post-docetaxel therapy in castration-resistant prostate cancer. Baseline variables, such as prostate-specific antigen levels, can have prognostic and predictive value in patients with metastatic castration-resistant prostate cancer. The management of metastatic castration-resistant prostate cancer requires the development of new treatment strategies and markers to identify patients who will respond to specific drugs. Research is ongoing to identify present, emerging, and possible future biomarkers in castration-resistant prostate cancer that can have prognostic, predictive, and surrogate qualities. The selection of primary radical therapy for high-risk non-metastatic prostate cancer should consider additional clinical and biological markers to provide a more precise approach to therapy selection. Predictive factors for response to abiraterone in metastatic castration refractory prostate cancer include duration of response to androgen deprivation therapy, performance status, and baseline hemoglobin levels. The management of castration-resistant prostate cancer should be guided by guidelines that are based on systematic literature reviews and tailored to the individual patient's treatment goals. Immediate receipt of androgen-deprivation therapy improves overall survival compared to delayed intervention in patients with prostate cancer with a rising prostate-specific antigen. Future therapeutic strategies for metastatic prostate cancer will involve precision medicine and molecular markers to guide treatment decisions and select patients who will respond best to targeted and immunotherapy. The efficacy of different treatments in patients with castration-resistant intraductal carcinoma of the prostate is assessed using a propensity score-matched analysis. Additional treatments to the local tumor for metastatic prostate cancer are being explored, and novel treatment algorithms are being developed to assess their effectiveness. In 2021, new prognostic and therapeutic tissue markers, as well as molecular markers, are being evaluated in patients with prostate cancer. The management of systemic prostate cancer from castration-sensitive to castration-resistant settings requires the integration of new drugs and treatment strategies, with precision medicine playing a crucial role in guiding treatment decisions. Early biochemical response, even with a decrease in prostate-specific antigen levels of less than 50%, is associated with prolonged survival in patients with metastatic castration-resistant prostate cancer treated with prostate-specific membrane antigen-directed radioligand therapy. Apalutamide consistently reduces prostate-specific antigen levels in both Black and non-Black men with advanced prostate cancer. Survival outcomes in the management of metastatic castrate-resistant prostate cancer in Ontario, Canada, are similar across all lines of therapy involving androgen-receptor-axis-targeted therapies and taxanes.","da":"Fremskridt i Prostatakræft: Forskere udforsker nye og effektive behandlingsmetoder for patienter med ugunstige histopatologiske fund efter radikal prostatektomi. Traditionelle algoritmer til udvikling af kræftbehandling kan muligvis ikke være egnede til disse nye strategier. I Storbritannien gøres der bestræbelser på at optimere pleje af patienter med fremskreden prostatakræft ved at etablere standardiserede behandlingsmetoder, der kan indarbejdes i behandlingsalgoritmer. Behandlingsmuligheder for lokaliseret prostatakræft inkluderer aktiv overvågning, radikal prostatektomi og strålebehandling. Nye udviklinger i medicinsk behandling for kastrationsresistent prostatakræft kræver identifikation af behandlingsstrategier og markører, der kan hjælpe med at afgøre, hvilke patienter der vil reagere på specifikke lægemidler. Nyere studier har endnu ikke givet evidens for en terapeutisk algoritme for post-docetaxel terapi i kastrationsresistent prostatakræft. Basisvariabler, som prostata-specifikt antigen niveauer, kan have prognostisk og prædiktiv værdi for patienter med metastatisk kastrationsresistent prostatakræft. Håndteringen af metastatisk kastrationsresistent prostatakræft kræver udvikling af nye behandlingsstrategier og markører for at identificere patienter, der vil reagere på specifikke lægemidler. Forskning pågår for at identificere nuværende, fremkommende og mulige fremtidige biomarkører i kastrationsresistent prostatakræft, som kan have prognostiske, prædiktive og surrogate kvaliteter. Valget af primær radikal terapi for højrisko ikke-metastatisk prostatakræft bør overveje yderligere kliniske og biologiske markører for at give en mere præcis tilgang til terapivalg. Prædiktive faktorer for respons på abirateron i metastatisk kastrationsrefraktær prostatakræft inkluderer varighed af respons på androgen deprivationsterapi, ydeevne status og baseline hæmoglobinniveauer. Håndteringen af kastrationsresistent prostatakræft bør vejledes af retningslinjer, der er baseret på systematiske litteraturanmeldelser og skræddersyet til den enkelte patients behandlingsmål. Øjeblikkelig modtagelse af androgen-deprivationsterapi forbedrer den samlede overlevelse sammenlignet med forsinket intervention hos patienter med prostatakræft med stigende prostata-specifikt antigen. Fremtidige terapeutiske strategier for metastatisk prostatakræft vil involvere præcisionsmedicin og molekylære markører til at vejlede behandlingsbeslutninger og udvælge patienter, der vil reagere bedst på målrettet og immunterapi. Effekten af forskellige behandlinger hos patienter med kastrationsresistent intraduktal karcinom i prostata vurderes ved hjælp af en propensity score-matched analyse. Yderligere behandlinger til den lokale tumor for metastatisk prostatakræft bliver udforsket, og nye behandlingsalgoritmer udvikles til at vurdere deres effektivitet. I 2021 bliver nye prognostiske og terapeutiske vævsmarkører samt molekylære markører evaluere hos patienter med prostatakræft. Håndteringen af systemisk prostatakræft fra kastrationsfølsomme til kastrationsresistente stadier kræver integration af nye lægemidler og behandlingsstrategier, hvor præcisionsmedicin spiller en afgørende rolle i styringen af behandlingsbeslutninger. Tidlig biokemisk respons, selv med et fald i prostata-specifikt antigen niveauer på mindre end 50 %, er forbundet med forlænget overlevelse hos patienter med metastatisk kastrationsresistent prostatakræft behandlet med prostata-specifikt membran antigen-styret radioligand terapi. Apalutamid reducerer konsekvent prostata-specifikt antigen niveauer hos både sorte og ikke-sorte mænd med fremskreden prostatakræft. Overlevelsesresultater i håndteringen af metastatisk kastrationsresistent prostatakræft i Ontario, Canada, er ens på tværs af alle behandlingslinjer, der involverer androgen-receptor-akse-målrettede terapier og taxaner."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}