{"id":"c3025","number":2623,"headline":{"en":"Drug Development Algorithms","da":"Lægemiddeludviklingsalgoritmer"},"content":{"en":"Drug Development Algorithms: Algorithms play a crucial role in various aspects of drug development and decision making. They are used to implement non-linear mixed effects modeling, model-based drug development, Bayesian methods, benefit-risk assessment, meta-analysis, exposure-response analysis, likelihood ratio test methods, pharmacogenomics and pharmacometrics integration, statistics and pharmacometrics synergy, model-informed drug development, mechanistic in silico models evaluation, quantitative systems pharmacology assessment, innovative technology utilization, real-world data assessment, systems models predictive capability evaluation, pediatric drug development support, real-world evidence utilization, model-based meta-analysis, real-world data practices and challenges, and statistical considerations for using real-world data in regulatory decision making. These algorithms help researchers and regulators make informed decisions, accelerate drug development, and improve patient outcomes.","da":"Lægemiddeludviklingsalgoritmer: Algoritmer spiller en afgørende rolle i forskellige aspekter af lægemiddeludvikling og beslutningstagning. De bruges til at implementere ikke-lineære blandede effekters modellering, modelbaseret lægemiddeludvikling, Bayesianske metoder, benefit-risk vurdering, meta-analyse, eksponerings-respons analyse, likelihood ratio testmetoder, farmakogenomics og farmakometrisk integration, statistik og farmakometrisk synergi, model-informeret lægemiddeludvikling, evaluering af mekanistiske in silico modeller, kvantitativ systemfarmakologi vurdering, anvendelse af innovative teknologier, vurdering af real-world data, evaluering af systemmodellers forudsigelsesevne, støtte til pædiatrisk lægemiddeludvikling, anvendelse af real-world evidens, modelbaseret meta-analyse, praksis og udfordringer i forbindelse med real-world data samt statistiske overvejelser ved brug af real-world data i regulatorisk beslutningstagning. Disse algoritmer hjælper forskere og regulatorer med at træffe informerede beslutninger, fremskynde lægemiddeludviklingen og forbedre patientresultater."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}