{"id":"c3045","number":1424,"headline":{"en":"Federated Learning","da":"Federated Learning"},"content":{"en":"Federated Learning: Federated learning is a promising solution for addressing the limited access to medical data for machine learning in the future of digital health. It allows the combination of medical data from different sites while preserving privacy by sharing machine learning models instead of raw data. This method can achieve similar accuracy and precision as centralized statistical models while providing stronger privacy protections. It also enables collaborative machine learning in healthcare research, allowing knowledge sharing without directly sharing data. Federated learning has been explored in various use cases and applications in the healthcare sector, and there are open-source tools available, such as OpenFL, for training ML/DL algorithms using federated learning. It also allows training on globally distributed, protected medical data without moving the data outside the country of origin. By enabling multi-center studies and distributed training of ML models with remotely hosted electronic health records (EHR) datasets, federated learning improves the use of EHR in machine learning. It also safeguards patients' data in medical image retrieval and advances privacy preservation in healthcare applications. However, there are challenges in implementing federated learning in the context of rare diseases, such as the need for a common data model. Platforms like FeatureCloud simplify the development and execution of federated learning algorithms in biomedicine. Overall, federated learning can address the challenges of privacy and data sharing in medical applications and has the potential to revolutionize healthcare informatics.","da":"Federated Learning: Federated learning er en lovende løsning til at håndtere den begrænsede adgang til medicinske data for maskinlæring i fremtidens digitale sundhed. Det muliggør kombinationen af medicinske data fra forskellige steder, mens privatlivet bevares ved at dele maskinlæringsmodeller i stedet for rådata. Denne metode kan opnå samme nøjagtighed og præcision som centraliserede statistiske modeller, samtidig med at den giver stærkere privatlivsbeskyttelse. Det muliggør også samarbejde inden for maskinlæring i sundhedsforskning, så viden kan deles uden direkte at dele data. Federated learning er blevet undersøgt i forskellige anvendelsestilfælde og applikationer inden for sundhedssektoren, og der findes open-source værktøjer, såsom OpenFL, til træning af ML/DL-algoritmer ved brug af federated learning. Det tillader også træning på globalt distribuerede, beskyttede medicinske data uden at dataene flyttes ud af oprindelseslandet. Ved at muliggøre multi-center studier og distribueret træning af ML-modeller med eksternt værtselektroniske sundhedsregistre (EHR) datasæt forbedrer federated learning brugen af EHR i maskinlæring. Det beskytter også patienters data i medicinsk bildegengivelse og fremmer privatlivsbeskyttelse i sundhedsapplikationer. Dog er der udfordringer i implementeringen af federated learning i konteksten af sjældne sygdomme, såsom behovet for en fælles datamodel. Platforme som FeatureCloud forenkler udviklingen og implementeringen af federated learning algoritmer inden for biomedicin. Overordnet set kan federated learning adressere udfordringerne vedrørende privatliv og datadeling i medicinske applikationer og har potentialet til at revolutionere sundhedsinformatik."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}