{"id":"c3048","number":1532,"headline":{"en":"Occlusion-aware face recognition","da":"Occlusion-aware ansigtsgenkendelse"},"content":{"en":"Occlusion-aware face recognition: Researchers are exploring ways to improve face recognition algorithms when dealing with occlusion, such as partial or complete obstruction of the face. They are investigating techniques like selective local non-negative matrix factorization, linear regression, level set method, dictionary learning, sub-classifier fusion, structured sparse error coding, reconstruction-based occlusion elimination, downsampling sparse representation, discriminant information, linear regression-based classification, structured occlusion coding, efficient locality-constrained occlusion coding, nuclear norm based adapted occlusion dictionary learning, sparse regularized nuclear norm based matrix regression, block permutation linear regression classification, structural similarity index measure, principal component analysis, and information reconstruction. These algorithms aim to make face recognition systems more robust and accurate even when the face is partially or fully covered.","da":"Occlusion-aware ansigtsgenkendelse: Forskere undersøger måder at forbedre ansigtsgenkendelsesalgoritmer på, når de håndterer tilsyn, såsom delvis eller fuldstændig obstruktion af ansigtet. De undersøger teknikker som selektiv lokal ikke-negativ matrixfaktorisering, lineær regression, niveau-sæt metode, ordbogslæring, sub-klassifikatorfusion, struktureret sparsom fejlkodning, rekonstruktionsbaseret tilsynsfjernelse, nedskalering sparsom repræsentation, diskriminerende information, lineær regressionsbaseret klassificering, struktureret tilsynskodning, effektiv lokalitetsbegrænset tilsynskodning, atomnorm baseret tilpasset tilsynsordbogslæring, sparsomt reguleret atomnorm baseret matrixregression, blokpermute lineær regressionsklassificering, strukturel lighedsindeksmåling, hovedkomponentanalyse og informationsrekonstruktion. Disse algoritmer sigter mod at gøre ansigtsgenkendelsessystemer mere robuste og nøjagtige, selv når ansigtet er delvist eller helt dækket."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}