{"id":"c3053","number":304,"headline":{"en":"Advanced Load Forecasting","da":"Avanceret prognose af belastning"},"content":{"en":"Advanced Load Forecasting: Researchers have been investigating the effectiveness of various advanced learning algorithms for short-term load forecasting and electric power system problems. These algorithms include neural networks, cosine radial basis function neural networks, self-adaptive radial basis function neural networks, local linear radial basis function neural networks, RBF neural networks with a nonlinear time-varying evolution PSO algorithm, AVCPSO-RBF neural network hybrid optimization algorithm, enhanced radial basis function network, modified radial basis function network, extended normalized radial basis function network, radial-basis-function neural network with a support vector machine model, a novel algorithm integrating RBF and Quantum Particle Swarm Optimization algorithm, SVR-DEKF-RBFNN hybrid algorithm, support vector regression, extreme learning machines, decay RBF neural networks, improves second order, and error correction. These algorithms aim to improve the accuracy of short-term load forecasting and electricity price forecasting in power systems.","da":"Avanceret prognose af belastning: Forskere har undersøgt effektiviteten af forskellige avancerede læringsalgoritmer til kortsigtet belastningsprognose og problemer inden for elektriske kraftsystemer. Disse algoritmer inkluderer neurale netværk, cosinus radiære basisfunktion neurale netværk, selv-adaptive radiære basisfunktion neurale netværk, lokale lineære radiære basisfunktion neurale netværk, RBF neurale netværk med en ikke-lineær tidsvarierende evolution PSO algoritme, AVCPSO-RBF neurale netværk hybridoptimeringsalgoritme, forstærket radiær basisfunktionsnetværk, modificeret radiær basisfunktionsnetværk, udvidet normaliseret radiær basisfunktionsnetværk, radiær basisfunktion neurale netværk med en supportvektormaskine model, en ny algoritme, der integrerer RBF og Quantum Particle Swarm Optimization algoritme, SVR-DEKF-RBFNN hybridalgoritme, supportvektorregression, ekstreme læringsmaskiner, henfaldende RBF neurale netværk, forbedret andenorden og fejlkorrigering. Disse algoritmer sigter mod at forbedre nøjagtigheden af kortsigtet belastningsprognose og elprisprognose i kraftsystemer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}