{"id":"c3090","number":4057,"headline":{"en":"Quantum Algorithms","da":"Kvantumalgoritmer"},"content":{"en":"Quantum Algorithms: Researchers have been investigating the advantages and limitations of various quantum algorithms. One algorithm, called Grover's standard algorithm, has been found to have a scaling advantage compared to classical search algorithms. Another algorithm, similar to Grover's algorithm, converges towards a marked state with a high probability. Adiabatic rotation has been shown to efficiently generate superpositions of quantum states and provide a quadratic speedup for quantum search. However, the scalability of adiabatic quantum algorithms depends on the infrared behavior of the environment. Additionally, the limitations of simple adiabatic quantum algorithms have been identified, such as the requirement for certain eigenspaces. Poor choices for the Hamiltonian can also cause the quantum adiabatic algorithm to fail in finding the minimum. On the other hand, symmetries in adiabatic quantum algorithms can be advantageous for solving NP-complete problems. The relation between accuracy and run time in an adiabatic quantum search has been studied, showing that the algorithmic error decreases exponentially for short times and then decreases polynomially for longer times. However, decoherence caused by coupling to the environment can limit the scalability of adiabatic quantum algorithms. To address this, an adiabatic quantum algorithm can eliminate exponentially small gaps by penalizing pathways to local minima. Modifications to the adiabatic search algorithm have been proposed to reduce control requirements. It has also been shown that adiabatic optimization algorithms do not always succeed in polynomial time, as the eigenvalue gap can be exponentially small even for trivial optimization problems. The impact of coupling to a generic environment on the adiabatic quantum search algorithm has been studied, revealing that the algorithm remains scalable at zero temperature if the noise spectral density decays sufficiently fast at low frequencies. To reduce computational errors in the quantum adiabatic algorithm, researchers have explored the optimal design of the adiabatic path. In some cases, the spectra of adiabatic Hamiltonians can be estimated exactly in polynomial time. Hybrid algorithms that combine adiabatic and quantum-walk searching have been proposed as optimal solutions for quantum search with realistic noise and hardware limitations. Finally, quantum algorithms based on evolution randomization have been developed to solve systems of linear equations. However, non-stoquastic Hamiltonians have been found to have smaller spectral gaps, suggesting they are less useful for quantum adiabatic optimization.","da":"Kvantumalgoritmer: Forskere har undersøgt fordele og begrænsninger ved forskellige kvantumalgoritmer. En algoritme, kaldet Grovers standardalgoritme, har vist sig at have en skaleringsfordel sammenlignet med klassiske søgealgoritmer. En anden algoritme, der ligner Grovers algoritme, konvergerer mod en markeret tilstand med høj sandsynlighed. Adiabatisk rotation har vist sig effektivt at generere superpositioner af kvantetilstande og give en kvadratisk hastighedsforøgelse for kvantumsøgning. Skalerbarheden af adiabatisk kvantumalgoritmer afhænger dog af miljøets infrarøde adfærd. Desuden er begrænsningerne for simple adiabatisk kvantumalgoritmer blevet identificeret, såsom kravet om visse egenrum. Dårlige valg for Hamiltonianen kan også få den kvanteadiabatiske algoritme til at mislykkes i at finde minimumet. På den anden side kan symmetrier i adiabatisk kvantumalgoritmer være fordelagtige til at løse NP-komplette problemer. Forholdet mellem nøjagtighed og køretid i en adiabatisk kvantumsøgning er blevet undersøgt og viser, at den algoritmiske fejl falder eksponentielt for korte tider og derefter falder polynomisk for længere tider. Dekohærens forårsaget af kobling til miljøet kan dog begrænse skalerbarheden af adiabatisk kvantumalgoritmer. For at imødegå dette kan en adiabatisk kvantumalgoritme eliminere eksponentielt små gab ved at straffe veje til lokale minima. Ændringer i den adiabatisk søgealgoritme er blevet foreslået for at reducere kontrolkravene. Det er også vist, at adiabatisk optimeringsalgoritmer ikke altid lykkes i polynomiel tid, da egenværdigabet kan være eksponentielt små, selv for trivielle optimeringsproblemer. Indflydelsen af kobling til et generisk miljø på den adiabatisk kvantumsøgningsalgoritme er blevet undersøgt og afslører, at algoritmen forbliver skalerbar ved nul temperatur, hvis støjspektraltætheden falder tilstrækkeligt hurtigt ved lave frekvenser. For at reducere beregningsfejl i den kvanteadiabatiske algoritme har forskere undersøgt det optimale design af den adiabatiske bane. I nogle tilfælde kan spektrene af adiabatiske Hamiltonianer estimeres præcist i polynomiel tid. Hybridalgoritmer, der kombinerer adiabatisk og quantum-walk-søgning, er blevet foreslået som optimale løsninger til kvantumsøgning med realistisk støj og hardwarebegrænsninger. Endelig er kvantumalgoritmer baseret på evolution randomisering blevet udviklet til at løse systemer af lineære ligninger. Dog er ikke-stokastiske Hamiltonianer fundet at have mindre spektralgab, hvilket tyder på, at de er mindre nyttige til adiabatisk kvantumoptimering."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}