{"id":"c3215","number":2452,"headline":{"en":"Diabetes risk algorithms","da":"Diabetes risikoberegninger"},"content":{"en":"Diabetes risk algorithms: Algorithms are being used to improve the detection of individuals at risk of complications from diabetes, develop a rational approach to screening and assigning risk for type 2 diabetes, and identify diabetes in patients with acute coronary syndrome. Decision trees are also being used as a simple and reliable tool for identifying individuals with impaired glucose metabolism or type 2 diabetes. Algorithms can be used to develop risk scores for screening undiagnosed diabetes in different populations, define A1C cut points for glucose intolerance in Asian Indians, and predict dysglycaemia in patients under investigation for acute coronary syndrome. However, HbA1c measurement alone is not enough for the diagnosis of diabetes. Algorithms can also be used to develop two-stage diabetes risk algorithms, nonlaboratory-based risk assessment algorithms, and risk score models for identifying postprandial hyperglycemia and undiagnosed diabetes mellitus. These algorithms can be used to detect undiagnosed diabetes mellitus and identify individuals at risk of developing impaired glucose metabolism or type 2 diabetes in different populations.","da":"Diabetes risikoberegninger: Algoritmer bruges til at forbedre påvisningen af individer, der er i risiko for komplikationer ved diabetes, udvikle en rationel tilgang til screening og tildeling af risiko for type 2 diabetes samt identificere diabetes hos patienter med akut koronar syndrom. Beslutningstræer anvendes også som et enkelt og pålideligt værktøj til at identificere individer med nedsat glukosemetabolisme eller type 2 diabetes. Algoritmer kan bruges til at udvikle risikoscorer til screening for udiagnosticeret diabetes i forskellige befolkningsgrupper, definere A1C grænseværdier for glukoseintolerance hos asiatiske indere og forudsige dysglykæmi hos patienter, der undersøges for akut koronar syndrom. Imidlertid er måling af HbA1c alene ikke tilstrækkelig til diagnosen af diabetes. Algoritmer kan også bruges til at udvikle to-trins diabetes risikoberegninger, ikke-laboratoriebaserede risikovurderingsalgoritmer og risikoscoremodeller til at identificere postprandial hyperglykæmi og udiagnosticeret diabetes mellitus. Disse algoritmer kan anvendes til at opdage udiagnosticeret diabetes mellitus og identificere individer i risiko for at udvikle nedsat glukosemetabolisme eller type 2 diabetes i forskellige befolkningsgrupper."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}