{"id":"c3239","number":3912,"headline":{"en":"Modular robot reconfiguration","da":"Modulær robotre-konfiguration"},"content":{"en":"Modular robot reconfiguration: Researchers are exploring various algorithms to address the challenges of self-reconfiguration in modular robots. Graph theory algorithms are used to find the best routes for reconfiguration in self-reconfigurable robots. Novel algorithms involving atom operations and parallel steps are proposed for efficient constant-velocity reconfiguration of crystalline robots. Improved upper bounds on reconfiguration times are established using graph theory algorithms for lattice-based modular robots. A distributed algorithm based on local rules and a sliding-cube model is proposed for achieving universal reconfiguration of 2D lattice-based modular robotic systems. Cellular automata and L-systems are combined to handle motion planning and generate global configurations for self-reconfiguration of modular robots. L-systems and cellular automata are also combined for decentralized motion planning and convergence to predefined targets in modular robots. Researchers have proposed a novel algorithm for efficient reconfiguration planning in self-reconfigurable modular robots. A methodology based on a cubic lattice, fixed and mobile modules, and a distributed maximum flow search algorithm is proposed for effective shape shifting and locomotion of massively-modular robotic structures. Heuristic algorithms are proposed for optimizing the distribution of active and passive modules in reconfiguration planning of modular robots. A distributed and deterministic method is proposed for achieving deterministic scaffold assembly using self-reconfiguring micro-robotic swarms. Researchers have also proposed innovative designs and optimized algorithms for studying modular robot configuration design and self-reconfiguration processes. Various algorithms, such as reconfiguration algorithms based on extended binary trees and successive construction of the goal configuration, sliding Triangular Lattice Modular Robot (STRIMOR) and Rapidly-exploring random tree (RRT*) algorithm, are proposed for solving the self-reconfiguration task in lattice modular robots. Tree-based size-constrained clustering algorithms and robust cluster-based planning algorithms are proposed for achieving size-constrained clustering and fast self-reconfiguration in modular robot-based programmable matter.","da":"Modulær robotre-konfiguration: Forskere undersøger forskellige algoritmer for at tackle udfordringerne ved selv-rekonfiguration i modulære robotter. Grafteori-algoritmer anvendes til at finde de bedste ruter for rekonfiguration i selv-rekonfigurerbare robotter. Nye algoritmer, der involverer atomoperationer og parallelle trin, foreslås for effektiv konstant-hastighedsre-konfiguration af krystallinske robotter. Forbedrede øvre grænser for rekonfigurationstider er etableret ved hjælp af grafteori-algoritmer for modulære robotter baseret på gitter. En distribueret algoritme baseret på lokale regler og en glidende-kubemodel foreslås for at opnå universel rekonfiguration af 2D gitter-baserede modulære robotsystemer. Celleautomater og L-systemer kombineres for at håndtere bevægelsesplanlægning og generere globale konfigurationer til selv-rekonfiguration af modulære robotter. L-systemer og celleautomater kombineres også for decentraliseret bevægelsesplanlægning og konvergens til foruddefinerede mål i modulære robotter. Forskere har foreslået en ny algoritme til effektiv rekonfigurationsplanlægning i selv-rekonfigurerbare modulære robotter. En metodologi baseret på et kubisk gitter, faste og mobile moduler, og en distribueret maksimal flow-søgningsalgoritme foreslås for effektiv formskiftning og bevægelse af massiv-modulære robotstrukturer. Heuristiske algoritmer foreslås til optimering af fordelingen af aktive og passive moduler i rekonfigurationsplanlægning af modulære robotter. En distribueret og deterministisk metode foreslås for at opnå determineret stillads-samling ved brug af selv-rekonfigurerende mikro-robot-sværme. Forskere har også foreslået innovative designs og optimerede algoritmer til at studere modulær robotkonfigurationsdesign og selv-rekonfigurationsprocesser. Forskellige algoritmer, såsom rekonfigurationsalgoritmer baseret på udvidede binære træer og successiv konstruktion af målkonfigurationen, glidende Triangular Lattice Modular Robot (STRIMOR) og Rapidly-exploring random tree (RRT*) algoritme, foreslås til løsning af selv-rekonfigurationsopgaven i gittermodulære robotter. Træbaserede størrelsesbegrænsede klyngealgoritmer og robuste klyngebaserede planlægningsalgoritmer foreslås for at opnå størrelsesbegrænset klyngedannelse og hurtig selv-rekonfiguration i modulære robot-baserede programmerbare stoffer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}