{"id":"c3322","number":2029,"headline":{"en":"Cell segmentation","da":"Celle segmentation"},"content":{"en":"Cell segmentation: Researchers have been exploring the use of various algorithms to accurately segment white blood cells in microscopic blood images. These algorithms include digital image processing techniques, stepwise merging rules and gradient vector flow snake algorithms, adaptive threshold detector algorithm, multiscale analysis algorithms, modified level set algorithm, color and shape based algorithm, mean shift clustering, color space conversion, and nucleus mark watershed operation algorithms, dual-threshold method based on RGB and HSV color space, combination of k-means clustering and modified watershed algorithm, adaptive location and iteration algorithms, histogram based automatic thresholding algorithm, sparsity and geometry constraints algorithms, ϵ-SVR-based detection method, modified K-means clustering algorithm and seed filling technique, adaptive histogram thresholding and contour detection algorithms, and threshold estimation based on local minima algorithm. These algorithms aim to accurately segment white blood cells and their nuclei and cytoplasm, which can be useful for measuring morphological blood cell parameters and detecting cancer affected white blood cells.","da":"Celle segmentation: Forskere har undersøgt brugen af forskellige algoritmer til præcist at segmentere hvide blodlegemer i mikroskopiske blodbilleder. Disse algoritmer omfatter digitale billedbehandlingsteknikker, trinvise sammensmeltning regler og gradientvektorflydeslanger algoritmer, adaptiv tærskel detektor algoritme, multiskala analyse algoritmer, modificeret niveau set algoritme, farve- og formbaseret algoritme, mean shift clustering, farverumskonvertering og kerne mark vandskel operation algoritmer, dual-tærskel metode baseret på RGB og HSV farverum, kombination af k-means clustering og modificeret vandskel algoritme, adaptiv lokalisering og iterations algoritmer, histogram baseret automatisk tærskling algoritme, sparsitet og geometri begrænsninger algoritmer, ϵ-SVR-baseret detektion metode, modificeret K-means clustering algoritme og frøfyldning teknik, adaptiv histogram tærskling og kontur detektion algoritmer, og tærskel estimering baseret på lokale minima algoritme. Disse algoritmer sigter mod præcist at segmentere hvide blodlegemer og deres kerner og cytoplasma, hvilket kan være nyttigt til at måle morfologiske blodcelleparametre og opdage kræftramte hvide blodlegemer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}