{"id":"c3386","number":2539,"headline":{"en":"Violence risk assessment","da":"Vurdering af voldelig adfærd"},"content":{"en":"Violence risk assessment: Researchers have been investigating the use of various algorithms to assess and predict violence risk in different contexts. These algorithms include the Iterative Classification Tree method, Classification and Regression Tree approach, LSI-R, HCR-20, PCL-R, ODARA, Hare Psychopathy Checklist (PCL-R), Danger Assessment (DA), Classification of Violence Risk (COVR), Receiver Operating Characteristic (ROC) analysis, Bayesian networks, Fordham Risk Screening Tool (FRST), Domestic Abuse, Stalking and Honour Based Violence (DASH) form, Minnesota Sex Offender Screening Tool–4 (MnSOST-4), unsupervised machine learning, VPR5.0-H tool, machine learning algorithms, Violence Risk Scale (VRS), and novel and scalable risk assessment tools (OxRIS). These algorithms aim to improve the accuracy and effectiveness of violence risk assessment and decision-making in various settings, such as forensic psychiatry, civil psychiatric settings, and cases of intimate partner violence.","da":"Vurdering af voldelig adfærd: Forskere har undersøgt brugen af forskellige algoritmer til at vurdere og forudsige risikoen for vold i forskellige sammenhænge. Disse algoritmer inkluderer Iterative Classification Tree-metoden, Classification and Regression Tree-tilgangen, LSI-R, HCR-20, PCL-R, ODARA, Hare Psychopathy Checklist (PCL-R), Danger Assessment (DA), Classification of Violence Risk (COVR), Receiver Operating Characteristic (ROC) analyse, Bayesian netværk, Fordham Risk Screening Tool (FRST), Domestic Abuse, Stalking and Honour Based Violence (DASH) formularen, Minnesota Sex Offender Screening Tool–4 (MnSOST-4), usupervised machine learning, VPR5.0-H værktøj, machine learning algoritmer, Violence Risk Scale (VRS), og nye og skalerbare risikovurderingsværktøjer (OxRIS). Disse algoritmer har til formål at forbedre nøjagtigheden og effektiviteten af vurderingen af voldelig adfærd og beslutningstagningen i forskellige miljøer, såsom retspsykiatri, civile psykiatriske sammenhænge og sager med partnervold."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}