{"id":"c3387","number":3883,"headline":{"en":"Ethics of AVs","da":"Etik for selvkørende biler"},"content":{"en":"Ethics of AVs: Participants in studies perceive autonomous vehicles (AVs) to make moral decisions, with a preference for AVs that prioritize the safety of their passengers. The separation of technology and ethics is seen as crucial for the development of AVs. However, algorithmic decision-making in AVs can introduce safety risks and perpetuate discrimination. Ethical and political conversations have not kept up with the rapid development of AI and autonomous systems technologies. Self-driving cars have the potential to make driving safer and more enjoyable, but there are challenges in framing machine driving decisions and decision ethics for AVs. The acceptance of AI in AVs is influenced by the state of mind variable, whether AI should learn from personal morals or societal ethics. The industry prioritizes safety and cybersecurity in the development of autonomous driving technologies. Professional drivers express concerns about safety, reskilling, and the impact of AVs on their livelihoods. Legal systems in Singapore, France, and the UK have models to address criminal liability for AI misbehavior in AVs.","da":"Etik for selvkørende biler: Deltagere i undersøgelser opfatter autonome køretøjer (AVs) som værende i stand til at træffe moralske beslutninger, med en præference for AVs, der prioriterer deres passagerers sikkerhed. Adskillelsen af teknologi og etik anses som afgørende for udviklingen af AVs. Dog kan algoritmebaserede beslutninger i AVs introducere sikkerhedsrisici og udbrede diskrimination. Etiske og politiske samtaler har ikke fulgt med den hurtige udvikling af AI- og autonome systemteknologier. Selvstyrende biler har potentialet til at gøre kørsel sikrere og mere fornøjelig, men der er udfordringer med at indramme maskinens kørebeslutninger og beslutningsetik for AVs. Accepten af AI i AVs påvirkes af sindstilstandsvariabelen, om AI skal lære af personlige moral eller samfundsetik. Branchen prioriterer sikkerhed og cybersikkerhed i udviklingen af teknologier til autonom kørsel. Professionelle chauffører udtrykker bekymringer om sikkerhed, omskoling og AVs indvirkning på deres levebrød. Retssystemer i Singapore, Frankrig og Storbritannien har modeller til at håndtere strafferetligt ansvar for AI's fejl i AVs."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}