{"id":"c354","number":1512,"headline":{"en":"Biometric recognition","da":"Biometrisk genkendelse"},"content":{"en":"Biometric recognition: Researchers are exploring ways to improve person's identity recognition using a combination of physical and behavioral biometrics. They are using algorithms such as LDA, Multilayer Perceptron, MLP, LVQ, RBF, Convolutional Neural Networks (CNNs), Softmax, Random Forest (RF), Artificial Neural Network, Gabor filter, LBP, Histograms of Oriented Gradients (HOG), Deep Learning Neural Network, Deep Learning Convolutional Neural Network (DLCNN), Improved Principal Component Analysis (IPCA), ORB algorithm, k-nearest neighbors (KNN), Viola Jones algorithm, Transfer Learning Convolutional Neural Network (TL-CNN), Modified Lion Optimization Algorithm (MLOA), Machine Learning (ML) algorithms, and Ranking-based Deep Convolution Neural Network (RDCNN) to achieve this goal. These algorithms are being used to detect and recognize multi-view face images, improve multimodal biometric recognition using iris, face, and finger vein traits, enhance multimodal biometric identification, improve fingerprint and signature recognition, enhance a robust multimodal biometric system, improve person verification, improve biometric identification, enhance personal identification using visible light communication, and improve human identification.","da":"Biometrisk genkendelse: Forskere udforsker måder at forbedre en persons identitetsgenkendelse ved hjælp af en kombination af fysiske og adfærdsmæssige biometriske data. De bruger algoritmer som LDA, Multilayer Perceptron, MLP, LVQ, RBF, Convolutional Neural Networks (CNNs), Softmax, Random Forest (RF), Artificial Neural Network, Gabor filter, LBP, Histograms of Oriented Gradients (HOG), Deep Learning Neural Network, Deep Learning Convolutional Neural Network (DLCNN), Improved Principal Component Analysis (IPCA), ORB algoritme, k-nearest neighbors (KNN), Viola Jones algoritme, Transfer Learning Convolutional Neural Network (TL-CNN), Modified Lion Optimization Algorithm (MLOA), Machine Learning (ML) algoritmer, og Ranking-based Deep Convolution Neural Network (RDCNN) for at opnå dette mål. Disse algoritmer bruges til at detektere og genkende multivisningsansigtsbilleder, forbedre multimodal biometrisk genkendelse ved hjælp af iris, ansigt og fingeråretræk, forbedre multimodal biometrisk identifikation, forbedre fingeraftryk og signaturgenkendelse, forbedre et robust multimodalt biometrisk system, forbedre personverifikation, forbedre biometrisk identifikation, forbedre personlig identifikation ved hjælp af synligt lys kommunikation, og forbedre menneskelig identifikation."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}