{"id":"c3660","number":1327,"headline":{"en":"Visual Tracking Advancements","da":"Fremskridt inden for visuel sporing"},"content":{"en":"Visual Tracking Advancements: Researchers have been exploring various ways to improve the accuracy and robustness of visual tracking algorithms. They have investigated the use of collaboration between generative and discriminative models, single convolutional neural networks, deep architectures, convolutional features selection, deep convolutional neural networks combined with kernelized correlation filters, dual model learning, fully convolutional networks with multi-layer feature fusion, spatial-temporal context hierarchical response fusion, dense connection based networks, deep feature fusion, long-short term multi-model based tracking methods, Siamese visual tracking with deep features, improved hierarchical convolutional features, mutual learning between cohort multiscale feature-fusion networks, residual networks, Siamese trackers based on deep features, Siamese networks with depthwise overparameterized convolutional layers, learning enhanced feature responses, and noise-suppressing algorithms. These algorithms aim to enhance the precision, accuracy, and robustness of visual object tracking.","da":"Fremskridt inden for visuel sporing: Forskere har udforsket forskellige måder at forbedre nøjagtigheden og robustheden af visuelle sporingsalgoritmer. De har undersøgt brugen af samarbejde mellem generative og diskriminerende modeller, enkelte konvolutionelle neurale netværk, dybe arkitekturer, valg af konvolutionelle funktioner, dybe konvolutionelle neurale netværk kombineret med kerneliserede korrelationsfiltre, dobbelt modellæring, fuldt konvolutionelle netværk med multi-lag funktionfusions, rum-tid kontekst hierarkisk svarfusion, tætte forbindelsesbaserede netværk, dyb funktionfusion, langsigtede og kortsigtede multi-model baserede sporingsmetoder, Siamesisk visuel sporing med dybe funktioner, forbedrede hierarkiske konvolutionelle funktioner, gensidig læring mellem kohorte multiskala funktion-fusions netværk, residualnetværk, Siamesiske trackere baseret på dybe funktioner, Siamesiske netværk med dybdeoptimerede konvolutionelle lag, læring af forbedrede funktionresponser og støjundertrykkende algoritmer. Disse algoritmer sigter mod at forbedre præcisionen, nøjagtigheden og robustheden af visuel objektsporing."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}