{"id":"c3706","number":2905,"headline":{"en":"Machine Translation","da":"Maskinoversættelse"},"content":{"en":"Machine Translation: Researchers have explored various aspects of machine translation and its impact on the translation industry. They have investigated how translation students perceive and use machine translation, its effectiveness in legal translation, and its potential for aiding translators through automatic translation programs and dictionaries. Additionally, studies have examined the attitudes and actions of end-users towards machine translation, the incorporation of machine translation literacy into information literacy instruction, and the role of translation technology in enhancing multilingualism and inclusivity in higher education. Ethical issues in translator training programs and the sustainability of translator training in the era of machine translation have also been addressed. Furthermore, researchers have explored the use of machine translation tools in foreign language education, the variations in professional translators' research activities, and the utopian and dystopian visions of artificial intelligence and machine translation. The integration of applied translation in language education to promote critical thinking and digital literacy, as well as EFL students' perceptions and practices of machine translation, have also been investigated.","da":"Maskinoversættelse: Forskere har udforsket forskellige aspekter af maskinoversættelse og dens indvirkning på oversættelsesbranchen. De har undersøgt, hvordan oversættelsesstuderende opfatter og bruger maskinoversættelse, dens effektivitet i juridisk oversættelse og dens potentiale for at hjælpe oversættere gennem automatiske oversættelsesprogrammer og ordbøger. Derudover har studier undersøgt slutbrugernes holdninger og handlinger over for maskinoversættelse, inddragelsen af maskinoversættelseskompetence i informationskompetenceundervisning og oversættelsesteknologiens rolle i at fremme flersprogethed og inklusivitet i videregående uddannelse. Etiske spørgsmål i oversætteruddannelsesprogrammer og oversætteruddannelsens bæredygtighed i maskinoversættelsens tidsalder er også blevet behandlet. Endvidere har forskere udforsket brugen af maskinoversættelsesværktøjer i fremmedsprogsundervisning, variationer i professionelle oversætteres forskningsaktiviteter og de utopiske og dystopiske visioner om kunstig intelligens og maskinoversættelse. Integration af anvendt oversættelse i sprogundervisning for at fremme kritisk tænkning og digital dannelse, samt EFL-studerendes opfattelser og praksis med maskinoversættelse, er også blevet undersøgt."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}