{"id":"c3751","number":1839,"headline":{"en":"Proton CT advancements","da":"Fremskridt inden for proton-CT"},"content":{"en":"Proton CT advancements: Researchers are using algorithms to improve the accuracy and efficiency of proton CT image reconstruction, overcome the problem of limited range in proton CT, implement sparse-view proton CT using modulated proton beams, and improve the spatial resolution of proton radiography. They are also optimizing the proton CT detector system and image reconstruction algorithm for on-line proton therapy, determining patient-specific stopping power using proton radiography and x-ray CT, and optimizing the relative stopping power in proton radiography. Additionally, algorithms are being used to implement scattering proton CT as an alternative to energy-loss proton CT, apply the TIGRE software framework for proton CT image reconstruction, perform data acquisition and preprocessing for particle-tracking proton CT, estimate the most likely path in proton CT, and investigate the impact of path estimates on iterative ion CT reconstructions. Recent developments in mathematical algorithms and computational tools for proton CT and particle therapy treatment planning are also being summarized. The TIGRE toolbox is being extended for proton imaging, and a new imaging mode based on X-ray CT and sparsely sampled projections is being proposed for rapid clinical proton CT. Finally, algorithms are being used to improve stopping-power ratio estimation using dual-energy CT and prior-image constrained denoising.","da":"Fremskridt inden for proton-CT: Forskere bruger algoritmer til at forbedre nøjagtigheden og effektiviteten af proton-CT-billedrekonstruktion, overvinde problemet med begrænset rækkevidde i proton-CT, implementere sparse-view proton-CT ved hjælp af modulerede protonstråler og forbedre den rumlige opløsning i protonradiografi. De optimerer også proton-CT-detektorsystemet og billedrekonstruktionsalgoritmen til online protonterapi, fastlægger patient-specifik stoppestyrke ved hjælp af protonradiografi og røntgen-CT, og optimerer den relative stoppestyrke i protonradiografi. Derudover bruges algoritmer til at implementere spredningsproton-CT som et alternativ til energitab-proton-CT, anvende TIGRE-softwareframework til proton-CT-billedrekonstruktion, udføre dataindsamling og forbehandling til partikelsporing proton-CT, estimere den mest sandsynlige bane i proton-CT, og undersøge betydningen af baneestimater på iterative ion-CT-rekonstruktioner. Nylige udviklinger inden for matematiske algoritmer og computerværktøjer til proton-CT og partikelterapibehandlingsplanlægning bliver også opsummeret. TIGRE-værktøjskassen udvides til protonafbildning, og en ny billeddannelsestilstand baseret på røntgen-CT og sparsomt samplede projektioner foreslås til hurtig klinisk proton-CT. Endelig bruges algoritmer til at forbedre estimering af stoppestyrkeforhold ved brug af to-energien-CT og støjreduktion ved hjælp af forudgående billeder."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}