{"id":"c3763","number":1667,"headline":{"en":"Automation in Cell Biology","da":"Automatisering i cellebiologi"},"content":{"en":"Automation in Cell Biology: Scientists are exploring ways to automate various tasks in the field of cell biology using algorithms. These tasks include counting dots in cell nuclei, removing bias in dot counting errors, validating and correcting automated spot counting, detecting chromosomal rearrangements, analyzing gene copy numbers, automating distance analysis, improving color karyotyping, evaluating Her-2/neu status in breast tissue, increasing dot-counting efficiency, segmenting nuclei in microscopy images, quantifying FISH signals, analyzing FISH images, automating FISH signal analysis using projection images, segmenting and detecting fluorescent 3D spots, detecting cell nuclei in microscopy images, improving nuclei segmentation in FISH images, and quantitatively analyzing fluorescence in situ hybridization. These algorithms aim to make these tasks more efficient and accurate.","da":"Automatisering i cellebiologi: Forskere undersøger måder at automatisere forskellige opgaver inden for cellebiologi ved hjælp af algoritmer. Disse opgaver inkluderer at tælle prikker i cellekerner, fjerne bias i fejlagtige prikoptællinger, validere og korrigere automatiseret prikoptælling, detektere kromosomale omarrangementer, analysere genkopital, automatisere afstandsanalyse, forbedre farvekaryotyping, evaluere Her-2/neu status i brystvæv, øge effektiviteten af prikoptælling, segmentere kerner i mikroskopibilleder, kvantificere FISH-signaler, analysere FISH-billeder, automatisere FISH-signalanalyse ved hjælp af projektion billeder, segmentere og detektere fluorescerende 3D-prikker, detektere cellekerner i mikroskopibilleder, forbedre kernesegmentering i FISH-billeder og kvantitativt analysere fluorescens in situ hybridisering. Disse algoritmer sigter mod at gøre disse opgaver mere effektive og nøjagtige."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}