{"id":"c3761","number":3059,"headline":{"en":"Hardware optimization","da":"Hardwareoptimering"},"content":{"en":"Hardware optimization: Algorithms play a crucial role in various research questions related to hardware and software optimization. They are used to accelerate computationally complex algorithms on FPGAs, optimize heterogeneous computing tools, improve FPGA performance, generate hardware implementations from software descriptions, explore many-core design templates, evaluate performance and energy trade-offs on different hardware architectures, analyze power efficiency on heterogeneous platforms, automate the design and synthesis of control-dominant circuits, implement the OpenCL standard on FPGAs, optimize sliding-window applications, design function-level processors for streaming applications, analyze the suitability of FPGAs for high-performance computing, generate efficient parallel implementations for image processing, integrate FPGAs into common computing platforms, achieve portable programming, compose task-based parallel reconfigurable computing systems, and optimize hardware acceleration for embedded image processing.","da":"Hardwareoptimering: Algoritmer spiller en afgørende rolle i forskellige forskningsspørgsmål relateret til hardware- og softwareoptimering. De bruges til at accelerere beregningsmæssigt komplekse algoritmer på FPGAs, optimere heterogene computerværktøjer, forbedre FPGA-ydelse, generere hardwareimplementeringer fra softwarebeskrivelser, udforske mange-core designtemplates, evaluere ydeevne og energibalancer på forskellige hardwarearkitekturer, analysere energieffektivitet på heterogene platforme, automatisere design og syntese af kontrol-dominerede kredsløb, implementere OpenCL-standarden på FPGAs, optimere sliding-window applikationer, designe funktionelle processorer til streaming-applikationer, analysere egnetheden af FPGAs til højtydende computing, generere effektive parallelle implementeringer til billedbehandling, integrere FPGAs i almindelige computerplatforme, opnå bærbar programmering, sammensætte opgavebaserede parallelle re-konfigurerbare systemer og optimere hardwareacceleration til indlejret billedbehandling."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}