{"id":"c3771","number":1320,"headline":{"en":"Video compression algorithms","da":"Videokompressionsalgoritmer"},"content":{"en":"Video compression algorithms: Researchers are exploring various algorithms to improve the reconstruction of compressed videos. These algorithms are used to reconstruct the video signal, perform random measurement and coding, allocate dynamic measurement rate, classify blocks, determine the number of required measurements, construct undersampled correlation noise models, divide video frames into groups, estimate frames containing dominant structure, perform sparse representation, exploit inter-signal correlations, achieve joint optimization of sparse representation and signal reconstruction, divide the video into hierarchical frames, enhance reconstruction quality iteratively, achieve desired signal sparsity, learn adaptive basis from inter-frame differences, formulate adaptive sampling schemes, design new measurement matrices, and exploit HEVC motion estimation. These algorithms aim to reduce the sampling rate while maintaining video quality and improve the rate-distortion performance of distributed video compressive sensing.","da":"Videokompressionsalgoritmer: Forskere undersøger forskellige algoritmer for at forbedre rekonstruktionen af komprimerede videoer. Disse algoritmer bruges til at rekonstruere videosignalet, udføre tilfældig måling og kodning, tildele dynamisk målingsrate, klassificere blokke, bestemme antallet af nødvendige målinger, konstruere undersamplede korrelationsstøjsmodeller, opdele videorammer i grupper, estimere rammer indeholdende dominerende strukturer, udføre sparsom repræsentation, udnytte inter-signal korrelationer, opnå fælles optimering af sparsom repræsentation og signalrekonstruktion, opdele videoen i hierarkiske rammer, forbedre rekonstruktionskvaliteten iterativt, opnå ønsket signal sparsitet, lære adaptive baser fra forskelle mellem rammer, formulere adaptive prøveudtagningsskemaer, designe nye målingsmatricer og udnytte HEVC bevægelsesestimation. Disse algoritmer har til formål at reducere prøveudtagningsraten samtidig med at videoens kvalitet opretholdes og forbedre forholdet mellem rate og forvrængning i distribueret videokompressiv sensing."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}