{"id":"c3890","number":378,"headline":{"en":"Power system optimization","da":"Optimering af elsystemer"},"content":{"en":"Power system optimization: Researchers have been exploring ways to improve power system planning and operation by using algorithms. These algorithms are being developed to address various research questions, such as improving outage studies, solving automatic contingency selection, determining correctability of voltage violations, processing large sets of candidate contingencies, optimizing selection of weights and performance indices, evaluating and ranking contingencies, performing fast contingency evaluation, computing system line power flow changes, evaluating the effectiveness of automatic contingency selection algorithms, solving parametrized contingency-constrained optimal power flow, performing power system steady-state contingency analysis, ranking line outage contingencies based on voltage stability, detecting power-flow unfeasibility, and determining double outage contingencies threatening the system. These algorithms aim to enhance the efficiency, accuracy, and security of power systems.","da":"Optimering af elsystemer: Forskere har undersøgt måder at forbedre planlægning og drift af elsystemer ved hjælp af algoritmer. Disse algoritmer udvikles for at besvare forskellige forskningsspørgsmål, såsom at forbedre udfaldsundersøgelser, løse automatisk kontingentvalg, bestemme korrektering af spændingskrænkelser, behandle store sæt af kandidatkontingenter, optimere valg af vægte og præstationsindekser, evaluere og rangere kontingenter, udføre hurtig kontingentevaluering, beregne ændringer i systemets linjestrømning, evaluere effektiviteten af automatiske kontingentvalg-algoritmer, løse parametriseret kontingentbegrænset optimal strømflytning, udføre elsystemers steady-state kontingenteanalyse, rangere linjeudfaldskontingenter baseret på spændingsstabilitet, opdage inhabileret strømflytning og bestemme dobbeltudfalds-kontingenter, der truer systemet. Disse algoritmer sigter mod at forbedre effektiviteten, nøjagtigheden og sikkerheden af elsystemer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}