{"id":"c3904","number":307,"headline":{"en":"Transmission Optimization","da":"Transmissionsoptimering"},"content":{"en":"Transmission Optimization: Researchers have been investigating various aspects of dual clutch transmissions and how algorithms can improve their performance. They have explored the transmission kinematics and dynamics, coordinated control between the engine and clutch, shifting time and torque control, clutch pressure control, torque estimation during mode-switch, shift quality improvement, mode transition control, clutch engagement control, torque adaptation during launch, clutch fill control, clutch actuator control, driveline oscillation reduction, micro-slip control, torque estimation using a robust observer, design and control of two-speed clutchless automatic transmission for electric vehicles, starting performance improvement for hybrid electric vehicles, and shift quality improvement. These studies highlight the role of algorithms in optimizing the functioning of dual clutch transmissions and enhancing the overall driving experience.","da":"Transmissionsoptimering: Forskere har undersøgt forskellige aspekter af dobbeltkoblingsgearkasser og hvordan algoritmer kan forbedre deres ydeevne. De har udforsket transmissionens kinematik og dynamik, koordineret styring mellem motor og kobling, skiftetid og momentstyring, koblings trykstyring, momentestimering under mode-skift, forbedring af skiftekvalitet, modeovergangsstyring, koblingsindgrebsstyring, momenttilpasning under start, koblingsfyldningskontrol, koblingsaktuatorstyring, reduktion af drivlinjeoscillationer, mikroslipkontrol, momentestimering ved brug af en robust observatør, design og styring af totrins koblingsløse automatiske transmissioner til elbiler, forbedring af startydelse for hybridelbiler, og forbedring af skiftekvalitet. Disse studier fremhæver algoritmers rolle i optimeringen af dobbeltkoblingsgearkassers funktion og forbedring af den samlede køreoplevelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}