{"id":"c3940","number":3434,"headline":{"en":"Stable marriage algorithms","da":"Stabile ægteskabsalgoritmer"},"content":{"en":"Stable marriage algorithms: Researchers have been exploring various aspects of the stable marriage problem and developing algorithms to efficiently find stable marriages. They have investigated the lower bounds for determining stability, fast algorithms other than the Gale-Shapley algorithm, extensions of the problem with forced and forbidden pairs, and optimal stable matching in the many-to-many version. Additionally, they have looked into exchange-stable matching, generalized stable marriage and roommates problems, stable matching with multiple partners, improved approximation results, variants with master preference lists, additional constraints, parameterized complexity and local search approaches, maximum cardinality matching, and jointly stable matchings. These studies have contributed to our understanding of the structure, complexity, and solvability of stable matchings with restricted preferences.","da":"Stabile ægteskabsalgoritmer: Forskere har undersøgt forskellige aspekter af det stabile ægteskabsproblem og udviklet algoritmer til effektivt at finde stabile ægteskaber. De har undersøgt de nedre grænser for at bestemme stabilitet, hurtige algoritmer udover Gale-Shapley-algoritmen, udvidelser af problemet med tvungne og forbudte par, og optimal stabil matching i mange-til-mange versionen. Derudover har de set på exchange-stabil matching, generaliserede stabile ægteskabs- og værelseskammeratsproblemer, stabile matchninger med flere partnere, forbedrede tilnærmelsesresultater, varianter med master præferencelister, yderligere begrænsninger, parameteriseret kompleksitet og lokale søgemetoder, maksimum kardinalitetsmatchning og fælles stabile matchninger. Disse studier har bidraget til vores forståelse af strukturen, kompleksiteten og løsbarheden af stabile matchninger med begrænsede præferencer."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}