{"id":"c4128","number":1130,"headline":{"en":"Scattering algorithms","da":"Spredningsalgoritmer"},"content":{"en":"Scattering algorithms: Scientists have developed various algorithms to solve complex problems in the field of electromagnetic and acoustic scattering. These algorithms are used to reconstruct the shape and impedance of obstacles, solve direct and inverse scattering problems, and determine the support and shape of obstacles from scattered field measurements. The algorithms employ techniques such as the Herglotz function method, shape deformation, Helmholtz's equations, linear Fredholm integral equations, regularization algorithms, linear sampling method, stationary waves, orthogonality sampling algorithm, least-squares method, recursive linearization algorithm, iteratively regularized Gauß-Newton method, transformed field expansion, nonlinear correction algorithm, factorization method, Improved Maximum Product Criterion, Kirsch-Kress method, system of nonlinear boundary integral equations, iteratively regularized Newton-type method, accelerated level-set method, and hybrid methods. These algorithms play a crucial role in advancing our understanding of scattering phenomena and have practical applications in fields such as acoustics and elasticity.","da":"Spredningsalgoritmer: Forskere har udviklet forskellige algoritmer til at løse komplekse problemer inden for elektromagnetisk og akustisk spredning. Disse algoritmer bruges til at rekonstruere formen og impedansen af forhindringer, løse direkte og inverse spredningsproblemer, og bestemme støtten og formen af forhindringer ud fra målinger af spredte felter. Algoritmerne anvender teknikker som Herglotz funktionsmetode, deformering af form, Helmholtz' ligninger, lineære Fredholm integral ligninger, regulariseringsalgoritmer, lineær prøvetagningsmetode, stationære bølger, ortogonalitetsprøvealgoritme, mindst-kvadraters metode, rekursiv digitaliseringsalgoritme, iterativt reguleret Gauß-Newton metode, transformeret feltekspansion, ikke-lineær korrektion algoritme, faktorisationsmetode, Forbedret Maximum Product Criterion, Kirsch-Kress metode, system af ikke-lineære randbetingelsesintegralligninger, iterativt reguleret Newton-type metode, accelereret niveau-sæt metode, og hybridmetoder. Disse algoritmer spiller en afgørende rolle i at fremme vores forståelse af spredningsfænomener og har praktiske anvendelser inden for områder som akustik og elasticitet."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}