{"id":"c444","number":2910,"headline":{"en":"Entity Extraction","da":"Enheds-ekstraktion"},"content":{"en":"Entity Extraction: Researchers are using algorithms to automatically build silver-standard NER corpora from Chinese Wikipedia, extract entities and relations from text using ontology and inductive logic programming, and improve Chinese entity attribute extraction using bidirectional LSTM networks. They are also using algorithms based on DQN, knowledge graph, and BERT for named entity and relation extraction, and the bidirectional maximum entropy Markov model for Chinese entity relationship extraction. Additionally, algorithms are being used for named entity recognition and relation extraction in a structured way, relation extraction using contextual semantic-guided entity-centric GCN, and Chinese mineral named entity recognition using the BERT model. Algorithms are also being used to improve Chinese named entity recognition using large-scale syntactic dependency graph, and for joint entity recognition and relation extraction using artificial neural networks. The research also explores different methods and datasets for entity relation extraction, improving entity relationship recognition with insufficient data using a multi-neural network cooperation model, and discusses the current state and future technologies of relation extraction. Furthermore, algorithms are used for biomedical entity linking, improving entity linking using deep learning techniques, and improving joint extraction of entity and relation triples using a hierarchical cascade labeling model.","da":"Enheds-ekstraktion: Forskere bruger algoritmer til automatisk at bygge sølv-standard NER-korpora fra kinesisk Wikipedia, udtrække enheder og relationer fra tekst ved hjælp af ontologi og induktiv logikprogrammering, og forbedre kinesisk enhedsattributekstraktion ved hjælp af bidirektionelle LSTM-netværk. De bruger også algoritmer baseret på DQN, vidensgraf og BERT til navngivet enheds- og relationsekstraktion og den bidirektionelle maksimal-entropi Markov-model til kinesisk enhedsrelationsekstraktion. Derudover bruges algoritmer til navngivet enhedsgenkendelse og relationsekstraktion på en struktureret måde, relationsekstraktion ved brug af kontekstuel semantisk-guidet enhedscentrisk GCN og kinesisk mineralnavngivet enhedsgenkendelse ved hjælp af BERT-modellen. Algoritmer bruges også til at forbedre kinesisk navngivet enhedsgenkendelse ved hjælp af storskala syntaktisk afhængighedsgraf og til fælles enhedsgenkendelse og relationsekstraktion ved hjælp af kunstige neurale netværk. Forskningen udforsker også forskellige metoder og datasæt til enhedsrelationsekstraktion, forbedrer enhedsrelationsgenkendelse med utilstrækkelige data ved brug af en multi-neuralt netværk samarbedsmodel og diskuterer den aktuelle status og fremtidige teknologier for relationsekstraktion. Desuden bruges algoritmer til biomedicinsk enhedslinking, forbedrer enhedslinking ved brug af dybe læringsteknikker og forbedrer fælles udtrækning af enheds- og relationstripler ved hjælp af en hierarkisk kaskade-etiketteringsmodel."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}