{"id":"c464","number":1554,"headline":{"en":"Touch and Gesture Recognition","da":"Berørings- og gestusgenkendelse"},"content":{"en":"Touch and Gesture Recognition: Researchers have been exploring various ways to improve human-computer interaction through touch and gesture recognition. Algorithms play a crucial role in enhancing the functionality and performance of wearable input devices like SCURRY, enabling better finger-click recognition. They also enable touch actions on smart TVs, improve touch control accuracy for smart mobile furniture, and even transform regular table surfaces into touch-sensitive displays. Additionally, algorithms have been developed to expand the touch interface of smartwatches to the back of the hand, enhance touch recognition for multifunctional interactive electronics, and improve human-machine interaction in virtual/augmented reality through haptic-feedback smart gloves. These advancements in algorithmic technology aim to create more intuitive and seamless interactions between humans and machines.","da":"Berørings- og gestusgenkendelse: Forskere har undersøgt forskellige metoder til at forbedre menneske-computer interaktion gennem berørings- og gestusgenkendelse. Algoritmer spiller en afgørende rolle i at forbedre funktionaliteten og ydeevnen af bærbare inputenheder som SCURRY, hvilket muliggør bedre genkendelse af fingerklik. De gør det også muligt at udføre berøringshandlinger på smart-tv'er, forbedrer nøjagtigheden af berøringskontrol for smarte mobile møbler og kan endda omdanne almindelige bordoverflader til berøringsfølsomme displays. Derudover er der udviklet algoritmer til at udvide berøringsinterfacet på smartwatches til håndryggen, forbedre berøringsgenkendelse for multifunktionelle interaktive elektronikprodukter og forbedre menneske-maskine interaktion i virtuel/augmenteret virkelighed gennem haptik-feedback smart-handsker. Disse fremskridt inden for algoritmeteknologi har til formål at skabe mere intuitive og sømløse interaktioner mellem mennesker og maskiner."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}