{"id":"c492","number":159,"headline":{"en":"Structural Optimization Advances","da":"Fremskridt inden for strukturel optimering"},"content":{"en":"Structural Optimization Advances: Researchers have explored various research questions in the field of structural optimization. They have investigated critical parameters to consider, the design of structures for multiple load cases, the use of finite element-based analysis models, effective algorithms for solving nonlinear programs, and the current state of research in structural shape optimization. They have also explored the application of structural optimization to structures with frequency and mode shape constraints, modifications to classical optimization methods, and the stability and efficiency of homogenization-based topology optimizations. Additionally, they have examined the difficulties in designing structural systems against worst possible loads, the use of second-order approximations and dual theory in optimization, the difference between direct and indirect methods, and the application of optimality criteria and mathematical programming methods. Finally, they have explored the use of the interior penalty function, optimality criteria for multidisciplinary design optimization, and the combination of sensitivity analysis and a level-set method in structural optimization.","da":"Fremskridt inden for strukturel optimering: Forskere har undersøgt forskellige forskningsspørgsmål inden for strukturel optimering. De har undersøgt kritiske parametre, der skal overvejes, design af strukturer for flere lasttilfælde, brugen af finit element-baserede analysemodeller, effektive algoritmer til løsning af ikke-lineære programmer og den aktuelle status for forskning i strukturel formoptimering. De har også udforsket anvendelsen af strukturel optimering på strukturer med frekvens- og modenhedsformerestriktioner, ændringer af klassiske optimeringsmetoder samt stabiliteten og effektiviteten af homogeniseringsbaserede topologioptimeringer. Derudover har de undersøgt vanskelighederne ved at designe strukturelle systemer mod de værste mulige laster, brugen af andenordens tilnærmelser og dual teori i optimering, forskellen mellem direkte og indirekte metoder samt anvendelsen af optimalitetskriterier og matematiske programmeringsmetoder. Endelig har de undersøgt brugen af den indre straf-funktion, optimalitetskriterier for tværfaglig designoptimering samt kombinationen af følsomhedsanalyse og en niveau-sæt metode i strukturel optimering."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}