{"id":"c507","number":3536,"headline":{"en":"Supplier Selection Algorithms","da":"Leverandørudvælgelsesalgoritmer"},"content":{"en":"Supplier Selection Algorithms: Researchers have explored various algorithms to improve the process of supplier selection and evaluation. These algorithms include Fuzzy Analytic Network Process (ANP), Quality Function Deployment (QFD), Fuzzy Adaptive Resonance Theory (ART), Fuzzy Analytic Hierarchy Process (AHP), ELECTRE III, Vikor algorithm, Fuzzy TOPSIS with vague sets method, Influence diagram, Fuzzy Logic, Fuzzy Decision Support System, Fuzzy Supplier Selection Algorithm (FSSA), Fuzzy Analytical Hierarchy Process (FAHP), Grey Relational Analysis (GRA), Fuzzy Weighted Average (FWA) method, Fuzzy Multiple Attribute Decision-Making method, Fuzzy NSGA-II, Z-Numbers, Genetic Algorithm (GA), Modified Fuzzy Analytic Hierarchical Process (FAHP), Generalized Choquet Fuzzy Integral (GCFI), Non-dominated Sorting GA (NSGA-II), Lingo software, Analytic Hierarchy Process (AHP), Technique for Order Preference by Similarity to Ideal Solutions (TOPSIS), Linear Assignment Method (LAM), and Fuzzy Best-Worst Method (BWM). These algorithms aim to make supplier selection more efficient and effective in various supply chain management scenarios.","da":"Leverandørudvælgelsesalgoritmer: Forskere har udforsket forskellige algoritmer for at forbedre processen med leverandørudvælgelse og evaluering. Disse algoritmer inkluderer Fuzzy Analytic Network Process (ANP), Quality Function Deployment (QFD), Fuzzy Adaptive Resonance Theory (ART), Fuzzy Analytic Hierarchy Process (AHP), ELECTRE III, Vikor-algoritmen, Fuzzy TOPSIS med vage sæt-metoden, Indflydelsesdiagram, Fuzzy Logik, Fuzzy Decision Support System, Fuzzy Supplier Selection Algorithm (FSSA), Fuzzy Analytisk Hierarkisk Process (FAHP), Grey Relational Analysis (GRA), Fuzzy Vægtet Gennemsnit (FWA)-metoden, Fuzzy Multiple Attribute Decision-Making-metoden, Fuzzy NSGA-II, Z-Numre, Genetisk Algoritme (GA), Modificeret Fuzzy Analytisk Hierarkisk Process (FAHP), Generalized Choquet Fuzzy Integral (GCFI), Non-dominated Sorting GA (NSGA-II), Lingo-software, Analytisk Hierarkisk Process (AHP), Teknik til Ordrepræference ved Lighed til Ideelle Løsninger (TOPSIS), Lineær Tildelingsmetode (LAM) og Fuzzy Best-Worst Method (BWM). Disse algoritmer sigter mod at gøre leverandørudvælgelsen mere effektiv og effektiv i forskellige forsyningskædehåndteringsscenarier."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}