{"id":"c522","number":2762,"headline":{"en":"Algorithmic Impact","da":"Algoritmepåvirkning"},"content":{"en":"Algorithmic Impact: Researchers have explored various questions related to the role of algorithms in our society. They have examined the faults in a book that claimed computers have limitations, the conceptual framework needed to understand technology's fundamental problems, and the challenge to the division between humans and technology. They have also investigated how socio-technical systems research can shape more effective ICT systems, the transformations in cognitive science and their implications, and the enduring questions in cognitive research in information systems. Additionally, they have explored the implications of post-humanism, the changing division of labor between humans and computer systems, and the HAL syndrome that challenges the regulation of technological dynamics. Furthermore, they have examined the entanglement between humans and digital technologies, the study of intelligent technologies beyond design and use, and the ways cognitive computing systems challenge assumptions of user-system interaction. They have also explored the development and future of technology, the understanding of algorithms as cultural activities, the importance of work design in a digital world, and the distinction between illustration and exhaustion in understanding AI and human intelligence. Finally, they have investigated the state of artificial intelligence in information systems, the intersection of software with human systems, the impact of 4E cognitive science on academia and everyday life, and the implications of transhumanism on humanity, history, and the market.","da":"Algoritmepåvirkning: Forskere har udforsket forskellige spørgsmål relateret til algoritmers rolle i vores samfund. De har undersøgt fejl i en bog, der hævdede, at computere har begrænsninger, det konceptuelle rammeværk, der er nødvendigt for at forstå teknologiens grundlæggende problemer, og udfordringen ved opdelingen mellem mennesker og teknologi. De har også undersøgt, hvordan forskning i socio-tekniske systemer kan forme mere effektive IKT-systemer, forandringerne i kognitiv videnskab og deres implikationer, samt de vedvarende spørgsmål i kognitiv forskning inden for informationssystemer. Derudover har de udforsket konsekvenserne af posthumanisme, den skiftende arbejdsdeling mellem mennesker og computersystemer, og HAL-syndromet, der udfordrer reguleringen af teknologiske dynamikker. Desuden har de undersøgt sammenfletningen mellem mennesker og digitale teknologier, studiet af intelligente teknologier ud over design og brug, samt måder, hvorpå kognitive databehandlingssystemer udfordrer antagelser om bruger-system interaktion. De har også udforsket teknologiens udvikling og fremtid, forståelsen af algoritmer som kulturelle aktiviteter, vigtigheden af arbejdsdesign i en digital verden, og forskellen mellem illustration og udmattelse i forståelsen af AI og menneskelig intelligens. Endelig har de undersøgt tilstanden af kunstig intelligens i informationssystemer, krydsfeltet mellem software og menneskelige systemer, påvirkningen af 4E kognitiv videnskab på akademia og hverdagsliv, og implikationerne af transhumanisme på menneskeheden, historien og markedet."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}