{"id":"c537","number":410,"headline":{"en":"Algorithmic Control Strategies","da":"Algoritmiske kontrolstrategier"},"content":{"en":"Algorithmic Control Strategies: Researchers are using algorithms to achieve control objectives in multilevel converters, balance the neutral-point potential in three-level NPC converters, control power factor correction and DC-link voltage regulation in three-phase NPC converters, minimize low-frequency neutral-point voltage oscillations in NPC converters, implement modified carrier-based PWM strategies for three-level NPC voltage source inverters, and implement simplified PWM strategies for neutral-point-clamped three-level converters. Algorithms are also being used to implement modulation strategies for multiphase neutral-point-clamped converters, balance the neutral-point in NPC inverters using a hybrid control strategy, and implement 3D-space vector modulation algorithms for three-phase four-wire neutral point clamped inverter systems. Additionally, algorithms are being used to minimize neutral-point voltage deviations in three-level inverter-based shunt active power filters, balance the neutral point potential in three-level NPC inverters based on SHEPWM, eliminate low-frequency neutral-point voltage oscillations in NPC converters using a hybrid modulation strategy, and implement generalized PWM-based methods for multiphase NPC converters with capacitor voltage balance capability. Furthermore, algorithms are being used to implement space virtual-vector modulation for balancing the neutral-point voltage in nested neutral-point clamped converters, improve PWM schemes for three-level inverters with neutral-point voltage balancing, implement modulation strategies with unconditional neutral point voltage balance for neutral point clamped three-level converters, and implement optimal neutral-point voltage balancing algorithms for three-phase three-level converters. Finally, algorithms are being used to implement optimized SVPWM strategies for postfault three-level NPC voltage source inverters, hybrid discontinuous PWM algorithms for balancing neutral point voltage in 3L-NPC inverters, active modulation strategies for capacitor voltage balancing in three-level neutral-point-clamped converters, and new neutral-point voltage balance control algorithms based on virtual space vector modulation for three-level NPC converters.","da":"Algoritmiske kontrolstrategier: Forskere anvender algoritmer til at opnå kontrolmål i multilevel konvertere, balancere neutralpunkts potentiale i tre-niveau NPC konvertere, kontrollere effektfaktorkorrektion og DC-link spændingsregulering i tre-fase NPC konvertere, minimere lavfrekvente neutralpunktsspændingsoscillationer i NPC konvertere, implementere modificerede carrier-baserede PWM strategier for tre-niveau NPC spændingskilde invertere, og implementere forenklede PWM strategier for neutralpunkt-klemte tre-niveau konvertere. Algoritmer bruges også til at implementere modulationsstrategier for flerfase neutralpunkt-klemte konvertere, balancere neutralpunktet i NPC invertere ved hjælp af en hybrid kontrolstrategi og implementere 3D-space vektor modulationsalgoritmer for tre-fase fire-leders neutralpunkt klemte invertersystemer. Derudover anvendes algoritmer til at minimere neutralpunktsspændingsafvigelser i tre-niveau inverter-baserede shunt aktive strømfiltre, balancere neutralpunkt potentiale i tre-niveau NPC invertere baseret på SHEPWM, eliminere lavfrekvente neutralpunktsspændingsoscillationer i NPC konvertere ved hjælp af en hybrid modulationsstrategi, og implementere generaliserede PWM-baserede metoder til flerfase NPC konvertere med kapacitorspændingsbalance kapabilitet. Yderligere bruges algoritmer til at implementere space virtual-vector modulation for at balancere neutralpunktsspændingen i nested neutral-point klemte konvertere, forbedre PWM ordninger for tre-niveau invertere med neutralpunktsspændingsbalance, implementere modulationsstrategier med ubetinget neutralpunktsspændingsbalance for neutralpunkt klemte tre-niveau konvertere, og implementere optimale neutralpunktsspændingsbalanceringsalgoritmer for tre-fase tre-niveau konvertere. Endelig bruges algoritmer til at implementere optimerede SVPWM strategier for postfejl tre-niveau NPC spændingskilde invertere, hybrid diskontinuerlige PWM algoritmer for balancering af neutralpunktsspænding i 3L-NPC invertere, aktive modulationsstrategier for kapacitatorspændingsbalance i tre-niveau neutralpunkt-klemte konvertere, og nye neutralpunktsspændingsbalanceringskontrolalgoritmer baseret på virtuel space vector modulation for tre-niveau NPC konvertere."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}