{"id":"c600","number":173,"headline":{"en":"Fault detection algorithms","da":"Fejldetektionsalgoritmer"},"content":{"en":"Fault detection algorithms: Researchers have proposed various algorithms to improve fault detection, diagnosis, and monitoring in different industrial processes. These algorithms include modified independent component analysis, finite Gaussian mixture models, particle swarm optimization-based modified independent component analysis, shrinking principal component analysis, fault-relevant principal component analysis, dynamic principal component analysis, dynamic independent component analysis, Bayesian inference, PCA-ICA integrated with Bayesian method, fault-relevant variable selection, Gaussian mixture model, optimal principal components-based Bayesian method, novel dynamic PCA algorithm, sparse robust principal component analysis, dynamic weight principal component analysis method, hierarchical monitoring strategy, fourth order moment and singular value decomposition-based fault monitoring and diagnosis, Kullback-Leibler divergence analysis technique, complex independent component analysis algorithm, principal discriminative component analysis, dynamic selection approach, and integration of PCA and structural model decomposition. These algorithms aim to enhance the accuracy and efficiency of fault detection, diagnosis, and monitoring in various industries such as wastewater treatment and process industry.","da":"Fejldetektionsalgoritmer: Forskere har foreslået forskellige algoritmer til at forbedre fejldetektion, diagnose og overvågning i forskellige industrielle processer. Disse algoritmer inkluderer modificeret uafhængig komponentanalyse, endelige Gaussiske blandingsmodeller, partikel-sværmoptimeringsbaseret modificeret uafhængig komponentanalyse, skrumpende hovedkomponentanalyse, fejlrelevant hovedkomponentanalyse, dynamisk hovedkomponentanalyse, dynamisk uafhængig komponentanalyse, Bayesiansk inferens, PCA-ICA integreret med Bayesiansk metode, fejlrelevant variabeludvælgelse, Gaussisk blandingsmodel, optimal hovedkomponentbaseret Bayesiansk metode, ny dynamisk PCA-algoritme, sparsom robust hovedkomponentanalyse, dynamisk vægt hovedkomponentanalysemetode, hierarkisk overvågningsstrategi, fjerdeordens moment og singulærværdidekomponeringsbaseret fejlovervågning og diagnose, Kullback-Leibler divergensanalyseteknik, kompleks uafhængig komponentanalysealgoritme, hoveddiskriminativ komponentanalyse, dynamisk udvælgelsesmetode og integration af PCA og strukturel modeldekomponering. Disse algoritmer har til formål at forbedre nøjagtigheden og effektiviteten af fejldetektion, diagnose og overvågning i forskellige industrier såsom spildevandsbehandling og procesindustri."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}