{"id":"c62","number":2931,"headline":{"en":"Interactive Storytelling Algorithms","da":"Interaktive fortællingsalgoritmer"},"content":{"en":"Interactive Storytelling Algorithms: Algorithms play a crucial role in various aspects of interactive storytelling. They are used to drive plot resolution by deciding character actions based on user motives, expand the search space for narratives, generate linear and branching story graphs, model narrative elements in virtual worlds, reorder scenes and generate new narratives from existing content, control story pace and avoid dead-ends, add social reasoning to NPC actions, define story events and enable user interaction, search for story solutions and transform existing fragments, balance plot and character believability, compile story generation problems for efficient solving, model narrative structure and generate engaging narratives, facilitate player interaction in dynamic storytelling environments, match character performances to social context, satisfy story constraints based on player actions and preferences, create suspense in narratives, provide a logical procedure for solving narrative problems, and generate and manage the plot structure of character-based interactive narratives in games.","da":"Interaktive fortællingsalgoritmer: Algoritmer spiller en afgørende rolle i forskellige aspekter af interaktiv fortælling. De bruges til at drive plotsløsning ved at beslutte karakterhandlinger baseret på brugerens motiver, udvide søgerummet for fortællinger, generere lineære og forgrenede fortællingsgrafer, modellere narrative elementer i virtuelle verdener, omorganisere scener og generere nye fortællinger fra eksisterende indhold, kontrollere fortællingens tempo og undgå blindgyder, tilføje social ræsonnering til NPC-handlinger, definere fortællingsbegivenheder og muliggøre brugerinteraktion, søge efter fortællingsløsninger og transformere eksisterende fragmenter, balancere plot og karakterers troværdighed, kompilere fortællingsgenereringsproblemer for effektiv løsning, modellere narrativ struktur og generere engagerende fortællinger, lette spillerinteraktion i dynamiske fortællingsmiljøer, matche karakterpræstationer med social kontekst, opfylde fortællingsbegrænsninger baseret på spillerhandlinger og præferencer, skabe spænding i fortællinger, give en logisk procedure for at løse narrative problemer, samt generere og styre plotstrukturen af karakterbaserede interaktive fortællinger i spil."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}