{"id":"c751","number":2774,"headline":{"en":"Algorithmic Influence","da":"Algoritmisk indflydelse"},"content":{"en":"Algorithmic Influence: Algorithms play a significant role in shaping our online experiences and interactions on social media platforms. They can amplify human actions, exacerbating connections between disparate data points. Tech companies use accusations of manipulating algorithms to maintain their power, while influencers on Instagram are influenced by algorithms but still have some control over their behavior. Algorithms also capture the immediacy of public outrage but fail to capture its complex nature. People perceive algorithms as confining, practical, reductive, intangible, and exploitative. Traces and footprints left behind in digital environments provide insights into algorithmic biases and transparency. QAnon followers manipulate algorithms to spread their content, and algorithms mostly reinforce existing social drivers, requiring further research. Platforms exercise power by writing the rules of visibility and dissemination of content, while algorithmic meta-capital extends power beyond traditional sources. The interplay between humans and algorithms shapes our online experiences and social networks. Algorithmic visibility on social media platforms is uneven, impacting marginalized creators. Chinese fans collectively explore and utilize algorithms to increase their visibility, and algorithmic profiling on Facebook elicits a range of reactions and rationales.","da":"Algoritmisk indflydelse: Algoritmer spiller en betydelig rolle i udformningen af vores online oplevelser og interaktioner på sociale medieplatforme. De kan forstærke menneskelige handlinger og forværre forbindelser mellem forskellige datapunkter. Tech-virksomheder bruger beskyldninger om manipulation af algoritmer til at opretholde deres magt, mens influencere på Instagram påvirkes af algoritmer, men stadig har en vis kontrol over deres adfærd. Algoritmer fanger også den øjeblikkelige offentlige vrede, men formår ikke at fange dens komplekse natur. Folk opfatter algoritmer som begrænsende, praktiske, reduktive, uhåndgribelige og udnyttende. Spor og fodaftryk efterladt i digitale miljøer giver indsigt i algoritmiske fordomme og gennemsigtighed. QAnon-tilhængere manipulerer algoritmer for at sprede deres indhold, og algoritmer forstærker for det meste eksisterende sociale drivkræfter, hvilket kræver yderligere forskning. Platforme udøver magt ved at skrive reglerne for synlighed og spredning af indhold, mens algoritmisk meta-kapital udvider magten ud over traditionelle kilder. Samspillet mellem mennesker og algoritmer former vores online oplevelser og sociale netværk. Algoritmisk synlighed på sociale medieplatforme er ujævn, hvilket påvirker marginaliserede skabere. Kinesiske fans udforsker og udnytter kollektivt algoritmer for at øge deres synlighed, og algoritmisk profilering på Facebook fremkalder en række reaktioner og begrundelser."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}