{"id":"c771","number":1688,"headline":{"en":"Morphometric Algorithms","da":"Morphometriske Algoritmer"},"content":{"en":"Morphometric Algorithms: Scientists are using algorithms to answer a variety of questions in the field of morphometrics, which involves analyzing the shape and size of biological specimens. These algorithms are able to construct and compare trees, analyze shape space, estimate missing information, determine distances between surfaces, analyze anatomical features, correct distortion in fossils, determine anatomical orientations, place correspondence points on 3D models, compute distances without landmarks, perform shape analysis without landmarks, search for morphological convergence, infer ancestral shape ontogenies, visualize and analyze morphological variation, quantify bilateral asymmetry, identify physical features that differentiate shapes, assess regional diversity, and assess the impact of different approaches and densities on shape differences. Algorithms play a crucial role in these studies by performing complex calculations and measurements automatically, allowing scientists to gain insights into the shape and form of biological specimens.","da":"Morphometriske Algoritmer: Forskere bruger algoritmer til at besvare en række spørgsmål inden for morfometri, som indebærer analyse af form og størrelse på biologiske prøver. Disse algoritmer er i stand til at konstruere og sammenligne træer, analysere formrum, estimere manglende information, bestemme afstande mellem overflader, analysere anatomiske træk, rette forvrængninger i fossiler, bestemme anatomiske orienteringer, placere korrespondancepunkter på 3D-modeller, beregne afstande uden landemærker, udføre formanalyse uden landemærker, søge efter morfologisk konvergens, udlede forfædres formontogenier, visualisere og analysere morfologisk variation, kvantificere bilateral asymmetri, identificere fysiske træk der adskiller former, vurdere regional diversitet og vurdere effekten af forskellige tilgange og tætheder på forskelle i form. Algoritmer spiller en afgørende rolle i disse studier ved automatisk at udføre komplekse beregninger og målinger, hvilket giver forskere mulighed for at få indsigt i form og struktur af biologiske prøver."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}