{"id":"c929","number":1714,"headline":{"en":"Intrinsic Disorder Prediction","da":"Forudsigelse af intrinsisk uorden"},"content":{"en":"Intrinsic Disorder Prediction: Bioinformatic tools are used to identify and characterize intrinsically disordered proteins. In-silico predictors are assessed for their ability to predict disordered regions. Multiple intrinsic disorder prediction methods are combined into a meta-prediction method. Algorithms are used to identify similar patterns of structural flexibility in proteins. Protein disorder prediction is applied in various biomedical fields. Algorithms are developed to predict secondary structure and intrinsic disorder simultaneously. There are multiple types of predictors of intrinsic disorder. Protein disorder can be predicted based on energy estimation using algorithms. Guidelines are needed to evaluate and report computational protein disorder predictions. Software tools are developed to interpret and visualize intrinsic disorder predictions. Algorithms are developed to predict pH-dependent order-disorder transitions in intrinsically disordered proteins. Protein disorder predictions are analyzed using a protein structural alphabet. Protein disorder predictions can be enhanced with unambiguous experimental annotation and visualization of evolutionary conservation. Algorithms are developed to achieve accurate intrinsic disorder prediction with putative propensities of disorder functions. The role of disordered protein/region prediction is assessed in the context of AlphaFold2. Compositional biases of intrinsically disordered proteins and regions are analyzed and compared to predictions. There are various resources available for the computational prediction of intrinsic disorder in proteins. An overview update is provided on the computational prediction of intrinsic disorder in proteins.","da":"Forudsigelse af intrinsisk uorden: Bioinformatiske værktøjer bruges til at identificere og karakterisere intrinsisk uordnede proteiner. In-silico forudsigere vurderes for deres evne til at forudsige uordnede områder. Flere metoder til forudsigelse af intrinsisk uorden kombineres i en metaprediktionsmetode. Algoritmer bruges til at identificere lignende mønstre af strukturel fleksibilitet i proteiner. Forudsigelse af proteinuorden anvendes i forskellige biomedicinske felter. Algoritmer udvikles til samtidig at forudsige sekundærstruktur og intrinsisk uorden. Der er flere typer forudsigere af intrinsisk uorden. Proteinuorden kan forudsiges baseret på energiestimater ved hjælp af algoritmer. Der er behov for retningslinjer til at evaluere og rapportere computerbaserede forudsigelser af proteinuorden. Softwareværktøjer udvikles til at fortolke og visualisere forudsigelser af intrinsisk uorden. Algoritmer udvikles til at forudsige pH-afhængige orden-uorden overgange i intrinsisk uordnede proteiner. Forudsigelser af proteinuorden analyseres ved hjælp af et proteinstrukturalfabet. Forudsigelser af proteinuorden kan forbedres med entydig eksperimentel annotation og visualisering af evolutionær konservering. Algoritmer udvikles til at opnå nøjagtig intrinsisk uorden forudsigelse med potentielle tilbøjeligheder til uorden funktioner. Rollen af forudsigelse af uordnede proteiner/områder vurderes i sammenhæng med AlphaFold2. Sammensætningsbias af intrinsisk uordnede proteiner og områder analyseres og sammenlignes med forudsigelser. Der er forskellige ressourcer til rådighed for computerbaseret forudsigelse af intrinsisk uorden i proteiner. En oversigt og opdatering gives om den computerbaserede forudsigelse af intrinsisk uorden i proteiner."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}