{"id":"c998","number":1098,"headline":{"en":"Marine algorithmics","da":"Marine algoritmik"},"content":{"en":"Marine algorithmics: Scientists have been using algorithms to study and monitor marine life in various ways. These algorithms have been developed to detect and locate vocalizing marine mammals, track the calls of fin whales, assess fish populations in rivers, categorize different types of bottom habitat in estuaries, localize and track finless porpoises, estimate the density of cetacean populations, measure seagrass metrics, track fin whales in the Pacific Ocean, estimate the density of sperm whales, measure the vertical distribution of pelagic fauna, study marine mammals in open ocean environments, measure swimming speed of fish, monitor the environment around marine renewable energy devices, track fish and seabird behavior around tidal turbine structures, and estimate target strength of fish assemblages. These algorithms are being used to gather valuable information about marine ecosystems and help in their conservation.","da":"Marine algoritmik: Forskere har brugt algoritmer til at studere og overvåge marine liv på forskellige måder. Disse algoritmer er blevet udviklet til at opdage og lokalisere vokaliserende marine pattedyr, spore kaldene fra finhvaler, vurdere fiskebestande i floder, kategorisere forskellige typer bundhabitater i flodmundinger, lokalisere og spore nise uden fin, estimere tæthed af hvalbestande, måle målinger af ålegræs, spore finhvaler i Stillehavet, estimere tæthed af kaskelotter, måle den vertikale fordeling af pelagisk fauna, studere marine pattedyr i åbne havmiljøer, måle svømmehastighed af fisk, overvåge miljøet omkring marine vedvarende energianlæg, spore fisk og havfugles adfærd omkring tidevandsturbinestrukturer, og estimere målstyrken af fiskesamlinger. Disse algoritmer bruges til at indsamle værdifuld information om marine økosystemer og hjælpe med deres beskyttelse."},"bots":{"critic":{"en":null,"da":null},"potential":{"en":null,"da":null}}}